Rhino.Geometry.Brep
Boundary Representation. A surface or polysurface along with trim curve information.

Rhino.Geometry.Brep.TryConvertBrep(Rhino.Geometry.GeometryBase)
Attempts to convert a generic Geometry object into a Brep.
geometry: Geometry to convert, not all types of GeometryBase can be represented by BReps.
Returns: Brep if a brep form could be created or null if this is not possible. If geometry was of type Brep to
begin with, the same object is returned, i.e. it is not duplicated.

Rhino.Geometry.Brep.CopyTrimCurves(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface,System.Double)
Copy all trims from a Brep face onto a surface.
trimSource: Brep face which defines the trimming curves.
surfaceSource: The surface to trim.
tolerance: Tolerance to use for rebuilding 3D trim curves.
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.BoundingBox)
Constructs new brep that matches a bounding box.
box: A box to use for creation.
Returns: A new brep; or null on failure.

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.Box)
Constructs new brep that matches an aligned box.
box: Box to match.
Returns: A Brep with 6 faces that is similar to the Box.

Rhino.Geometry.Brep.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs new brep from 8 corner points.
corners:
8 points defining the box corners arranged as the vN labels indicate.
v7_______e6____v6
|\             |\
| e7           | e5
|  \ ______e4_____\
e11 v4         |   v5
|   |        e10   |
|   |          |   |
v3--|---e2----v2   e9
\  e8          \  |
e3 |            e1|
\|             \|
v0_____e0______v1
Returns: A new box brep, on null on error.

Rhino.Geometry.Brep.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Boolean,System.Boolean)
Constructs a Brep definition of a cylinder.
cylinder: cylinder.IsFinite() must be true.
capBottom: if true end at cylinder.m_height[0] should be capped.
capTop: if true end at cylinder.m_height[1] should be capped.
Returns:
A Brep representation of the cylinder with a single face for the cylinder,
an edge along the cylinder seam, and vertices at the bottom and top ends of this
seam edge. The optional bottom/top caps are single faces with one circular edge
starting and ending at the bottom/top vertex.

Rhino.Geometry.Brep.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a Brep definition of a sphere.
sphere:
Returns:

Rhino.Geometry.Brep.CreateFromCone(Rhino.Geometry.Cone,System.Boolean)
Constructs a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
cone: A cone value.
capBottom: if true the base of the cone should be capped.
Returns: A new brep, on null on error.

Rhino.Geometry.Brep.CreateFromRevSurface(Rhino.Geometry.RevSurface,System.Boolean,System.Boolean)
Constructs a brep form of a surface of revolution.
surface: The surface of revolution.
capStart:
if true, the start of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the start of the revolute.
capEnd:
if true, the end of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the end of the revolute.
Returns: A new brep, on null on error.

Rhino.Geometry.Brep.CreatePlanarBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Constructs a set of planar breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Geometry.Curve)
Constructs a set of planar breps as outlines by the loops.
inputLoop: A curve that should form the boundaries of the surfaces or polysurfaces.
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreateFromSurface(Rhino.Geometry.Surface)
Constructs a Brep from a surface. The resulting Brep has an outer boundary made
from four trims. The trims are ordered so that they run along the south, east,
north, and then west side of the surface's parameter space.
surface: A surface to convert.
Returns: Resulting brep or null on failure.

Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface)
Constructs a Brep using the trimming information of a brep face and a surface.
Surface must be roughly the same shape and in the same location as the trimming brep face.
trimSource: BrepFace which contains trimmingSource brep.
surfaceSource: Surface that trims of BrepFace will be applied to.
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Makes a brep with one face.
corner1: A first corner.
corner2: A second corner.
corner3: A third corner.
tolerance:
Minimum edge length without collapsing to a singularity.
Returns: A boundary representation, or null on error.

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
make a Brep with one face.
corner1: A first corner.
corner2: A second corner.
corner3: A third corner.
corner4: A fourth corner.
tolerance:
Minimum edge length allowed before collapsing the side into a singularity.
Returns: A boundary representation, or null on error.

Rhino.Geometry.Brep.CreateEdgeSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Constructs a coons patch from 2, 3, or 4 curves.
curves: A list, an array or any enumerable set of curves.
Returns: resulting brep or null on failure.

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList)
Constructs a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean)
Constructs one or more Breps by lofting through a set of curves.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of loft. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.

Rhino.Geometry.Brep.CreateFromLoftRebuild(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Int32)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
rebuilding to a specified number of control points.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
rebuildPointCount: A number of points to use while rebuilding the curves. 0 leaves turns this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.

Rhino.Geometry.Brep.CreateFromLoftRefit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
refitting to a specified tolerance.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
refitTolerance: A distance to use in refitting, or 0 if you want to turn this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.

Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Boolean Union of a set of Breps.
breps: Breps to union.
tolerance: Tolerance to use for union operation.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Intersection of two sets of Breps.
firstSet: First set of Breps.
secondSet: Second set of Breps.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Intersection of two Breps.
firstBrep: First Brep for boolean intersection.
secondBrep: Second Brep for boolean intersection.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Difference of two sets of Breps.
firstSet: First set of Breps (the set to subtract from).
secondSet: Second set of Breps (the set to subtract).
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Difference of two Breps.
firstBrep: First Brep for boolean difference.
secondBrep: Second Brep for boolean difference.
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array.
brepsToJoin: A list, an array or any enumerable set of breps to join.
tolerance: 3d distance tolerance for detecting overlapping edges.
Returns: new joined breps on success, null on failure.

Rhino.Geometry.Brep.MergeBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This
function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using
JoinBreps or CreateBooleanUnion functions instead.
brepsToMerge: must contain more than one Brep.
tolerance: the tolerance to use when merging.
Returns: Single merged Brep on success. Null on error.
Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)

Rhino.Geometry.Brep.CreateContourCurves(Rhino.Geometry.Brep,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Constructs the contour curves for a brep at a specified interval.
brepToContour: A brep or polysurface.
contourStart: A point to start.
contourEnd: A point to use as the end.
interval: The interaxial offset in world units.
Returns: An array with intersected curves. This array can be empty.

Rhino.Geometry.Brep.CreateContourCurves(Rhino.Geometry.Brep,Rhino.Geometry.Plane)
Constructs the contour curves for a brep, using a slicing plane.
brepToContour: A brep or polysurface.
sectionPlane: A plane.
Returns: An array with intersected curves. This array can be empty.

Rhino.Geometry.Brep.GetRegions
Gets an array containing all regions in this brep.
Returns: An array of regions in this brep. This array can be empty, but not null.

Rhino.Geometry.Brep.Duplicate
Copies this brep.
Returns: A brep.

Rhino.Geometry.Brep.DuplicateBrep
Same as Rhino.Geometry.Brep.Duplicate, but already performs a cast to a brep.
This cast always succeeds.
Returns: A brep.

Rhino.Geometry.Brep.DuplicateSubBrep(System.Collections.Generic.IEnumerable{System.Int32})
Copy a subset of this Brep into another Brep.
faceIndices:
array of face indices in this brep to copy.
(If any values in faceIndices are out of range or if faceIndices contains
duplicates, this function will return null.)
Returns: A brep, or null on error.

Rhino.Geometry.Brep.DuplicateEdgeCurves
Duplicate all the edges of this Brep.
Returns: An array of edge curves.

Rhino.Geometry.Brep.DuplicateEdgeCurves(System.Boolean)
Duplicate edges of this Brep.
nakedOnly:
If true, then only the "naked" edges are duplicated.
If false, then all edges are duplicated.
Returns: Array of edge curves on success.

Rhino.Geometry.Brep.GetWireframe(System.Int32)
Constructs all the Wireframe curves for this Brep.
density: Wireframe density. Valid values range between -1 and 99.
Returns: An array of Wireframe curves or null on failure.

Rhino.Geometry.Brep.DuplicateVertices
Duplicate all the corner vertices of this Brep.
Returns: An array or corner vertices.

Rhino.Geometry.Brep.Flip
Reverses entire brep orientation of all faces.

Rhino.Geometry.Brep.IsDuplicate(Rhino.Geometry.Brep,System.Double)
See if this and other are same brep geometry.
other: other brep.
tolerance: tolerance to use when comparing control points.
Returns: true if breps are the same.

Rhino.Geometry.Brep.IsValidTopology(System.String@)
Tests the brep to see if its topology information is valid.
log:
If the brep topology is not valid, then a brief english description of
the problem is appended to the log.  The information appended to log is
suitable for low-level debugging purposes by programmers and is not
intended to be useful as a high level user interface tool.
Returns: true if the topology is valid; false otherwise.

Rhino.Geometry.Brep.IsValidGeometry(System.String@)
Expert user function that tests the brep to see if its geometry information is valid.
The value of brep.IsValidTopology() must be true before brep.IsValidGeometry() can be
safely called.
log:
If the brep geometry is not valid, then a brief description of the problem
in English is assigned to this out parameter. The information is suitable for
low-level debugging purposes by programmers and is not intended to be
useful as a high level user interface tool. Otherwise, System.String.Empty.
Returns: A value that indicates whether the geometry is valid.

Rhino.Geometry.Brep.IsValidTolerancesAndFlags(System.String@)
Expert user function that tests the brep to see if its tolerances and
flags are valid.  The values of brep.IsValidTopology() and
brep.IsValidGeometry() must be true before brep.IsValidTolerancesAndFlags()
can be safely called.
log:
If the brep tolerance or flags are not valid, then a brief description
of the problem in English is assigned to this out parameter. The information is
suitable for low-level debugging purposes by programmers and is not
intended to be useful as a high level user interface tool. Otherwise, System.String.Empty.
Returns: A value that indicates

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d)
Finds a point on the brep that is closest to testPoint.
testPoint: Base point to project to brep.
Returns: The point on the Brep closest to testPoint or Point3d.Unset if the operation failed.

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.ComponentIndex@,System.Double@,System.Double@,System.Double,Rhino.Geometry.Vector3d@)
Finds a point on a brep that is closest to testPoint.
testPoint: base point to project to surface.
closestPoint: location of the closest brep point.
ci: Component index of the brep component that contains
the closest point. Possible types are brep_face, brep_edge or brep_vertex.
s: If the ci type is brep_edge, then s is the parameter
of the closest edge point.
t: If the ci type is brep_face, then (s,t) is the parameter
of the closest edge point.
maximumDistance:
If maximumDistance > 0, then only points whose distance
is <= maximumDistance will be returned. Using a positive
value of maximumDistance can substantially speed up the search.
normal: The normal to the face if ci is a brep_face
and the tangent to the edge if ci is brep_edge.
Returns: true if the operation succeeded; otherwise, false.

Rhino.Geometry.Brep.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determines if point is inside Brep.  This question only makes sense when
the brep is a closed manifold.  This function does not not check for
closed or manifold, so result is not valid in those cases.  Intersects
a line through point with brep, finds the intersection point Q closest
to point, and looks at face normal at Q.  If the point Q is on an edge
or the intersection is not transverse at Q, then another line is used.
point: 3d point to test.
tolerance:
3d distance tolerance used for intersection and determining strict inclusion.
A good default is RhinoMath.SqrtEpsilon.
strictlyIn:
if true, point is in if inside brep by at least tolerance.
if false, point is in if truly in or within tolerance of boundary.
Returns:
true if point is in, false if not.

Rhino.Geometry.Brep.CapPlanarHoles(System.Double)
Returns a new Brep that is equivalent to this Brep with all planar holes capped.
tolerance: Tolerance to use for capping.
Returns: New brep on success. null on error.

Rhino.Geometry.Brep.Join(Rhino.Geometry.Brep,System.Double,System.Boolean)
If any edges of this brep overlap edges of otherBrep, merge a copy of otherBrep into this
brep joining all edges that overlap within tolerance.
otherBrep: Brep to be added to this brep.
tolerance: 3d distance tolerance for detecting overlapping edges.
compact: if true, set brep flags and tolerances, remove unused faces and edges.
Returns: true if any edges were joined.
Remarks:
if no edges overlap, this brep is unchanged.
otherBrep is copied if it is merged with this, and otherBrep is always unchanged
Use this to join a list of breps in a series.
When joining multiple breps in series, compact should be set to false.
Call compact on the last Join.

Rhino.Geometry.Brep.JoinNakedEdges(System.Double)
Joins naked edge pairs within the same brep that overlap within tolerance.
tolerance: The tolerance value.
Returns: number of joins made.

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Double)
Merges adjacent coplanar faces into single faces.
tolerance: 3d tolerance for determining when edges are adjacent.
Returns: true if faces were merged.  false if no faces were merged.

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double)
Splits a Brep into pieces.
splitter: A splitting surface or polysurface.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of breps. This array can be empty.

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double,System.Boolean@)
Splits a Brep into pieces.
splitter: The splitting polysurface.
intersectionTolerance: The tolerance with which to compute intersections.
toleranceWasRaised:
set to true if the split failed at intersectionTolerance but succeeded
when the tolerance was increased to twice intersectionTolerance.
Returns: A new array of breps. This array can be empty.

Rhino.Geometry.Brep.Trim(Rhino.Geometry.Brep,System.Double)
Trims a brep with an oriented cutter. The parts of the brep that lie inside
(opposite the normal) of the cutter are retained while the parts to the
outside (in the direction of the normal) are discarded.  If the Cutter is
closed, then a connected component of the Brep that does not intersect the
cutter is kept if and only if it is contained in the inside of cutter.
That is the region bounded by cutter opposite from the normal of cutter,
If cutter is not closed all these components are kept.
cutter: A cutting brep.
intersectionTolerance: A tolerance value with which to compute intersections.
Returns: This Brep is not modified, the trim results are returned in an array.

Rhino.Geometry.Brep.Trim(Rhino.Geometry.Plane,System.Double)
Trims a Brep with an oriented cutter.  The parts of Brep that lie inside
(opposite the normal) of the cutter are retained while the parts to the
outside ( in the direction of the normal ) are discarded. A connected
component of Brep that does not intersect the cutter is kept if and only
if it is contained in the inside of Cutter.  That is the region bounded by
cutter opposite from the normal of cutter, or in the case of a Plane cutter
the halfspace opposite from the plane normal.
cutter: A cutting plane.
intersectionTolerance: A tolerance value with which to compute intersections.
Returns: This Brep is not modified, the trim results are returned in an array.

Rhino.Geometry.Brep.GetArea
Compute the Area of the Brep. If you want proper Area data with moments
and error information, use the AreaMassProperties class.
Returns: The area of the Brep.

Rhino.Geometry.Brep.GetArea(System.Double,System.Double)
Compute the Area of the Brep. If you want proper Area data with moments
and error information, use the AreaMassProperties class.
relativeTolerance: Relative tolerance to use for area calculation.
absoluteTolerance: Absolute tolerance to use for area calculation.
Returns: The area of the Brep.

Rhino.Geometry.Brep.GetVolume
Compute the Volume of the Brep. If you want proper Volume data with moments
and error information, use the VolumeMassProperties class.
Returns: The volume of the Brep.

Rhino.Geometry.Brep.GetVolume(System.Double,System.Double)
Compute the Volume of the Brep. If you want proper Volume data with moments
and error information, use the VolumeMassProperties class.
relativeTolerance: Relative tolerance to use for area calculation.
absoluteTolerance: Absolute tolerance to use for area calculation.
Returns: The volume of the Brep.

Rhino.Geometry.Brep.AddSurface(Rhino.Geometry.Surface)
Adds a 3D surface used by BrepFace.
surface: A copy of the surface is added to this brep.
Returns:
Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.

Rhino.Geometry.Brep.RebuildTrimsForV2(Rhino.Geometry.BrepFace,Rhino.Geometry.NurbsSurface)
No support is available for this function.
Expert user function used by MakeValidForV2 to convert trim
curves from one surface to its NURBS form. After calling this function,
you need to change the surface of the face to a NurbsSurface.
face:
Face whose underlying surface has a parameterization that is different
from its NURBS form.
nurbsSurface: NURBS form of the face's underlying surface.
Remarks:
Don't call this function unless you know exactly what you are doing.

Rhino.Geometry.Brep.Compact
Deletes any unreferenced objects from arrays, reindexes as needed, and
shrinks arrays to minimum required size. Uses CUllUnused* members to
delete any unreferenced objects from arrays.

Rhino.Geometry.Brep.CullUnusedFaces
Culls faces with m_face_index == -1.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnusedLoops
Culls loops with m_loop_index == -1.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnusedTrims
Culls trims with m_trim_index == -1.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnusedEdges
Culls edges with m_edge_index == -1.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnusedVertices
Culls vertices with m_vertex_index == -1.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnused3dCurves
Culls 2d curves not referenced by a trim.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnused2dCurves
Culls 3d curves not referenced by an edge.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.CullUnusedSurfaces
Culls surfaces not referenced by a face.
Returns: true if operation succeeded; false otherwise.

Rhino.Geometry.Brep.Standardize
Standardizes all trims, edges, and faces in the brep.
After standardizing, there may be unused curves and surfaces in the
brep.  Call Brep.Compact to remove these unused curves and surfaces.

Rhino.Geometry.Brep.Edges
Gets the brep edges list accessor.

Rhino.Geometry.Brep.Loops
Gets the brep loop list accessor.

Rhino.Geometry.Brep.Faces
Gets the brep faces list accessor.

Rhino.Geometry.Brep.IsSolid
Determines whether this brep is a solid, or a closed oriented manifold.

Rhino.Geometry.Brep.SolidOrientation
Gets the solid orientation state of this Brep.

Rhino.Geometry.Brep.IsManifold
Gets a value indicating whether or not the Brep is manifold.
Non-Manifold breps have at least one edge that is shared among three or more faces.

Rhino.Geometry.Brep.IsSurface
Returns true if the Brep has a single face and that face is geometrically the same
as the underlying surface.  I.e., the face has trivial trimming.
In this case, the surface is the first face surface. The flag
Brep.Faces[0].OrientationIsReversed records the correspondence between the surface's
natural parametric orientation and the orientation of the Brep.
“trivial trimming” here means that there is only one loop curve in the brep
and that loop curve is the same as the underlying surface boundary.