Rhino.Geometry.SurfaceCurvature.Direction(System.Int32)
Gets the principal curvature direction vector.
direction: Direction index, valid values are 0 and 1.
Returns: The specified direction vector.

Rhino.Geometry.SurfaceCurvature.Kappa(System.Int32)
Gets the Kappa curvature value.
direction: Kappa index, valid values are 0 and 1.
Returns: The specified kappa value.

Rhino.Geometry.SurfaceCurvature.OsculatingCircle(System.Int32)
Computes the osculating circle along the given direction.
direction: Direction index, valid values are 0 and 1.
Returns: The osculating circle in the given direction or Circle.Unset on failure.

Rhino.Geometry.SurfaceCurvature.UVPoint
Gets the UV location where the curvature was computed.

Rhino.Geometry.SurfaceCurvature.Point
Gets the surface point at UV.

Rhino.Geometry.SurfaceCurvature.Normal
Gets the surface normal at UV.

Rhino.Geometry.SurfaceCurvature.Gaussian
Gets the Gaussian curvature value at UV.

Rhino.Geometry.SurfaceCurvature.Mean
Gets the Mean curvature value at UV.