Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a new line segment between two points.
from: Start point of line.
to: End point of line.

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Constructs a new line segment from start point and span vector.
start: Start point of line segment.
span: Direction and length of line segment.

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Constructs a new line segment from start point, direction and length.
start: Start point of line segment.
direction: Direction of line segment.
length: Length of line segment.

Rhino.Geometry.Line.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructs a new line segment between two points.
x0: The X coordinate of the first point.
y0: The Y coordinate of the first point.
z0: The Z coordinate of the first point.
x1: The X coordinate of the second point.
y1: The Y coordinate of the second point.
z1: The Z coordinate of the second point.

Rhino.Geometry.Line.TryFitLineToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Line@)
Attempt to fit a line through a set of points.
points: The points through which to fit.
fitLine: The resulting line on success.
Returns: true on success, false on failure.

Rhino.Geometry.Line.Equals(Rhino.Geometry.Line)
Determines whether a line has the same value as this line.
other: A line.
Returns: true if other has the same coordinates as this; otherwise false.

Rhino.Geometry.Line.ToString
Contructs the string representation of this line, in the form "From,To".
Returns: A text string.

Rhino.Geometry.Line.Flip
Flip the endpoints of the line segment.

Rhino.Geometry.Line.PointAt(System.Double)
Evaluates the line at the specified parameter.
t: Parameter to evaluate line segment at. Line parameters are normalised parameters.
Returns: The point at the specified parameter.

Rhino.Geometry.Line.ClosestParameter(Rhino.Geometry.Point3d)
Finds the parameter on the infinite line segment that is closest to a test point.
testPoint: Point to project onto the line.
Returns: The parameter on the line that is closest to testPoint.

Rhino.Geometry.Line.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Finds the point on the (in)finite line segment that is closest to a test point.
testPoint: Point to project onto the line.
limitToFiniteSegment: If true, the projection is limited to the finite line segment.
Returns: The point on the (in)finite line that is closest to testPoint.

Rhino.Geometry.Line.DistanceTo(Rhino.Geometry.Point3d,System.Boolean)
Compute the shortest distance between this line segment and a test point.
testPoint: Point for distance computation.
limitToFiniteSegment: If true, the distance is limited to the finite line segment.
Returns: The shortest distance between this line segment and testPoint.

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Point3d)
Finds the shortest distance between this line as a finite segment
and a test point.
testPoint: A point to test.
Returns: The minimum distance.

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Line)
Finds the shortest distance between this line as a finite segment
and another finite segment.
testLine: A line to test.
Returns: The minimum distance.

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Point3d)
Finds the largest distance between this line as a finite segment
and a test point.
testPoint: A point to test.
Returns: The maximum distance.

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Line)
Finds the largest distance between this line as a finite segment
and another finite segment.
testLine: A line to test.
Returns: The maximum distance.

Rhino.Geometry.Line.Transform(Rhino.Geometry.Transform)
Transform the line using a Transformation matrix.
xform: Transform to apply to this line.
Returns: true on success, false on failure.

Rhino.Geometry.Line.ToNurbsCurve
Constructs a nurbs curve representation of this line.
This amounts to the same as calling NurbsCurve.CreateFromLine().
Returns: A nurbs curve representation of this line or null if no such representation could be made.

Rhino.Geometry.Line.Extend(System.Double,System.Double)
Extend the line by custom distances on both sides.
startLength:
Distance to extend the line at the start point.
Positive distance result in longer lines.
endLength:
Distance to extend the line at the end point.
Positive distance result in longer lines.
Returns: true on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line
that overlaps the box.
box: Box to extend through.
Returns: true on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: true on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
Returns: true on success, false on failure.

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: true on success, false on failure.

Rhino.Geometry.Line.TryGetPlane(Rhino.Geometry.Plane@)
Gets a plane that contains the line. The origin of the plane is at the start of the line.
If possible, a plane parallel to the world xy, yz, or zx plane is returned.
plane: If the return value is true, the plane out parameter is assigned during this call.
Returns: true on success.

Rhino.Geometry.Line.op_Equality(Rhino.Geometry.Line,Rhino.Geometry.Line)
Determines whether two lines have the same value.
a: A line.
b: Another line.
Returns: true if a has the same coordinates as b; otherwise false.

Rhino.Geometry.Line.op_Inequality(Rhino.Geometry.Line,Rhino.Geometry.Line)
Determines whether two lines have different values.
a: A line.
b: Another line.
Returns: true if a has any coordinate that distinguishes it from b; otherwise false.

Rhino.Geometry.Line.From
Start point of line segment.

Rhino.Geometry.Line.FromX
Gets or sets the X coordinate of the line From point.

Rhino.Geometry.Line.FromY
Gets or sets the Y coordinate of the line From point.

Rhino.Geometry.Line.FromZ
Gets or sets the Z coordinate of the line From point.

Rhino.Geometry.Line.To
End point of line segment.

Rhino.Geometry.Line.ToX
Gets or sets the X coordinate of the line To point.

Rhino.Geometry.Line.ToY
Gets or sets the Y coordinate of the line To point.

Rhino.Geometry.Line.ToZ
Gets or sets the Z coordinate of the line To point.

Rhino.Geometry.Line.Unset
Gets a line segment which has Rhino.Geometry.Point3d.Unset end points.

Rhino.Geometry.Line.IsValid
Gets a value indicating whether or not this line is valid.
Valid lines must have valid start and end points.

Rhino.Geometry.Line.Length
Gets or sets the length of this line segment.
Note that a negative length will invert the line segment without
making the actual length negative. The line From point will remain fixed
when a new Length is set.

Rhino.Geometry.Line.Direction
Gets the direction of this line segment.
The length of the direction vector equals the length of
the line segment.

Rhino.Geometry.Line.UnitTangent
Gets the tangent of the line segment.
Note that tangent vectors are always unit vectors.
Sets only the direction of the line, the length is maintained.

Rhino.Geometry.Line.BoundingBox
Gets the line's 3d axis aligned bounding box.
Returns: 3d bounding box.