Rhino.UI.ListBoxForm.components
Required designer variable.

Rhino.UI.ListBoxForm.Dispose(System.Boolean)
Clean up any resources being used.
disposing: true if managed resources should be disposed; otherwise, false.

Rhino.UI.ListBoxForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.