Rhino.Commands.Command.IsValidCommandName(System.String)
Determines if a string is a valid command name.
name: A string.
Returns: true if the string is a valid command name.

Rhino.Commands.Command.GetMostRecentCommands
Gets an array of most recent command descriptions.
Returns: An array of command descriptions.

Rhino.Commands.Command.#ctor
Default protected constructor. It only allows instantiation through subclassing.

Rhino.Commands.Command.GetCommandStack
Determines if Rhino is currently running a command. Because Rhino allow for transparent commands
(commands that can be run from inside of other commands), this method returns the total ids of
active commands.
Returns:
Ids of running commands or null if no commands are currently running.
The "active" command is at the end of this list.

Rhino.Commands.Command.InCommand
Determines if Rhino is currently running a command.
Returns: true if a command is currently running, false if no commands are currently running.

Rhino.Commands.Command.InScriptRunnerCommand
This is a low level tool to determine if Rhino is currently running
a script running command like "ReadCommandFile" or the RhinoScript
plug-in's "RunScript".
Returns: true if a script running command is active.

Rhino.Commands.Command.IsCommand(System.String)
Determines is a string is a command.
name: A string.
Returns: true if the string is a command.

Rhino.Commands.Command.LookupCommandId(System.String,System.Boolean)
Returns the ID of a command.
name: The name of the command.
searchForEnglishName: true if the name is to searched in English. This ensures that a '_' is prepended to the name.
Returns: An of the command, or System.Guid.Empty on error.

Rhino.Commands.Command.LookupCommandName(System.Guid,System.Boolean)
Returns the command name given a command ID.
commandId: A command ID.
englishName: true if the requested command is in English.
Returns: The command name, or null on error.

Rhino.Commands.Command.GetCommandNames(System.Boolean,System.Boolean)
Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
english:
if true, retrieve the english name for every command.
if false, retrieve the local name for every command.
loaded:
if true, only get names of currently loaded commands.
if false, get names of all registered (may not be currently loaded) commands.
Returns: An array instance with command names. This array could be empty, but not null.

Rhino.Commands.Command.DisplayHelp(System.Guid)
Displays help for a command.
commandId: A command ID.

Rhino.Commands.Command.ReplayHistory(Rhino.DocObjects.ReplayHistoryData)
Repeats an operation of a command.
replayData: The replay history information.
Returns: true if the operation succeeded.
The default implementation always returns false.

Rhino.Commands.Command.LastCommandId
Gets the ID of the last commands.

Rhino.Commands.Command.LastCommandResult
Gets the result code of the last command.

Rhino.Commands.Command.PlugIn
Gets the plug-in where this commands is placed.

Rhino.Commands.Command.Id
Gets the ID of this command.
You can associate an ID with the
GuidAttribute attribute
applied to the class.

Rhino.Commands.Command.EnglishName
Gets the name of the command.
This method is abstract.

Rhino.Commands.Command.LocalName
Gets the local name of the command.

Rhino.Commands.Command.Settings
Gets the settings of the command.

Rhino.Commands.Command.BeginCommand
Called just before command.RunCommand().

Rhino.Commands.Command.EndCommand
Called immediately after command.RunCommand().

Rhino.Commands.Command.UndoRedo
Used to monitor Rhino's built in undo/redo support.