Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer
Wrapper for a C++ ON_SimpleArray<ON_Geometry*>* or ON_SimpleArray<const ON_Geometry*>.
If you are not writing C++ code, then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Create an ON_SimpleArray<ON_Geometry*> filled with items in geometry
geometry:

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.IEnumerable)
Expects all of the items in the IEnumerable to be GeometryBase types
geometry:

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.