Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Attempts to create a rectangle from a polyline. In order for the polyline to qualify
as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
polyline: Polyline to parse.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double@,System.Double@)
Attempts to create a Rectangle from a Polyline. In order for a polyline to qualify
as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
This overload also returns deviations.
polyline: Polyline to parse.
deviation: On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation: On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new rectangle from width and height.
plane: Base plane for Rectangle.
width: Width (as measured along the base plane x-axis) of rectangle.
height: Height (as measured along the base plane y-axis) of rectangle.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Initializes a new rectangle from dimensions.
plane: Base plane for Rectangle.
width: Dimension of rectangle along the base plane x-axis.
height: Dimension of rectangle along the base plane y-axis.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new rectangle from a base plane and two corner points.
plane: Base plane for Rectangle.
cornerA: First corner of Rectangle (will be projected onto plane).
cornerB: Second corner of Rectangle (will be projected onto plane).

Rhino.Geometry.Rectangle3d.MakeIncreasing
Ensures the X and Y dimensions are increasing or singleton intervals.

Rhino.Geometry.Rectangle3d.Corner(System.Int32)
Gets the corner at the given index.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)
Returns: The point at the given corner index.

Rhino.Geometry.Rectangle3d.RecenterPlane(System.Int32)
Recenters the base plane on one of the corners.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)

Rhino.Geometry.Rectangle3d.RecenterPlane(Rhino.Geometry.Point3d)
Recenters the base plane on a new origin.
origin: New origin for plane.

Rhino.Geometry.Rectangle3d.PointAt(System.Double,System.Double)
Gets a point in Rectangle space.
x: Normalized parameter along Rectangle width.
y: Normalized parameter along Rectangle height.
Returns: The point at the given x,y parameter.

Rhino.Geometry.Rectangle3d.PointAt(System.Double)
Gets a point along the rectangle boundary.
t: Parameter along rectangle boundary. Valid values range from 0.0 to 4.0,
where each integer domain represents a single boundary edge.
Returns: The point at the given boundary parameter.

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the rectangle that is closest to a test-point.
point: Point to project.
Returns: The point on or in the rectangle closest to the test point or Point3d.Unset on failure.

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Gets the point on the rectangle that is closest to a test-point.
point: Point to project.
includeInterior: If false, the point is projected onto the boundary edge only,
otherwise the interior of the rectangle is also taken into consideration.
Returns: The point on the rectangle closest to the test point or Point3d.Unset on failure.

Rhino.Geometry.Rectangle3d.Contains(Rhino.Geometry.Point3d)
Determines if a point is included in this rectangle.
pt: Point to test. The point will be projected onto the Rectangle plane before inclusion is determined.
Returns: Point Rectangle relationship.

Rhino.Geometry.Rectangle3d.Contains(System.Double,System.Double)
Determines if two plane parameters are included in this rectangle.
x: Parameter along base plane X direction.
y: Parameter along base plane Y direction.
Returns: Parameter Rectangle relationship.

Rhino.Geometry.Rectangle3d.Transform(Rhino.Geometry.Transform)
Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
xform: Transformation to apply.

Rhino.Geometry.Rectangle3d.ToPolyline
Constructs a polyline from this rectangle.
Returns: A polyline with the same shape as this rectangle.

Rhino.Geometry.Rectangle3d.ToNurbsCurve
Constructs a nurbs curve representation of this rectangle.
Returns: A nurbs curve with the same shape as this rectangle.

Rhino.Geometry.Rectangle3d.Unset
Gets a rectangle with Unset components.

Rhino.Geometry.Rectangle3d.IsValid
Gets a value indicating whether or not this is a valid rectangle.
A rectangle is considered to be valid when the base plane and both dimensions are valid.

Rhino.Geometry.Rectangle3d.Plane
Gets or sets the base plane of the rectangle.

Rhino.Geometry.Rectangle3d.X
Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).

Rhino.Geometry.Rectangle3d.Y
Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).

Rhino.Geometry.Rectangle3d.Width
Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.

Rhino.Geometry.Rectangle3d.Height
Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.

Rhino.Geometry.Rectangle3d.Area
Gets the unsigned Area of the rectangle.

Rhino.Geometry.Rectangle3d.Circumference
Gets the circumference of the rectangle.

Rhino.Geometry.Rectangle3d.BoundingBox
Gets the world aligned boundingbox for this rectangle.

Rhino.Geometry.Rectangle3d.Center
Gets the point in the center of the rectangle.