Rhino.Geometry.Collections.NurbsSurfaceKnotList
Provides access to the knot vector of a nurbs surface.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.SuperfluousKnot(System.Boolean)
Computes the knots that are superfluous because they are not used in NURBs evaluation.
These make it appear so that the first and last surface spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
start: true if the query targets the first knot. Otherwise, the last knot.
Returns: A component.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.InsertKnot(System.Double)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.InsertKnot(System.Double,System.Int32)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
multiplicity: Multiplicity of knot to insert.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.KnotMultiplicity(System.Int32)
Get knot multiplicity.
index: Index of knot to query.
Returns: The multiplicity (valence) of the knot.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.CreateUniformKnots(System.Double)
Compute a clamped, uniform knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.CreatePeriodicKnots(System.Double)
Compute a clamped, uniform, periodic knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.Count
Gets the total number of knots in this curve.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.ClampedAtStart
Determines if a knot vector is clamped.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.ClampedAtEnd
Determines if a knot vector is clamped.