Rhino.Geometry.Collections.NurbsSurfacePointList
Provides access to the control points of a nurbs surface.

Rhino.Geometry.Collections.NurbsSurfacePointList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetGrevillePoint(System.Int32,System.Int32)
Gets the Greville point (u, v) coordinates associated with the control point at the given indices.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
Returns: A Surface UV coordinate on success, Point2d.Unset on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetControlPoint(System.Int32,System.Int32)
Gets the control point at the given (u, v) index.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
Returns: The control point at the given (u, v) index.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Sets the control point at the given (u, v) index.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
cp: The control point location to set (weight is assumed to be 1.0).
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.ControlPoint)
Sets the control point at the given (u, v) index.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
cp: The control point to set.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.CountU
Gets the number of control points in the U direction of this surface.

Rhino.Geometry.Collections.NurbsSurfacePointList.CountV
Gets the number of control points in the V direction of this surface.