Rhino.Input.Custom.GeometryAttributeFilter
If an object passes the geometry TYPE filter, then the geometry ATTRIBUTE
filter is applied.

Rhino.Input.Custom.GeometryAttributeFilter.SubSurface
If you want to accept only sub-surfaces of (multi-surface)
polysrf, then specify sub_surface.  If you do not want to
accept sub-surfaces, then specify top_surface.  Otherwise
sub-surfaces and top surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.TopSurface
If you want to accept only sub-surfaces of (multi-surface)
polysrf, then specify sub_surface.  If you do not want to
accept sub-surfaces, then specify top_surface.  Otherwise
sub-surfaces and top surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ManifoldPolysrf
If you want to accept only manifold or nonmanifold polysrfs,
then specify manifold_polysrf or nonmanifold_polysrf. Otherwise
both manifold and nonmanifold polysrfs will pass the attribute
filter.

Rhino.Input.Custom.GeometryAttributeFilter.NonmanifoldPolysrf
If you want to accept only manifold or nonmanifold polysrfs,
then specify manifold_polysrf or nonmanifold_polysrf. Otherwise
both manifold and nonmanifold polysrfs will pass the attribute
filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedPolysrf
If you want to accept only closed or open polysrfs, then
specify either closed_polysrf or open_polysrf.  Otherwise both
closed and open polysrfs will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenPolysrf
If you want to accept only closed or open polysrfs, then
specify either closed_polysrf or open_polysrf.  Otherwise both
closed and open polysrfs will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedMesh
If you want to accept only closed or open meshs, then
specify either closed_mesh or open_mesh.  Otherwise both
closed and open meshs will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenMesh
If you want to accept only closed or open meshs, then
specify either closed_mesh or open_mesh.  Otherwise both
closed and open meshs will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.SpecialLoop
slit, crvonsrf, ptonsrf, etc.