Rhino.ApplicationSettings.ShortcutKeySettings.GetMacro(Rhino.ApplicationSettings.ShortcutKey)
Get macro associated with a given keyboard shortcut
key:
Returns:

Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.ApplicationSettings.ShortcutKey,System.String)
Set macro associated with a keyboard shortcut
key:
macro: