Rhino.DocObjects.Tables.ViewTable.FlashObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean)
Cause objects selection state to change momentarily so the object
appears to flash on the screen.
list: An array, a list or any enumerable set of Rhino objects.
useSelectionColor:
If true, flash between object color and selection color. If false,
flash between visible and invisible.

Rhino.DocObjects.Tables.ViewTable.Redraw
Redraws all views.
Remarks:
If you change something in the active document -- like adding
objects, deleting objects, modifying layer or object display
attributes, etc., then you need to call CRhinoDoc::Redraw to
redraw all the views.
If you change something in a particular view like the projection,
construction plane, background bitmap, etc., then you need to
call CRhinoView::Redraw to redraw that particular view.

Rhino.DocObjects.Tables.ViewTable.GetViewList(System.Boolean,System.Boolean)
Gets an array of all the views.
includeStandardViews: true if "Right", "Perspective", etc., view should be included; false otherwise.
includePageViews: true if page-related views should be included; false otherwise.
Returns: A array of Rhino views. This array can be emptry, but not null.

Rhino.DocObjects.Tables.ViewTable.GetPageViews
Gets all page views in the document.
Returns: An array with all page views. The return value can be an empty array but not null.

Rhino.DocObjects.Tables.ViewTable.Find(System.Guid)
Finds a view in this document with a given main viewport Id.
mainViewportId: The ID of the main viewport looked for.
Returns: View on success. null if the view could not be found in this document.

Rhino.DocObjects.Tables.ViewTable.Find(System.String,System.Boolean)
Finds a view in this document with a main viewport that has a given name. Note that there
may be multiple views in this document that have the same name. This function only returns
the first view found. If you want to find all the views with a given name, use the GetViewList
function and iterate through the views.
mainViewportName: The name of the main viewport.
compareCase: true if capitalization influences comparison; otherwise, false.
Returns: A Rhino view on success; null on error.

Rhino.DocObjects.Tables.ViewTable.Add(System.String,Rhino.Display.DefinedViewportProjection,System.Drawing.Rectangle,System.Boolean)
Constructs a new Rhino view and, at the same time, adds it to the list.
title: The title of the new Rhino view.
projection: A basic projection type.
position: A position.
floating: true if the view floats; false if it is docked.
Returns: The newly constructed Rhino view; or null on error.

Rhino.DocObjects.Tables.ViewTable.AddPageView(System.String)
Constructs a new page view with a given title and, at the same time, adds it to the list.
title:
If null or empty, a name will be generated as "Page #" where # is the largest page number.
Returns: The newly created page view on success; or null on error.

Rhino.DocObjects.Tables.ViewTable.AddPageView(System.String,System.Double,System.Double)
Constructs a new page view with a given title and size and, at the same time, adds it to the list.
title:
If null or empty, a name will be generated as "Page #" where # is the largest page number.
pageWidth: The page total width.
pageHeight: The page total height.
Returns: The newly created page view on success; or null on error.

Rhino.DocObjects.Tables.ViewTable.Document
Document that owns this object table.

Rhino.DocObjects.Tables.ViewTable.ActiveView
Gets or Sets the active view.

Rhino.DocObjects.Tables.ViewTable.RedrawEnabled
Returns or sets (enable or disables) screen redrawing.