Rhino.Render.MappingTag.Id
Gets or sets a map globally unique identifier.

Rhino.Render.MappingTag.MappingType
Gets or sets a texture mapping type: linear, cylinder, etc...

Rhino.Render.MappingTag.MappingCRC
Gets or sets the cyclic redundancy check on the mapping.
See also Rhino.RhinoMath.CRC32(System.UInt32,System.Byte[]).

Rhino.Render.MappingTag.MeshTransform
Gets or sets a 4x4 matrix tranform.