Rhino.Geometry.Particle.#ctor
Initializes a new instance of the Rhino.Geometry.Particle class.

Rhino.Geometry.Particle.Update
Base class implementation does nothing.

Rhino.Geometry.Particle.ParentSystem
Gets the parent particle system of this particle.

Rhino.Geometry.Particle.Index
Index in ParentSystem for this Particle. Can change when the particle
system is modified.

Rhino.Geometry.Particle.Location
3d Location of the Particle.