Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer
Wrapper for a C++ ON_SimpleArray of ON_Surface* or const ON_Surface*.  If
you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer instance.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Elements are made non-const.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.