Rhino.DocObjects.TextObject
Represents a text object in a document.
This is a wrapper for CRhinoAnnotationText.

Rhino.DocObjects.TextObject.TextGeometry
Gets the text entity geometry of this text object.