Rhino.DocObjects.EarthAnchorPoint.#ctor
Initializes a new instance of the Rhino.DocObjects.EarthAnchorPoint class.

Rhino.DocObjects.EarthAnchorPoint.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.DocObjects.EarthAnchorPoint.GetModelCompass
Returns a plane in model coordinates whose X axis points East,
Y axis points North and Z axis points Up. The origin
is set to ModelBasepoint.
Returns: A plane value. This might be invalid on error.

Rhino.DocObjects.EarthAnchorPoint.GetModelToEarthTransform(Rhino.UnitSystem)
Gets a transformation from model coordinates to earth coordinates.
This transformation assumes the model is small enough that
the curvature of the earth can be ignored.
modelUnitSystem: The model unit system.
Returns:
Transform on success. Inalid Transform on error.
Remarks:
If M is a point in model coordinates and E = model_to_earth*M,
then
E.x = latitude in decimal degrees
E.y = longitude in decimal degrees
E.z = elevation in meters above mean sea level
Because the earth is not flat, there is a small amount of error
when using a linear transformation to calculate oblate spherical
coordinates.  This error is small.  If the distance from P to M
is d meters, then the approximation error is
latitude error  <=
longitude error <=
elevation error <= 6379000*((1 + (d/6356000)^2)-1) meters
In particular, if every point in the model is within 1000 meters of
the m_model_basepoint, then the maximum approximation errors are
latitude error  <=
longitude error <=
elevation error <= 8 centimeters.

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointLatitude
Gets or sets a point latitude on earth, in decimal degrees.
+90 = north pole, 0 = equator, -90 = south pole.

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointLongitude
Gets or sets the point longitude on earth, in decimal degrees.
0 = prime meridian (Greenwich meridian)
Values increase towards West

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointElevation
Gets or sets the point elevation on earth, in meters.

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointElevationZero
Gets or sets a value indicating the zero level convention relating to a location on Earth.

Rhino.DocObjects.EarthAnchorPoint.ModelBasePoint
Corresponding model point in model coordinates.

Rhino.DocObjects.EarthAnchorPoint.ModelNorth
Earth directions in model coordinates.

Rhino.DocObjects.EarthAnchorPoint.ModelEast
Earth directions in model coordinates.

Rhino.DocObjects.EarthAnchorPoint.Name
Gets or sets the short form of the identifying information about this location.

Rhino.DocObjects.EarthAnchorPoint.Description
Gets or sets the long form of the identifying information about this location.