Rhino.Geometry.DetailView.SetScale(System.Double,Rhino.UnitSystem,System.Double,Rhino.UnitSystem)
Sets the detail viewport's projection so geometry is displayed at a certain scale.
modelLength: Reference model length.
modelUnits: Units for model length.
pageLength: Length on page that the modelLength should equal.
pageUnits: Units for page length.
Returns:
true on success. false if the DetailView projection is perspective or input values are incongruous.

Rhino.Geometry.DetailView.IsParallelProjection
Gets or sets whether the view is parallel.

Rhino.Geometry.DetailView.IsPerspectiveProjection
Gets or sets whether the view is perspective.

Rhino.Geometry.DetailView.IsProjectionLocked
Gets or sets whether the view projection is locked.

Rhino.Geometry.DetailView.PageToModelRatio
Gets the page units/model units quotient.