Rhino.DocObjects.ObjectMode
Defines enumerated values for the display and behavior of single objects.

Rhino.DocObjects.ObjectMode.InstanceDefinitionObject
Object is part of an InstanceDefinition. The InstanceDefinition
m_object_uuid[] array will contain this object attribute's uuid.