Rhino.Runtime.HostUtils.GetAssemblySearchPaths
Returns list of directory names where additional assemblies (plug-ins, DLLs, Grasshopper components)
may be located
Returns:

Rhino.Runtime.HostUtils.InPlaceConstCast(Rhino.Geometry.GeometryBase,System.Boolean)
DO NOT USE UNLESS YOU ARE CERTAIN ABOUT THE IMPLICATIONS.
This is an expert user function which should not be needed in most
cases. This function is similar to a const_cast in C++ to allow an object
to be made temporarily modifiable without causing RhinoCommon to convert
the class from const to non-const by creating a duplicate.
You must call this function with a true parameter, make your
modifications, and then restore the const flag by calling this function
again with a false parameter. If you have any questions, please
contact McNeel developer support before using!
geometry: Some geometry.
makeNonConst: A boolean value.

Rhino.Runtime.HostUtils.CheckForRdk(System.Boolean,System.Boolean)
Determines if the RDK is loaded.
throwOnFalse: if the RDK is not loaded, then throws a
Rhino.Runtime.RdkNotLoadedException.
usePreviousResult: if true, then the last result can be used instaed of
performing a full check.
Returns: true if the RDK is loaded; false if the RDK is not loaded. Note that the
Rhino.Runtime.RdkNotLoadedException will hinder the retrieval of any return value.

Rhino.Runtime.HostUtils.DebugString(System.String)
Prints a debug message to the Rhino Command Line.
The message will only appear if the SendDebugToCommandLine property is set to true.
msg: Message to print.

Rhino.Runtime.HostUtils.DebugString(System.String,System.Object[])
Prints a debug message to the Rhino Command Line.
The message will only appear if the SendDebugToCommandLine property is set to true.
format: Message to format and print.
args: An Object array containing zero or more objects to format.

Rhino.Runtime.HostUtils.ExceptionReport(System.Exception)
Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ex: An exception.

Rhino.Runtime.HostUtils.ExceptionReport(System.String,System.Exception)
Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
source: An exception source text.
ex: An exception.

Rhino.Runtime.HostUtils.InvokeOnMainUiThread(System.Delegate)
Calls a method on the main Rhino UI thread if this is necessary.
method: A method. This method is called with no arguments.
Returns: A return object, or null.

Rhino.Runtime.HostUtils.InvokeOnMainUiThread(System.Delegate,System.Object[])
Calls a method on the main Rhino UI thread if this is necessary.
method: A method. This method is called with args arguments.
args: The method arguments.
Returns: A return object, or null.

Rhino.Runtime.HostUtils.DebugDumpToString(Rhino.Geometry.GeometryBase)
Gets the debug dumps. This is a text description of the geometric contents.
DebugDump() is intended for debugging and is not suitable for creating high
quality text descriptions of an object.
geometry: Some geometry.
Returns: A debug dump text.

Rhino.Runtime.HostUtils.DebugDumpToString(Rhino.Geometry.BezierCurve)
Gets the debug dumps. This is a text description of the geometric contents.
DebugDump() is intended for debugging and is not suitable for creating high
quality text descriptions of an object.
bezierCurve: curve to evaluate
Returns: A debug dump text.

Rhino.Runtime.HostUtils.CreateCommands(Rhino.PlugIns.PlugIn)
Parses a plugin and create all the commands defined therein.
plugin: Plugin to harvest for commands.

Rhino.Runtime.HostUtils.CreateCommands(System.IntPtr,System.Reflection.Assembly)
Parses a plugin and create all the commands defined therein.
pPlugIn: Plugin to harvest for commands.
pluginAssembly: Assembly associated with the plugin.
Returns: The number of newly created commands.

Rhino.Runtime.HostUtils.RegisterDynamicCommand(Rhino.PlugIns.PlugIn,Rhino.Commands.Command)
Adds a new dynamic command to Rhino.
plugin: Plugin that owns the command.
cmd: Command to add.
Returns: true on success, false on failure.

Rhino.Runtime.HostUtils.InitializeRhinoCommon
Makes sure all static RhinoCommon components is set up correctly.
This happens automatically when a plug-in is loaded, so you probably won't
have to call this method.
Remarks: Subsequent calls to this method will be ignored.

Rhino.Runtime.HostUtils.CreatePlugIn(System.Type,System.Boolean)
Instantiates a plug-in type and registers the associated commands and classes.
pluginType: A plug-in type. This type must derive from Rhino.PlugIns.PlugIn.
printDebugMessages: true if debug messages should be printed.
Returns: A new plug-in instance.

Rhino.Runtime.HostUtils.DisplayOleAlerts(System.Boolean)
Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
display: Whether alerts should be visible.

Rhino.Runtime.HostUtils.GetRhinoDotNetAssembly
Only works on Windows. Returns null on Mac.
Returns: An assembly.

Rhino.Runtime.HostUtils.SetInShutDown
Informs the runtime that the application is shutting down.

Rhino.Runtime.HostUtils.RunningOnWindows
Tests if this process is currently executing on the Windows platform.

Rhino.Runtime.HostUtils.RunningOnOSX
Tests if this process is currently executing on the Mac OSX platform.

Rhino.Runtime.HostUtils.RunningInMono
Tests if this process is currently executing under the Mono runtime.

Rhino.Runtime.HostUtils.RunningInRhino
Tests if RhinoCommon is currently executing inside of the Rhino.exe process.
There are other cases where RhinoCommon could be running; specifically inside
of Visual Studio when something like a windows form is being worked on in the
resource editor or running stand-alone when compiled to be used as a version
of OpenNURBS.

Rhino.Runtime.HostUtils.SendDebugToCommandLine
Gets or sets whether debug messages are printed to the command line.

Rhino.Runtime.HostUtils.OnExceptionReport
Is raised when an exception is reported with one of the Rhino.Runtime.HostUtils.ExceptionReport(System.Exception) method.