Rhino.Display.DisplayPipeline.PushModelTransform(Rhino.Geometry.Transform)
Push a model transformation on the engine's model transform stack.
xform: Transformation to push.

Rhino.Display.DisplayPipeline.PopModelTransform
Pop a model transformation off the engine's model transform stack.

Rhino.Display.DisplayPipeline.EnableDepthTesting(System.Boolean)
Enable or disable the DepthTesting behaviour of the engine.
When DepthTesting is disabled, objects in front will no
longer occlude objects behind them.
enable: true to enable DepthTesting, false to disable.

Rhino.Display.DisplayPipeline.EnableDepthWriting(System.Boolean)
Enable or disable the DepthWriting behaviour of the engine.
When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
enable: true to enable DepthWriting, false to disable.

Rhino.Display.DisplayPipeline.EnableColorWriting(System.Boolean)
Enable or disable the ColorWriting behaviour of the engine.
enable: true to enable ColorWriting, false to disable.

Rhino.Display.DisplayPipeline.EnableLighting(System.Boolean)
Enable or disable the Lighting logic of the engine.
enable: true to enable Lighting, false to disable.

Rhino.Display.DisplayPipeline.EnableClippingPlanes(System.Boolean)
Enable or disable the Clipping Plane logic of the engine.
enable: true to enable Clipping Planes, false to disable.

Rhino.Display.DisplayPipeline.PushDepthTesting(System.Boolean)
Push a DepthTesting flag on the engine's stack.
enable: DepthTesting flag.

Rhino.Display.DisplayPipeline.PopDepthTesting
Pop a DepthTesting flag off the engine's stack.

Rhino.Display.DisplayPipeline.PushDepthWriting(System.Boolean)
Push a DepthWriting flag on the engine's stack.
enable: DepthWriting flag.

Rhino.Display.DisplayPipeline.PopDepthWriting
Pop a DepthWriting flag off the engine's stack.

Rhino.Display.DisplayPipeline.PushClipTesting(System.Boolean)
Push a ClipTesting flag on the engine's stack.
enable: ClipTesting flag.

Rhino.Display.DisplayPipeline.PopClipTesting
Pop a ClipTesting flag off the engine's stack.

Rhino.Display.DisplayPipeline.PushCullFaceMode(Rhino.Display.CullFaceMode)
Push a FaceCull flag on the engine's stack.
mode: FaceCull flag.

Rhino.Display.DisplayPipeline.PopCullFaceMode
Pop a FaceCull flag off the engine's stack.

Rhino.Display.DisplayPipeline.CullControlPolygon
Returns a value indicating if only points on the side of the surface that
face the camera are displayed.
Returns: true if backfaces of surface and mesh control polygons are culled.
This value is determined by the _CullControlPolygon command.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.Point3d)
Test a given 3d world coordinate point for visibility inside the view
frustum under the current viewport and model transformation settings.
worldCoordinate: Point to test for visibility.
Returns: true if the point is visible, false if it is not.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.DocObjects.RhinoObject)
Test a given object for visibility inside the view frustum under the current viewport and model
transformation settings. This function calls a virtual IsVisibleFinal function that
subclassed pipelines can add extra tests to. In the base class, this test only tests
visibility based on the objects world coordinates location and does not pay attention
to the object's attributes.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns: true if the object is visible, false if not.

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.BoundingBox)
Test a given box for visibility inside the view frustum under the current
viewport and model transformation settings.
bbox: Box to test for visibility.
Returns: true if at least some portion of the box is visible, false if not.

Rhino.Display.DisplayPipeline.IsActive(Rhino.DocObjects.RhinoObject)
Determines if an object can be visible in this viewport based on it's object type and display attributes.
This test does not check for visibility based on location of the object.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns:
true if this object can be drawn in the pipeline's viewport based on it's object type and display attributes.

Rhino.Display.DisplayPipeline.InterruptDrawing
Tests to see if the pipeline should stop drawing more geometry and just show what it has so far.
If a drawing operation is taking a long time, this function will return true and tell Rhino it should just
finish up and show the frame buffer. This is used in dynamic drawing operations.
Returns:
true if the pipeline should stop attempting to draw more geometry and just show the frame buffer.

Rhino.Display.DisplayPipeline.DrawToBitmap(Rhino.Display.RhinoViewport,System.Int32,System.Int32)
Draw a given viewport to an off-screen bitmap.
viewport: Viewport to draw.
width: Width of target image.
height: Height of target image.
Returns: A bitmap containing the given view, or null on error.

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color,System.Int32)
Draws all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.
thickness: Thickness (in pixels) of mesh wires.

Rhino.Display.DisplayPipeline.DrawMeshVertices(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws all the vertices in a given mesh.
mesh: Mesh for vertex drawing.
color: Color of mesh vertices.

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial)
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial,System.Int32[])
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.
faceIndices: Indices of specific faces to draw

Rhino.Display.DisplayPipeline.DrawMeshFalseColors(Rhino.Geometry.Mesh)
Draws the mesh faces as false color patches.
The mesh must have Vertex Colors defined for this to work.
mesh: Mesh to draw.

Rhino.Display.DisplayPipeline.DrawBrepShaded(Rhino.Geometry.Brep,Rhino.Display.DisplayMaterial)
Draws a shaded mesh representation of a brep.
brep: Brep to draw.
material: Material to draw faces with.

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color)
Draws all the wireframe curves of a brep object.
brep: Brep to draw.
color: Color of Wireframe curves.

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color,System.Int32)
Draws all the wireframe curves of a brep object.
brep: Brep to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires.
0 = default internal wires.
>0 = custom high density.

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
color: Color of point.

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Int32,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of point. If style is ControlPoint, this will be the border color.

Rhino.Display.DisplayPipeline.DrawPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Display.PointStyle,System.Int32,System.Drawing.Color)
Draw a set of points with a given radius, style and color.
points: Location of points in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of points. If style is ControlPoint, this will be the border color.

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Int32)
Draws a point cloud.
cloud: Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size: Size of points.

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Int32,System.Drawing.Color)
Draws a point cloud.
cloud: Point cloud to draw.
size: Size of points.
color: Color of points in the cloud, if the cloud has a color array this setting is ignored.

Rhino.Display.DisplayPipeline.DrawArrow(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
line: Arrow shaft.
color: Color of arrow.

Rhino.Display.DisplayPipeline.DrawArrow(Rhino.Geometry.Line,System.Drawing.Color,System.Double,System.Double)
Draws a single arrow object.
An arrow consists of a Shaft and an Arrow head at the end of the shaft.
line: Arrow shaft.
color: Color of arrow.
screenSize: If screenSize != 0.0 then the size (in screen pixels) of the arrow head will be equal to screenSize.
relativeSize: If relativeSize != 0.0 and screensize == 0.0 the size of the arrow head will be proportional to the arrow shaft length.

Rhino.Display.DisplayPipeline.DrawArrows(Rhino.Geometry.Line[],System.Drawing.Color)
Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.

Rhino.Display.DisplayPipeline.DrawArrows(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.

Rhino.Display.DisplayPipeline.DrawArrowHead(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Double,System.Double)
Draws a single arrow head.
tip: Point of arrow head tip.
direction: Direction in which arrow head is pointing.
color: Color of arrow head.
screenSize: If screenSize != 0.0, then the size (in screen pixels) of the arrow head will be equal to the screenSize.
worldSize: If worldSize != 0.0 and screensize == 0.0 the size of the arrow head will be equal to the number of units in worldSize.

Rhino.Display.DisplayPipeline.DrawLineArrow(Rhino.Geometry.Line,System.Drawing.Color,System.Int32,System.Double)
Draws an arrow made up of three line segments.
line: Base line for arrow.
color: Color of arrow.
thickness: Thickness (in pixels) of the arrow line segments.
size: Size (in world units) of the arrow tip lines.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single line object.
line: Line to draw.
color: Color to draw line in.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32)
Draws a single line object.
line: Line to draw.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32)
Draws a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single dotted line.
line: Line to draw.
color: Color of line.

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a single dotted line.
from: Line start point.
to: Line end point.
color: Color of line.

Rhino.Display.DisplayPipeline.DrawDottedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a set of connected lines (polyline) in a dotted pattern.
points: End points of each line segment.
color: Color of polyline.
close: Draw a line between the first and last points.

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color,System.Int32)
Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of lines.

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Draws a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Int32)
Draws a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of the Polyline.

Rhino.Display.DisplayPipeline.DrawPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a filled polygon.
points:
Collection of world coordinate points that are connected by lines to form a closed shape.
Collection must contain at least 3 points.
color: Color to draw with.
filled:
true if the closed area should be filled with color.
false if you want to draw just the border of the closed shape.

Rhino.Display.DisplayPipeline.DrawDot(System.Int32,System.Int32,System.String,System.Drawing.Color,System.Drawing.Color)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.

Rhino.Display.DisplayPipeline.DrawDot(System.Int32,System.Int32,System.String)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.Point3d,System.String,System.Drawing.Color,System.Drawing.Color)
Draw a text dot in world coordinates.
worldPosition: Location of dot in world coordinates.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.Point3d,System.String)
Draws a text dot in world coordinates.
worldPosition: Location of dot in world coordinates.
text: Text content of dot.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draws the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Int32)
Draws the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color)
Draws the edges of a Box object.
box: Box to draw.
color: Color to draw in.

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color,System.Int32)
Draws the edges of a Box object.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draws corner widgets of a world aligned boundingbox.
Widget size will be 5% of the Box diagonal.
box: Box to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double)
Draws corner widgets of a world aligned boundingbox.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double,System.Int32)
Draws corner widgets of a world aligned boundingbox.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.
thickness: Thickness (in pixels) of the corner widgets.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double,System.Double)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.
rotation: Rotational angle adjustment (in radians, counter-clockwise of direction.

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)
fontface: font name (good default is "Arial")

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
worldCoordinate: definition point in world coordinates.
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
worldCoordinate: definition point in world coordinates.
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport.
text: The string to draw.
color: Text color.
worldCoordinate: Definition point in world coordinates.
middleJustified: If true text is centered around the definition point, otherwise it is lower-left justified.
height: Height in pixels (good default is 12).
fontface: Font name (good default is "Arial").

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Plane)
Draws 3d text with a different plane than what is defined in the Text3d class.
text: The string to draw.
color: Text color.
textPlane: The plane for the text object.

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Point3d)
Draws 3d text using the Text3d plane with an adjusted origin.
text: The string to draw.
color: Text color.
textPlaneOrigin: The origin of the plane to draw.

Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform)
Draws a RhinoObject with an applied transformation.
rhinoObject: The Rhino object.
xform: The transformation.

Rhino.Display.DisplayPipeline.DrawArc(Rhino.Geometry.Arc,System.Drawing.Color)
Draw a single arc object.
arc: Arc to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawArc(Rhino.Geometry.Arc,System.Drawing.Color,System.Int32)
Draw a single arc object.
arc: Arc to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of arc.

Rhino.Display.DisplayPipeline.DrawCircle(Rhino.Geometry.Circle,System.Drawing.Color)
Draw a single circle object.
circle: Circle to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawCircle(Rhino.Geometry.Circle,System.Drawing.Color,System.Int32)
Draw a single circle object.
circle: Circle to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of circle.

Rhino.Display.DisplayPipeline.DrawSphere(Rhino.Geometry.Sphere,System.Drawing.Color)
Draw a wireframe sphere.
sphere: Sphere to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawSphere(Rhino.Geometry.Sphere,System.Drawing.Color,System.Int32)
Draw a wireframe sphere.
sphere: Sphere to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of Sphere wires.

Rhino.Display.DisplayPipeline.DrawTorus(Rhino.Geometry.Torus,System.Drawing.Color)
Draw a wireframe torus.
torus: Torus to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawTorus(Rhino.Geometry.Torus,System.Drawing.Color,System.Int32)
Draw a wireframe torus.
torus: Torus to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of torus wires.

Rhino.Display.DisplayPipeline.DrawCylinder(Rhino.Geometry.Cylinder,System.Drawing.Color)
Draw a wireframe cylinder.
cylinder: Cylinder to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawCylinder(Rhino.Geometry.Cylinder,System.Drawing.Color,System.Int32)
Draw a wireframe cylinder.
cylinder: Cylinder to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of cylinder wires.

Rhino.Display.DisplayPipeline.DrawCone(Rhino.Geometry.Cone,System.Drawing.Color)
Draw a wireframe cone.
cone: Cone to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawCone(Rhino.Geometry.Cone,System.Drawing.Color,System.Int32)
Draw a wireframe cone.
cone: Cone to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of Cone wires.

Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,System.Drawing.Color)
Draw a single Curve object.
curve: Curve to draw.
color: Color to draw with.

Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Draw a single Curve object.
curve: Curve to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of curve.

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.
hairScale: 100 = true length, > 100 magnified, < 100 shortened.

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32,System.Int32,System.Int32)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.
hairScale: 100 = true length, > 100 magnified, < 100 shortened.
hairDensity: >= 0 larger numbers = more hairs (good default is 1).
sampleDensity: Between 1 and 10. Higher numbers draw smoother outer curves. (good default is 2).

Rhino.Display.DisplayPipeline.DrawSurface(Rhino.Geometry.Surface,System.Drawing.Color,System.Int32)
Draw wireframe display for a single surface.
surface: Surface to draw.
wireColor: Color to draw with.
wireDensity: Thickness (in pixels) or wires to draw.

Rhino.Display.DisplayPipeline.CalculateBoundingBoxZoomExtents
Calculate a bounding to include in the Zoom Extents command.

Rhino.Display.DisplayPipeline.PreDrawObjects
Called before objects are been drawn. Depth writing and testing are on.

Rhino.Display.DisplayPipeline.PreDrawObject
Called right before an individual object is being drawn. NOTE: Do not use this event
unless you absolutely need to.  It is called for every object in the document and can
slow disply down if a large number of objects exist in the document

Rhino.Display.DisplayPipeline.PostDrawObjects
Called after all non-highlighted objects have been drawn. Depth writing and testing are
still turned on. If you want to draw without depth writing/testing, see DrawForeground.

Rhino.Display.DisplayPipeline.DrawForeground
Called after all non-highlighted objects have been drawn and PostDrawObjects has been called.
Depth writing and testing are turned OFF. If you want to draw with depth writing/testing,
see PostDrawObjects.
Remarks:
This event is actually passed a DrawForegroundEventArgs, but we could not change
the event declaration without breaking the SDK. Cast to a DrawForegroundEventArgs
if you need it.

Rhino.Display.DisplayPipeline.DrawOverlay
If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of
everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.

Rhino.Display.DisplayPipeline.FrameSize
Gets the size of the framebuffer that this pipeline is drawing to.

Rhino.Display.DisplayPipeline.DefaultCurveThickness
Gets the curve thickness as defined by the current display mode.
Note: this only applies to curve objects, Brep and Mesh wires may have different settings.

Rhino.Display.DisplayPipeline.IsOpenGL
Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.

Rhino.Display.DisplayPipeline.IsStereoMode
Gets a value that indicates whether this pipeline is currently using an
engine that is performing stereo style drawing. Stereo drawing is for
providing an "enhanced 3-D" effect through stereo viewing devices.

Rhino.Display.DisplayPipeline.IsPrinting
Gets a value that indicates whether this pipeline
is currently drawing for printing purposes.

Rhino.Display.DisplayPipeline.IsDynamicDisplay
Gets a value that indicates whether the viewport is in Dynamic Display state.
Dynamic display is the state a viewport is in when it is rapidly redrawing because of
an operation like panning or rotating. The pipeline will drop some level of detail
while inside a dynamic display state to keep the frame rate as high as possible.

Rhino.Display.DisplayPipeline.SupportsShading
Gets whether or not this pipeline supports shaded meshes.

Rhino.Display.DisplayPipeline.StereoProjection
Gets the current stereo projection if stereo mode is on.
0 = left
1 = right
If stereo mode is not enables, this property always returns 0.

Rhino.Display.DisplayPipeline.ModelTransform
Gets or sets the current model transformation that is applied to vertices when drawing.

Rhino.Display.DisplayPipeline.ModelTransformIsIdentity
Gets a value that indicates whether the Model Transform is an Identity transformation.

Rhino.Display.DisplayPipeline.RenderPass
Gets the current pass that the pipeline is in for drawing a frame.
Typically drawing a frame requires a single pass through the DrawFrameBuffer
function, but some special display effects can be achieved through
drawing with multiple passes.

Rhino.Display.DisplayPipeline.NestLevel
Gets the current nested viewport drawing level.
This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occuring in a standard Rhino viewport or on the page viewport.
Nest level = 1 Drawing is occuring inside a detail view object.

Rhino.Display.DisplayPipeline.DrawingWires
Gets a value that indicates whether the pipeline is currently in a curve drawing operation.

Rhino.Display.DisplayPipeline.DrawingGrips
Gets a value that indicates whether the pipeline is currently in a grip drawing operation.

Rhino.Display.DisplayPipeline.DrawingSurfaces
Gets a value that indicates whether the pipeline is currently in a surface drawing operation.

Rhino.Display.DisplayPipeline.ShadingRequired
Gets or sets the "ShadingRequired" flag. This flag gets set inside the pipeline when a request is
made to draw a shaded mesh but the current render engine doesn't support shaded
mesh drawing...at this point the redraw mechanism will make sure everything will
work the next time around.