Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.#ctor
Initializes a new empty Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d instance.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Count
Gets the amount of points in this array.