Rhino.Geometry.PipeCapMode
constansts used for CreatePipe functions

Rhino.Geometry.PipeCapMode.None
No cap

Rhino.Geometry.PipeCapMode.Flat
Cap with planar surface

Rhino.Geometry.PipeCapMode.Round
Cap with hemispherical surface