Rhino.Geometry.CurveKnotStyle
Defines enumerated values for knot spacing styles in interpolated curves.

Rhino.Geometry.CurveKnotStyle.ChordSquareRootPeriodic
Periodic with square roor of chord length spacing.