Rhino.DocObjects.RhinoObject.GetRenderMeshes(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
Returns: An array of object references.

Rhino.DocObjects.RhinoObject.DuplicateGeometry
Constructs a deep (full) copy of the geometry.
Returns: A copy of the internal geometry.

Rhino.DocObjects.RhinoObject.CommitChanges
Moves changes made to this RhinoObject into the RhinoDoc.
Returns:
true if changes were made.

Rhino.DocObjects.RhinoObject.MemoryEstimate
Computes an estimate of the number of bytes that this object is using in memory.
Note that this is a runtime memory estimate and does not directly compare to the
amount of space take up by the object when saved to a file.
Returns: The estimated number of bytes this object occupies in memory.

Rhino.DocObjects.RhinoObject.GetGroupList
Allocates an array of group indices of length GroupCount.
If Rhino.DocObjects.RhinoObject.GroupCount is 0, then this method returns null.
Returns: An array of group indices, or null if Rhino.DocObjects.RhinoObject.GroupCount is 0.

Rhino.DocObjects.RhinoObject.IsSelected(System.Boolean)
Check selection state.
checkSubObjects:
(false is good default)
If true and the entire object is not selected, and some subset of the object
is selected, like some edges of a surface, then 3 is returned.
If false and the entire object is not selected, then zero is returned.
Returns:
0 = object is not selected.
1 = object is selected.
2 = entire object is selected persistently.
3 = one or more proper sub-objects are selected.

Rhino.DocObjects.RhinoObject.IsSubObjectSelected(Rhino.Geometry.ComponentIndex)
Check sub-object selection state.
componentIndex: Index of subobject to check.
Returns: true if the subobject is selected.
Remarks: A subobject cannot be persistently selected.

Rhino.DocObjects.RhinoObject.GetSelectedSubObjects
Get a list of all selected sub-objects.
Returns: An array of subobject indices, or null if there are none.

Rhino.DocObjects.RhinoObject.IsSelectable(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected.
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected.
ignoreLayerLocking:
If true, then objects on locked layers are selectable.
If false, then objects on locked layers are not selectable.
ignoreLayerVisibility:
If true, then objects on hidden layers are selectable.
If false, then objects on hidden layers are not selectable.
Returns: true if object is capable of being selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.IsSelectable
Reports if an object can be selected.
Returns: true if object is capable of being selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.IsSubObjectSelectable(Rhino.Geometry.ComponentIndex,System.Boolean)
Reports if a subobject can be selected.
componentIndex: index of subobject to check.
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
Returns: true if the specified subobject can be selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
If false, then objects on locked layers cannot be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
If false, then objects on hidden layers cannot be selected.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
syncHighlight:
If true, then the object is hightlighted if it is selected
and not hightlighted if is is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.SelectSubObject(Rhino.Geometry.ComponentIndex,System.Boolean,System.Boolean)
Reports if an object can be selected.
componentIndex: Index of subobject to check.
select: The new selection state; true activates selection.
syncHighlight:
(default=true)
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.UnselectAllSubObjects
Removes selection from all subobjects.
Returns: The number of unselected subobjects.

Rhino.DocObjects.RhinoObject.IsHighlighted(System.Boolean)
Check highlight state.
checkSubObjects:
If true and the entire object is not highlighted, and some subset of the object
is highlighted, like some edges of a surface, then 3 is returned.
If false and the entire object is not highlighted, then zero is returned.
Returns:
0: object is not highlighted.
1: entire object is highlighted.
3: one or more proper sub-objects are highlighted.

Rhino.DocObjects.RhinoObject.Highlight(System.Boolean)
Modifies the highlighting of the object.
enable: true if highlighting should be enabled.
Returns: true if the object is now highlighted.

Rhino.DocObjects.RhinoObject.IsSubObjectHighlighted(Rhino.Geometry.ComponentIndex)
Determines if a subobject is highlighted.
componentIndex: A subobject component index.
Returns: true if the subobject is highlighted.

Rhino.DocObjects.RhinoObject.GetHighlightedSubObjects
Gets a list of all highlighted subobjects.
Returns: An array of all highlighted subobjects; or null is there are none.

Rhino.DocObjects.RhinoObject.HighlightSubObject(Rhino.Geometry.ComponentIndex,System.Boolean)
Highlights a subobject.
componentIndex: A subobject component index.
highlight: true if the subobject should be highlighted.
Returns: true if the subobject is now highlighted.

Rhino.DocObjects.RhinoObject.UnhighlightAllSubObjects
Removes highlighting from all subobjects.
Returns: The number of changed subobjects.

Rhino.DocObjects.RhinoObject.EnableCustomGrips(Rhino.DocObjects.Custom.CustomObjectGrips)
Turns on/off the object's editing grips.
customGrips: The custom object grips.
Returns:
true if the call succeeded.  If you attempt to add custom grips to an
object that does not support custom grips, then false is returned.

Rhino.DocObjects.RhinoObject.GetGrips
Returns grips for this object If grips are enabled. If grips are not
enabled, returns null.
Returns: An array of grip objects; or null if there are no grips.

Rhino.DocObjects.RhinoObject.EnableVisualAnalysisMode(Rhino.Display.VisualAnalysisMode,System.Boolean)
Used to turn analysis modes on and off.
mode: A visual analysis mode.
enable: true if the mode should be activated; false otherwise.
Returns: true if this object supports the analysis mode.

Rhino.DocObjects.RhinoObject.InVisualAnalysisMode
Reports if any visual analysis mode is currently active for an object.
Returns: true if an analysis mode is active; otherwise false.

Rhino.DocObjects.RhinoObject.InVisualAnalysisMode(Rhino.Display.VisualAnalysisMode)
Reports if a visual analysis mode is currently active for an object.
mode:
The mode to check for.
Use null if you want to see if any mode is active.
Returns: true if the specified analysis mode is active; otherwise false.

Rhino.DocObjects.RhinoObject.GetActiveVisualAnalysisModes
Gets a list of currently enabled analysis modes for this object.
Returns: An array of visual analysis modes. The array can be empty, but not null.

Rhino.DocObjects.RhinoObject.ShortDescription(System.Boolean)
Gets a localized short descriptive name of the object.
plural: true if the descriptive name should in plural.
Returns: A string with the short localized descriptive name.

Rhino.DocObjects.RhinoObject.IsMeshable(Rhino.Geometry.MeshType)
Returns true if the object is capable of having a mesh of the specified type
meshType:
Returns:

Rhino.DocObjects.RhinoObject.GetRenderMeshParameters
Meshing parameters that this object uses for generating render meshes. If the
object's attributes do not have custom meshing parameters, then the document's
meshing parameters are used.
Returns:

Rhino.DocObjects.RhinoObject.MeshCount(Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters)
RhinoObjects can have several different types of meshes and
different numbers of meshes.  A b-rep can have a render and
an analysis mesh on each face.  A mesh object has a single
render mesh and no analysis mesh. Curve, point, and annotation
objects have no meshes.
meshType: type of mesh to count
parameters:
if not null and if the object can change its mesh (like a brep),
then only meshes that were created with these mesh parameters are counted.
Returns: number of meshes

Rhino.DocObjects.RhinoObject.CreateMeshes(Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters,System.Boolean)
Create meshes used to render and analyze surface and polysrf objects.
meshType: type of meshes to create
parameters:
in parameters that control the quality of the meshes that are created
ignoreCustomParameters:
Default should be false. Should the object ignore any custom meshing
parameters on the object's attributes
Returns: number of meshes created

Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)
Get existing meshes used to render and analyze surface and polysrf objects.
meshType:
Returns:

Rhino.DocObjects.RhinoObject.GetSubObjects
Gets an array of subobjects.
Returns: An array of subobjects, or null if there are none.

Rhino.DocObjects.RhinoObject.GetDynamicTransform(Rhino.Geometry.Transform@)
While an object is being dynamically tranformed (dragged, rotated, ...),
the current transformation can be retrieved and used for creating
dynamic display.
transform:
Returns:
True if the object is being edited and its transformation
is available.  False if the object is not being edited,
in which case the identity xform is returned.

Rhino.DocObjects.RhinoObject.GetMaterial(System.Boolean)
Gets material that this object uses based on it's attributes and the document
that the object is associated with.  In the rare case that a document is not
associated with this object, null will be returned.
frontMaterial:
If true, gets the material used to render the object's front side
Returns:

Rhino.DocObjects.RhinoObject.IsActiveInViewport(Rhino.Display.RhinoViewport)
Determine if this object is active in a particular viewport.
viewport:
Remarks:
The default implementation tests for space and viewport id. This
handles things like testing if a page space object is visible in a
modeling view.
Returns: True if the object is active in viewport

Rhino.DocObjects.RhinoObject.NextRuntimeSerialNumber
Gets the runtime serial number that will be assigned to
the next Rhino Object that is created.

Rhino.DocObjects.RhinoObject.ObjectType
Gets the Rhino-based object type.

Rhino.DocObjects.RhinoObject.IsValid
Tests an object to see if its data members are correctly initialized.

Rhino.DocObjects.RhinoObject.Document
Gets the document that owns this object.

Rhino.DocObjects.RhinoObject.Geometry
Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.

Rhino.DocObjects.RhinoObject.Attributes
Gets or sets the object attributes.

Rhino.DocObjects.RhinoObject.RuntimeSerialNumber
Gets the objects runtime serial number.

Rhino.DocObjects.RhinoObject.IsDeletable
Some objects cannot be deleted, like grips on lights and annotation objects.

Rhino.DocObjects.RhinoObject.IsDeleted
true if the object is deleted. Deleted objects are kept by the document
for undo purposes. Call RhinoDoc.UndeleteObject to undelete an object.

Rhino.DocObjects.RhinoObject.IsInstanceDefinitionGeometry
true if the object is used as part of an instance definition.

Rhino.DocObjects.RhinoObject.IsNormal
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.

Rhino.DocObjects.RhinoObject.IsLocked
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.

Rhino.DocObjects.RhinoObject.IsHidden
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.

Rhino.DocObjects.RhinoObject.IsReference
Gets a value indicating if an object is a reference object. An object from a work session
reference model is a reference object and cannot be modified. An object is
a reference object if, and only if, it is on a reference layer.

Rhino.DocObjects.RhinoObject.Visible
Gets the object visibility.

Rhino.DocObjects.RhinoObject.Id
Every object has a Guid (globally unique identifier, also known as UUID, or universally
unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is Guid.Empty, a
new Guid is created. If the value is not null but it is already used by another object
in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.
This value is the same as the one returned by this.Attributes.ObjectId.

Rhino.DocObjects.RhinoObject.Name
Rhino objects have optional text names.  More than one object in
a model can have the same name and some objects may have no name.

Rhino.DocObjects.RhinoObject.GroupCount
Number of groups object belongs to.

Rhino.DocObjects.RhinoObject.GripsOn
Gets or sets the activation state of object default editing grips.

Rhino.DocObjects.RhinoObject.GripsSelected
true if grips are turned on and at least one is selected.

Rhino.DocObjects.RhinoObject.HasDynamicTransform
True if the object has a dynamic transformation