Rhino.Geometry.BrepLoopType
Each brep loop has a defined type, e.g. outer, inner or point on surface.

Rhino.Geometry.BrepLoopType.CurveOnSurface
"loop" is a curveonsrf made from a single (open or closed) trim that
has type TrimType.CurveOnSurface.