Rhino.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Initializes a new point by defining the X, Y and Z coordinates.
x: The value of the X (first) coordinate.
y: The value of the Y (second) coordinate.
z: The value of the Z (third) coordinate.

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Vector3d)
Initializes a new point by copying coordinates from the components of a vector.
vector: A vector.

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point3f)
Initializes a new point by copying coordinates from a single-precision point.
point: A point.

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point3d)
Initializes a new point by copying coordinates from another point.
point: A point.

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point4d)
Initializes a new point by copying coordinates from a four-dimensional point.
The first three coordinates are divided by the last one.
If the W (fourth) dimension of the input point is zero, then it will be just discarded.
point: A point.

Rhino.Geometry.Point3d.op_Multiply(Rhino.Geometry.Point3d,System.Double)
Multiplies a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point3d.Multiply(Rhino.Geometry.Point3d,System.Double)
Multiplies a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point3d.op_Multiply(System.Double,Rhino.Geometry.Point3d)
Multiplies a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point3d.Multiply(System.Double,Rhino.Geometry.Point3d)
Multiplies a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point3d.op_Division(Rhino.Geometry.Point3d,System.Double)
Divides a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinatewise divided by t.

Rhino.Geometry.Point3d.Divide(Rhino.Geometry.Point3d,System.Double)
Divides a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinatewise divided by t.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Sums two Rhino.Geometry.Point3d instances.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point1: A point.
point2: A point.
Returns: A new point that results from the addition of point1 and point2.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.op_Subtraction(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Subtracts a vector from a point.
point: A point.
vector: A vector.
Returns: A new point that is the difference of point minus vector.

Rhino.Geometry.Point3d.Subtract(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that is the difference of point minus vector.

Rhino.Geometry.Point3d.op_Subtraction(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Subtracts a point from another point.
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.

Rhino.Geometry.Point3d.Subtract(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.

Rhino.Geometry.Point3d.op_UnaryNegation(Rhino.Geometry.Point3d)
Computes the additive inverse of all coordinates in the point, and returns the new point.
point: A point.
Returns: A point value that, when summed with the point input, yields the Rhino.Geometry.Point3d.Origin.

Rhino.Geometry.Point3d.op_Equality(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether two Point3d have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.

Rhino.Geometry.Point3d.op_Inequality(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether two Point3d have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.

Rhino.Geometry.Point3d.op_LessThan(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.

Rhino.Geometry.Point3d.op_LessThanOrEqual(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.

Rhino.Geometry.Point3d.op_GreaterThan(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.

Rhino.Geometry.Point3d.op_GreaterThanOrEqual(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.

Rhino.Geometry.Point3d.CompareTo(Rhino.Geometry.Point3d)
Compares this Rhino.Geometry.Point3d with another Rhino.Geometry.Point3d.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Point3d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.

Rhino.Geometry.Point3d.Equals(Rhino.Geometry.Point3d)
Determines whether the specified Rhino.Geometry.Point3d has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.

Rhino.Geometry.Point3d.Interpolate(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Interpolate between two points.
pA: First point.
pB: Second point.
t: Interpolation parameter.
If t=0 then this point is set to pA.
If t=1 then this point is set to pB.
Values of t in between 0.0 and 1.0 result in points between pA and pB.

Rhino.Geometry.Point3d.DistanceTo(Rhino.Geometry.Point3d)
Computes the distance between two points.
other: Other point for distance measurement.
Returns: The length of the line between this and the other point; or 0 if any of the points is not valid.

Rhino.Geometry.Point3d.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.

Rhino.Geometry.Point3d.CullDuplicates(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Removes duplicates in the supplied set of points.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
tolerance: The minimum distance between points.
Points that fall within this tolerance will be discarded.
.
Returns: An array of points without duplicates; or null on error.

Rhino.Geometry.Point3d.ArePointsCoplanar(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Determines whether a set of points is coplanar within a given tolerance.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
tolerance: A tolerance value. A default might be RhinoMath.ZeroTolerance.
Returns: true if points are on the same plane; false otherwise.

Rhino.Geometry.Point3d.SortAndCullPointList(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Orders a set of points so they will be connected in a "reasonable polyline" order.
Also, removes points from the list if their common distance exceeds a specified threshold.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
minimumDistance: Minimum allowed distance among a pair of points. If points are closer than this, only one of them will be kept.
Returns: The new array of sorted and culled points.

Rhino.Geometry.Point3d.Origin
Gets the value of a point at location 0,0,0.

Rhino.Geometry.Point3d.Unset
Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.

Rhino.Geometry.Point3d.X
Gets or sets the X (first) coordinate of this point.

Rhino.Geometry.Point3d.Y
Gets or sets the Y (second) coordinate of this point.

Rhino.Geometry.Point3d.Z
Gets or sets the Z (third) coordinate of this point.

Rhino.Geometry.Point3d.IsValid
Each coordinate of the point must pass the Rhino.RhinoMath.IsValidDouble(System.Double) test.

Rhino.Geometry.Point3d.MinimumCoordinate
Gets the smallest (both positive and negative) coordinate value in this point.

Rhino.Geometry.Point3d.MaximumCoordinate
Gets the largest (both positive and negative) valid coordinate in this point,
or RhinoMath.UnsetValue if no coordinate is valid.