Rhino.DocObjects.Tables.FontTable
Font tables store the list of fonts in a Rhino document.

Rhino.DocObjects.Tables.FontTable.Document
Document that owns this table.

Rhino.DocObjects.Tables.FontTable.Count
Number of fonts in the table.

Rhino.DocObjects.Tables.FontTable.CurrentIndex
At all times, there is a "current" font.  Unless otherwise specified,
new dimension objects are assigned to the current font. The current
font is never deleted.
Returns: Zero based font index of the current font.