Rhino.DocObjects.Tables.DimStyleTable.Add(System.String)
Adds a new dimension style to the document. The new dimension style will be initialized
with the current default dimension style properties.
name:
Name of the new dimension style. If null or empty, Rhino automatically generates the name.
Returns: index of new dimension style.

Rhino.DocObjects.Tables.DimStyleTable.Add(System.String,System.Boolean)
Adds a new dimension style to the document. The new dimension style will be initialized
with the current default dimension style properties.
name:
Name of the new dimension style. If null or empty, Rhino automatically generates the name.
reference: if true the dimstyle will not be saved in files.
Returns: index of new dimension style.

Rhino.DocObjects.Tables.DimStyleTable.Document
Document that owns this dimstyle table.

Rhino.DocObjects.Tables.DimStyleTable.Count
Number of dimstyles in the table.