Rhino.Input.Custom.PickContext
Provides storage for picking operations.

Rhino.Input.Custom.PickContext.UpdateClippingPlanes
Updates the clipping plane information in pick region. The
SetClippingPlanes and View fields must be called before calling
UpdateClippingPlanes().

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.BoundingBox,System.Boolean@)
Fast test to check if a bounding box intersects a pick frustum.
box:
boxCompletelyInFrustum:
Set to true if the box is completely contained in the pick frustum.
When doing a window or crossing pick, you can immediately return a
hit if the object's bounding box is completely inside of the pick frustum.
Returns:
False if bbox is invalid or box does not intersect the pick frustum

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Utility for picking 3d point
point:
depth:
depth returned here for point picks.
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
Returns: true if there is a hit

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Mesh,Rhino.Input.Custom.PickContext.MeshPickStyle,Rhino.Geometry.Point3d@,Rhino.Geometry.Point2d@,Rhino.Geometry.Point2d@,System.Double@,System.Double@,Rhino.Input.Custom.PickContext.MeshHitFlag@,System.Int32@)
Utility for picking meshes
mesh: mesh to test
pickStyle: mode used for pick test
hitPoint: location returned here for point picks
hitSurfaceUV:
If the mesh has surface parameters, set to the surface parameters of the hit point
hitTextureCoordinate:
If the mesh has texture coordinates, set to the texture coordinate of the hit
point.  Note that the texture coodinates can be set in many different ways
and this information is useless unless you know how the texture coordinates
are set on this particular mesh.
depth:
depth returned here for point picks
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
hitFlag:
For point picks, How to interpret the hitIndex (vertex hit, edge hit, or face hit)
hitIndex:
index of vertex/edge/face that was hit. Use hitFlag to determine what this index
corresponds to
Returns:

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Mesh,Rhino.Input.Custom.PickContext.MeshPickStyle,Rhino.Geometry.Point3d@,System.Double@,System.Double@,Rhino.Input.Custom.PickContext.MeshHitFlag@,System.Int32@)
Utility for picking meshes
mesh: mesh to test
pickStyle: mode used for pick test
hitPoint: location returned here for point picks
depth:
depth returned here for point picks
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
hitFlag:
For point picks, How to interpret the hitIndex (vertex hit, edge hit, or face hit)
hitIndex:
index of vertex/edge/face that was hit. Use hitFlag to determine what this index
corresponds to
Returns:

Rhino.Input.Custom.PickContext.PickMeshTopologyVertices(Rhino.Geometry.Mesh)
Utility for picking mesh vertices
mesh:
Returns: indices of mesh topology vertices that were picked

Rhino.Input.Custom.PickContext.View
This view can be a model view or a page view. When view is a page view,
then you need to distingish between the viewports MainViewport() and
ActiveViewport().  When m_view is a model view, both MainViewport() and
ActiveViewport() return the world view's viewport.

Rhino.Input.Custom.PickContext.PickLine
pick chord starts on near clipping plane and ends on far clipping plane.

Rhino.Input.Custom.PickContext.PickGroupsEnabled
Thue if GroupObjects should be added to the pick list

Rhino.Input.Custom.PickContext.SubObjectSelectionEnabled
True if the user had activated subobject selection