Rhino.Geometry.GeometryBase.OnSwitchToNonConst
Is called when a non-const operation occurs.

Rhino.Geometry.GeometryBase.DuplicateShallow
Constructs a light copy of this object. By "light", it is meant that the same
underlying data is used until something is done to attempt to change it. For example,
you could have a shallow copy of a very heavy mesh object and the same underlying
data will be used when doing things like inspecting the number of faces on the mesh.
If you modify the location of one of the mesh vertices, the shallow copy will create
a full duplicate of the underlying mesh data and the shallow copy will become a
deep copy.
Returns: An object of the same type as this object.
This behavior is overridden by implementing classes.

Rhino.Geometry.GeometryBase.Duplicate
Constructs a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.

Rhino.Geometry.GeometryBase.Transform(Rhino.Geometry.Transform)
Transforms the geometry. If the input Transform has a SimilarityType of
OrientationReversing, you may want to consider flipping the transformed
geometry after calling this function when it makes sense. For example,
you may want to call Flip() on a Brep after transforming it.
xform:
Transformation to apply to geometry.
Returns: true if geometry successfully transformed.

Rhino.Geometry.GeometryBase.Translate(Rhino.Geometry.Vector3d)
Translates the object along the specified vector.
translationVector: A moving vector.
Returns: true if geometry successfully translated.

Rhino.Geometry.GeometryBase.Translate(System.Double,System.Double,System.Double)
Translates the object along the specified vector.
x: The X component.
y: The Y component.
z: The Z component.
Returns: true if geometry successfully translated.

Rhino.Geometry.GeometryBase.Scale(System.Double)
Scales the object by the specified factor. The scale is centered at the origin.
scaleFactor: The uniform scaling factor.
Returns: true if geometry successfully scaled.

Rhino.Geometry.GeometryBase.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the object about the specified axis. A positive rotation
angle results in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: Angle of rotation in radians.
rotationAxis: Direction of the axis of rotation.
rotationCenter: Point on the axis of rotation.
Returns: true if geometry successfully rotated.

Rhino.Geometry.GeometryBase.MemoryEstimate
Computes an estimate of the number of bytes that this object is using in memory.
Returns: An estimated memory footprint.

Rhino.Geometry.GeometryBase.GetBoundingBox(System.Boolean)
Boundingbox solver. Gets the world axis aligned boundingbox for the geometry.
accurate: If true, a physically accurate boundingbox will be computed.
If not, a boundingbox estimate will be computed. For some geometry types there is no
difference between the estimate and the accurate boundingbox. Estimated boundingboxes
can be computed much (much) faster than accurate (or "tight") bounding boxes.
Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Returns:
The boundingbox of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Transform)
Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
xform: Transformation to apply to object prior to the BoundingBox computation.
The geometry itself is not modified.
Returns: The accurate boundingbox of the transformed geometry in world coordinates
or BoundingBox.Empty if not bounding box could be found.

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Plane)
Aligned Boundingbox solver. Gets the plane aligned boundingbox.
plane: Orientation plane for BoundingBox.
Returns: A BoundingBox in plane coordinates.

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Plane,Rhino.Geometry.Box@)
Aligned Boundingbox solver. Gets the plane aligned boundingbox.
plane: Orientation plane for BoundingBox.
worldBox: Aligned box in World coordinates.
Returns: A BoundingBox in plane coordinates.

Rhino.Geometry.GeometryBase.MakeDeformable
If possible, converts the object into a form that can be accurately modified
with "squishy" transformations like projections, shears, an non-uniform scaling.
Returns:
false if object cannot be converted to a deformable object. true if object was
already deformable or was converted into a deformable object.

Rhino.Geometry.GeometryBase.ComponentIndex
If this piece of geometry is a component in something larger, like a BrepEdge
in a Brep, then this function returns the component index.
Returns:
This object's component index.  If this object is not a sub-piece of a larger
geometric entity, then the returned index has
m_type = ComponentIndex.InvalidType
and m_index = -1.

Rhino.Geometry.GeometryBase.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.Geometry.GeometryBase.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.Geometry.GeometryBase.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.

Rhino.Geometry.GeometryBase.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.

Rhino.Geometry.GeometryBase.ObjectType
Useful for switch statements that need to differentiate between
basic object types like points, curves, surfaces, and so on.

Rhino.Geometry.GeometryBase.IsDeformable
true if object can be accurately modified with "squishy" transformations like
projections, shears, and non-uniform scaling.

Rhino.Geometry.GeometryBase.UserStringCount
Gets the amount of user strings.