Rhino.Input.RhinoGet.InGet(Rhino.RhinoDoc)
Returns true if the document is current in a "Get" operation.
Returns: true if a getter is currently active.

Rhino.Input.RhinoGet.GetPoint(System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point coordinate from the document.
prompt: Prompt to display in command line during the operation.
acceptNothing: if true, the user can press enter.
point: point value returned here.
Returns:
Commands.Result.Success - got point
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel point getting.
Remarks:
If you need options or more advanced user interface, then use GetPoint class.

Rhino.Input.RhinoGet.GetPointOnMesh(System.Guid,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
meshObjectId: An ID of a mesh in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: A command result based on user choice.

Rhino.Input.RhinoGet.GetPointOnMesh(Rhino.DocObjects.MeshObject,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
meshObject: An mesh object in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: The command result based on user choice.

Rhino.Input.RhinoGet.GetColor(System.String,System.Boolean,System.Drawing.Color@)
Easy to use color getter.
prompt: Command prompt.
acceptNothing: If true, the user can press enter.
color: Color value returned here. also used as default color.
Returns:
Commands.Result.Success - got color.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel color getting.
Remarks:
If you need options or more advanced user interface, then use GetColor class.

Rhino.Input.RhinoGet.GetOneObject(System.String,System.Boolean,Rhino.DocObjects.ObjectType,Rhino.DocObjects.ObjRef@)
Easy to use object getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObject: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.

Rhino.Input.RhinoGet.GetOneObject(System.String,System.Boolean,Rhino.Input.Custom.GetObjectGeometryFilter,Rhino.DocObjects.ObjRef@)
Easy to use object getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
objref: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.

Rhino.Input.RhinoGet.GetMultipleObjects(System.String,System.Boolean,Rhino.DocObjects.ObjectType,Rhino.DocObjects.ObjRef[]@)
Easy to use object getter for getting multiple objects.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObjects: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.

Rhino.Input.RhinoGet.GetMultipleObjects(System.String,System.Boolean,Rhino.Input.Custom.GetObjectGeometryFilter,Rhino.DocObjects.ObjRef[]@)
Easy to use object getter for getting multiple objects.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObjects: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.

Rhino.Input.RhinoGet.GetString(System.String,System.Boolean,System.String@)
Easy to use string getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputString: default string set to this value and string value returned here.
Returns:
Commands.Result.Success - got string
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel string getting.
Remarks:
If you need options or more advanced user interface, then use GetString class.

Rhino.Input.RhinoGet.GetBool(System.String,System.Boolean,System.String,System.String,System.Boolean@)
Easy to use bool getter.
prompt: Command prompt.
acceptNothing: If true, the user can press enter.
offPrompt: The 'false/off' message.
onPrompt: The 'true/on' message.
boolValue: Default bool value set to this and returned here.
Returns: The getter result based on user choice.
Commands.Result.Success - got value.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancelled value getting.

Rhino.Input.RhinoGet.GetNumber(System.String,System.Boolean,System.Double@,System.Double,System.Double)
Easy to use number getter.
prompt: The command prompt.
acceptNothing: If true, the user can press Enter.
outputNumber:
Default number is set to this value and the return number value is assigned to this variable during the call.
lowerLimit: The minimum allowed value.
upperLimit: The maximum allowed value.
Returns:
Commands.Result.Success - got number.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel number getting.

Rhino.Input.RhinoGet.GetNumber(System.String,System.Boolean,System.Double@)
Easy to use number getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.

Rhino.Input.RhinoGet.GetInteger(System.String,System.Boolean,System.Int32@)
Easy to use number getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.

Rhino.Input.RhinoGet.GetInteger(System.String,System.Boolean,System.Int32@,System.Int32,System.Int32)
Easy to use number getter.
prompt: The command prompt.
acceptNothing: If true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
lowerLimit: The minimum allowed value.
upperLimit: The maximum allowed value.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.

Rhino.Input.RhinoGet.GetPlane(Rhino.Geometry.Plane@)
Gets an oriented infinite plane.
plane: The plane result.
Returns:
Commands.Result.Success - got plane.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel number getting.

Rhino.Input.RhinoGet.GetRectangle(Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle.
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetRectangle(Rhino.Input.GetBoxMode,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String},Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle made up of four points.
mode: A get box mode.
firstPoint: The first corner used. Pass Point3d.Unset if you do not want to set this.
prompts: Optional prompts to display while getting points. May be null.
corners: Corners of the rectangle in counter-clockwise order will be assigned to this out parameter during this call.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.Get2dRectangle(System.Boolean,System.Drawing.Rectangle@,Rhino.Display.RhinoView@)
Gets a rectangle in view window coordinates.
solidPen:
If true, a solid pen is used for drawing while the user selects a rectangle.
If false, a dotted pen is used for drawing while the user selects a rectangle.
rectangle:
user selected rectangle in window coordinates.
rectView:
view that the user selected the window in.
Returns: Success or Cancel.

Rhino.Input.RhinoGet.GetBox(Rhino.Geometry.Box@)
Asks the user to select a Box in the viewport.
box: If the result is Success, this parameter will be filled out.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetBox(Rhino.Geometry.Box@,Rhino.Input.GetBoxMode,Rhino.Geometry.Point3d,System.String,System.String,System.String)
Asks the user to select a Box in the viewport.
box: If the result is Success, this parameter will be filled out.
mode: A particular "get box" mode, or Rhino.Input.GetBoxMode.All.
basePoint: Optional base point. Supply Point3d.Unset if you don't want to use this.
prompt1: Optional first prompt. Supply null to use the default prompt.
prompt2: Optional second prompt. Supply null to use the default prompt.
prompt3: Optional third prompt. Supply null to use the default prompt.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetLinearDimension(Rhino.Geometry.LinearDimension@)


Rhino.Input.RhinoGet.GetView(System.String,Rhino.Display.RhinoView@)
Allows the user to interactively pick a viewport.
command_prompt: The command prompt during the request.
view: The view that the user picked.
If the operation is successful, then this out parameter is assigned the correct view during this call.
Returns: The result based on user choice.