Rhino.Geometry.ClippingPlaneSurface
Represents a planar surface that is used as clipping plane in viewports.

Rhino.Geometry.ClippingPlaneSurface.ViewportIds
Returns Ids of viewports that this clipping plane is supposed to clip.
Returns: An array of globally unique ideantifiers (Guids) to the viewports.

Rhino.Geometry.ClippingPlaneSurface.Plane
Gets or sets the clipping plane.