Rhino.ApplicationSettings.AppearanceSettingsState
Represents a snapshot of the values in Rhino.ApplicationSettings.AppearanceSettings.

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultFontFaceName
Gets or sets the name of the default font face.

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultLayerColor
Gets or sets the default layer color.

Rhino.ApplicationSettings.AppearanceSettingsState.SelectedObjectColor
The color used to draw selected objects.
The default is yellow, but this can be customized by the user.

Rhino.ApplicationSettings.AppearanceSettingsState.LockedObjectColor
Gets or sets the color used to draw locked objects.

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconXAxisColor
Gets or sets the color of the world X axis of the world coordinates icon,
appearing usually bottom left in viewports.

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconYAxisColor
Gets or sets the color of the world Y axis of the world coordinate icon,
appearing usually bottom left in viewports.

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconZAxisColor
Gets or sets the color of the world Z axis of the world coordinate icon,
appearing usually bottom left in viewports.

Rhino.ApplicationSettings.AppearanceSettingsState.TrackingColor
Gets or sets the tracking color.

Rhino.ApplicationSettings.AppearanceSettingsState.FeedbackColor
Gets or sets the feedback color.

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultObjectColor
Gets or sets the default object color.

Rhino.ApplicationSettings.AppearanceSettingsState.ViewportBackgroundColor
Gets or sets the viewport background color.

Rhino.ApplicationSettings.AppearanceSettingsState.FrameBackgroundColor
Gets or sets the frame background color.

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptTextColor
Gets or sets the command prompt text color.

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptHypertextColor
Gets or sets the comand prompt hypertext color.

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptBackgroundColor
Gets or sets the comand prompt background color.

Rhino.ApplicationSettings.AppearanceSettingsState.CrosshairColor
Gets or sets the crosshair color.

Rhino.ApplicationSettings.AppearanceSettingsState.PageviewPaperColor
CRhinoPageView paper background. A rectangle is drawn into the background
of page views to represent the printed area. The alpha portion of the color
is used to draw the paper blended into the background

Rhino.ApplicationSettings.AppearanceSettingsState.CurrentLayerBackgroundColor
Gets or sets the color used by the layer manager dialog as the background color for the current layer.

Rhino.ApplicationSettings.AppearanceSettingsState.EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.

Rhino.ApplicationSettings.AppearanceSettingsState.EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.

Rhino.ApplicationSettings.AppearanceSettingsState.ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.

Rhino.ApplicationSettings.AppearanceSettingsState.ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.

Rhino.ApplicationSettings.AppearanceSettingsState.GridThinLineColor
Gets or sets the color of the thin line in the grid.

Rhino.ApplicationSettings.AppearanceSettingsState.GridThickLineColor
Gets or sets the color of the thick line in the grid.

Rhino.ApplicationSettings.AppearanceSettingsState.GridXAxisLineColor
Gets or sets the color of X axis line in the grid.

Rhino.ApplicationSettings.AppearanceSettingsState.GridYAxisLineColor
Gets or sets the color of Y axis line in the grid.

Rhino.ApplicationSettings.AppearanceSettingsState.GridZAxisLineColor
Gets or sets the color of Z axis line in the grid.