Rhino.Geometry.BrepFace.PullPointsToFace(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Pulls one or more points to a brep face. This method has been backported in
Rhino4 and is not guaranteed to work in the same way as it works within Rhino5.
points: Points to pull.
tolerance: Tolerance for pulling operation. Only points that are closer than tolerance will be pulled to the face.
Returns: An array of pulled points.

Rhino.Geometry.BrepFace.SetDomain(System.Int32,Rhino.Geometry.Interval)
Sets the surface domain of this face.
direction: Direction of face to set (0 = U, 1 = V).
domain: Domain to apply.
Returns: true on success, false on failure.

Rhino.Geometry.BrepFace.DuplicateFace(System.Boolean)
Duplicate a face from the brep to create new single face brep.
duplicateMeshes: If true, shading meshes will be copied as well.
Returns: A new single-face brep synonymous with the current Face.

Rhino.Geometry.BrepFace.DuplicateSurface
Gets a copy to the untrimmed surface that this face is based on.
Returns: A copy of this face's underlying surface.

Rhino.Geometry.BrepFace.UnderlyingSurface
Gets the untrimmed surface that is the base of this face.
Returns: A surface, or null on error.

Rhino.Geometry.BrepFace.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Split this face using 3D trimming curves.
curves: Curves to split with.
tolerance: Tolerance for splitting, when in doubt use the Document Absolute Tolerance.
Returns: A brep consisting of all the split fragments, or null on failure.

Rhino.Geometry.BrepFace.IsPointOnFace(System.Double,System.Double)
Tests if a parameter space point is on the interior of a trimmed face.
u: Parameter space point u value.
v: Parameter space point v value.
Returns: A value describing the spatial relationship between the point and the face.

Rhino.Geometry.BrepFace.TrimAwareIsoIntervals(System.Int32,System.Double)
Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns:
If direction = 0, the parameter space iso interval connects the 2d points
(intervals[i][0],iso_constant) and (intervals[i][1],iso_constant).
If direction = 1, the parameter space iso interval connects the 2d points
(iso_constant,intervals[i][0]) and (iso_constant,intervals[i][1]).

Rhino.Geometry.BrepFace.TrimAwareIsoCurve(System.Int32,System.Double)
Similar to IsoCurve function, except this function pays attention to trims on faces
and may return multiple curves.
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns: Isoparametric curves connecting all points with the constantParameter value.
Remarks:
In this function "direction" indicates which direction the resulting curve runs.
0: horizontal, 1: vertical
In the other Surface functions that take a "direction" argument,
"direction" indicates if "constantParameter" is a "u" or "v" parameter.

Rhino.Geometry.BrepFace.GetMesh(Rhino.Geometry.MeshType)
Obtains a reference to a specified type of mesh for this brep face.
meshType: The mesh type.
Returns: A mesh.

Rhino.Geometry.BrepFace.SetMesh(Rhino.Geometry.MeshType,Rhino.Geometry.Mesh)
Sets a reference to a specified type of mesh for this brep face.
meshType: The mesh type.
mesh: The new mesh.
Returns: true if the operation succeeded; otherwise false.

Rhino.Geometry.BrepFace.AdjacentEdges
Gets the indices of all the BrepEdges that delineate this Face.

Rhino.Geometry.BrepFace.AdjacentFaces
Gets the indices of all the BrepFaces that surround (are adjacent to) this face.

Rhino.Geometry.BrepFace.ChangeSurface(System.Int32)
Expert user tool that replaces the 3d surface geometry use by the face.
surfaceIndex: brep surface index of new surface.
Returns: true if successful.
Remarks:
If the face had a surface and new surface has a different shape, then
you probably want to call something like RebuildEdges() to move
the 3d edge curves so they will lie on the new surface. This doesn't
delete the old surface; call Brep.CullUnusedSurfaces() or Brep.Compact()
to remove unused surfaces.

Rhino.Geometry.BrepFace.RebuildEdges(System.Double,System.Boolean,System.Boolean)
Rebuild the edges used by a face so they lie on the surface.
tolerance: tolerance for fitting 3d edge curves.
rebuildSharedEdges:
if false and and edge is used by this face and a neighbor, then the edge
will be skipped.
rebuildVertices:
if true, vertex locations are updated to lie on the surface.
Returns: true on success.

Rhino.Geometry.BrepFace.OrientationIsReversed
true if face orientation is opposite of natural surface orientation.

Rhino.Geometry.BrepFace.IsSurface
Gets a value indicating whether the face is synonymous with the underlying surface.
If a Face has no trimming curves then it is considered a Surface.

Rhino.Geometry.BrepFace.FaceIndex
Index of face in Brep.Faces array.

Rhino.Geometry.BrepFace.Loops
Loops in this face.

Rhino.Geometry.BrepFace.OuterLoop
Every face has a single outer loop.