Rhino.ApplicationSettings.SmartTrackSettings.GetCurrentState
Gets the current settings.
Returns: A new Smart Track state with current settings.

Rhino.ApplicationSettings.SmartTrackSettings.GetDefaultState
Gets the Smart Track factory settings.
Returns: A new Smart Track state with factory settings.

Rhino.ApplicationSettings.SmartTrackSettings.UpdateFromState(Rhino.ApplicationSettings.SmartTrackSettingsState)
Updates from a particular setting state.
state: The new state that will be set.

Rhino.ApplicationSettings.SmartTrackSettings.UseSmartTrack
Gets or sets if the Smart Track feature is active.

Rhino.ApplicationSettings.SmartTrackSettings.UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.

Rhino.ApplicationSettings.SmartTrackSettings.SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
Orthogonal lines are then drawn automatically.

Rhino.ApplicationSettings.SmartTrackSettings.SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.

Rhino.ApplicationSettings.SmartTrackSettings.ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.

Rhino.ApplicationSettings.SmartTrackSettings.MaxSmartPoints
Gets or sets the maximum number of smart points.

Rhino.ApplicationSettings.SmartTrackSettings.LineColor
Gets or sets the smart track line color.

Rhino.ApplicationSettings.SmartTrackSettings.TanPerpLineColor
Gets or sets the tangent and perpendicular line color.

Rhino.ApplicationSettings.SmartTrackSettings.PointColor
Gets or sets the point color.

Rhino.ApplicationSettings.SmartTrackSettings.ActivePointColor
Gets or sets the active point color.