Rhino.Display.RhinoPageView.SetPageAsActive


Rhino.Display.RhinoPageView.SetActiveDetail(System.Guid)


Rhino.Display.RhinoPageView.AddDetailView(System.String,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Display.DefinedViewportProjection)
Creates a detail view object that is displayed on this page and adds it to the doc.
title: The detail view title.
corner0: Corners of the detail view in world coordinates.
corner1: Corners of the detail view in world coordinates.
initialProjection: The defined initial projection type.
Returns: Newly created detail view on success. null on error.

Rhino.Display.RhinoPageView.GetDetailViews
Gets a list of the detail view objects associated with this layout.
Returns: A detail view object array. This can be null, but not empty.

Rhino.Display.RhinoPageView.ActiveViewport
The ActiveViewport is the same as the MainViewport for standard RhinoViews. In
a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object.
Most of the time, you will use ActiveViewport unless you explicitly need to work with
the main viewport.

Rhino.Display.RhinoPageView.ActiveViewportID
Returns viewport ID for the active viewport. Faster than ActiveViewport function when
working with page views.

Rhino.Display.RhinoPageView.PageIsActive
true if the page is active instead of any detail views. This occurs
when the MainViewport.Id == ActiveViewportID.

Rhino.Display.RhinoPageView.PageName
Same as the MainViewport.Name.