Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle)
Constructs a new cylinder with infinite height.
baseCircle: Base circle for infinite cylinder.

Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle,System.Double)
Constructs a new cylinder with a finite height.
baseCircle: Base circle for cylinder.
height: Height of cylinder (zero for infinite cylinder).

Rhino.Geometry.Cylinder.CircleAt(System.Double)
Compute the circle at the given elevation parameter.
linearParameter: Height parameter for circle section.

Rhino.Geometry.Cylinder.LineAt(System.Double)
Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infite.
angularParameter: Angle parameter for line section.

Rhino.Geometry.Cylinder.ToBrep(System.Boolean,System.Boolean)
Constructs a Brep representation of this Cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
capBottom: If true, the bottom of the cylinder will be capped.
capTop: If true, the top of the cylinder will be capped.
Returns: A Brep representation of the cylinder or null.

Rhino.Geometry.Cylinder.ToNurbsSurface
Constructs a Nurbs surface representation of this cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
Returns: A Nurbs surface representation of the cylinder or null.

Rhino.Geometry.Cylinder.ToRevSurface
Constructs a RevSurface representation of this Cylinder.
This is synonymous with calling RevSurface.CreateFromCylinder().
Returns: A RevSurface representation of the cylinder or null.

Rhino.Geometry.Cylinder.Unset
Gets an invalid Cylinder.

Rhino.Geometry.Cylinder.IsValid
Gets a boolean value indicating whether this cylinder is valid.
A valid cylinder is represented by a valid circle and two valid heights.

Rhino.Geometry.Cylinder.IsFinite
true if the cylinder is finite (Height0 != Height1)
false if the cylinder is infinite.

Rhino.Geometry.Cylinder.Center
Gets the center point of the defining circle.

Rhino.Geometry.Cylinder.Axis
Gets the axis direction of the cylinder.

Rhino.Geometry.Cylinder.TotalHeight
Gets the height of the cylinder.
Infinite cylinders have a height of zero, not Double.PositiveInfinity.

Rhino.Geometry.Cylinder.Height1
Gets or sets the start height of the cylinder.

Rhino.Geometry.Cylinder.Height2
Gets or sets the end height of the cylinder.
If the end height equals the start height, the cylinder is
presumed to be infinite.