Rhino.Geometry.Hatch.Create(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)
Constructs an array of hatches from a set of curves.
curves: An array, a list or any enumarable set of Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
Returns: An array of hatches. The array might be empty on error.
Throws System.ArgumentNullException: If curves is null.

Rhino.Geometry.Hatch.Create(Rhino.Geometry.Curve,System.Int32,System.Double,System.Double)
Constructs an array of hatches from one curve.
curve: A Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
Returns: An array of hatches. The array might be empty on error.

Rhino.Geometry.Hatch.Explode
Decomposes the hatch pattern into an array of geometry.
Returns: An array of geometry that formed the appearance of the original elements.

Rhino.Geometry.Hatch.Get3dCurves(System.Boolean)
Gets 3d curves that define the boundaries of the hatch
outer: true to get the outer curves, false to get the inner curves
Returns:

Rhino.Geometry.Hatch.PatternIndex
Gets or sets the index of the pattern in the document hatch pattern table.

Rhino.Geometry.Hatch.PatternRotation
Gets or sets the relative rotation of the pattern.

Rhino.Geometry.Hatch.PatternScale
Gets or sets the scaling factor of the pattern.