Rhino.Display.ColorHSL.#ctor(System.Drawing.Color)
Constructs a new instance of ColorHSL that is equivalent to an RGB color.
rgb: RGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSL with custom channel values.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSL with custom channel values.
alpha: Alpha channel value. Channel will be limited to 0~1.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSL.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest HSL equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The HSL equivalent of the CMYK color.

Rhino.Display.ColorHSL.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest HSL equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The HSL equivalent of the XYZ color.

Rhino.Display.ColorHSL.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest HSL equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The HSL equivalent of the LAB color.

Rhino.Display.ColorHSL.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest HSL equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The HSL equivalent of the LCH color.

Rhino.Display.ColorHSL.ToArgbColor
Convert HSL color to an equivalent System.Drawing.Color.
Returns: A .Net framework library color value.

Rhino.Display.ColorHSL.H
Gets or sets the hue channel value.
Hue channels rotate between 0.0 and 1.0.

Rhino.Display.ColorHSL.S
Gets or sets the saturation channel value.
Saturation channels are limited to a 0~1 range.

Rhino.Display.ColorHSL.L
Gets or sets the luminance channel value.
Luminance channels are limited to a 0~1 range.

Rhino.Display.ColorHSL.A
Gets or sets the alpha channel value.
Alpha channels are limited to a 0~1 range.