Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Plane)
Copy constructor.
This is nothing special and performs the same as assigning to another variable.
other: The source plane value.

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and a normal vector.
origin: Origin point of the plane.
normal: Non-zero normal to the plane.
CreateFromNormal

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and two vectors in the plane.
Origin point of the plane.
Non-zero vector in the plane that determines the x-axis direction.
Non-zero vector not parallel to x_dir that is used to determine the
yaxis direction. y_dir does not need to be perpendicular to x_dir.

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a plane from three non-colinear points.
Origin point of the plane.
Second point in the plane. The x-axis will be parallel to x_point-origin.
Third point on the plane that is not colinear with the first two points.
yaxis*(y_point-origin) will be > 0.

Rhino.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a plane from an equation
ax+by+cz=d.

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane.
Returns: A value indicating the result of the operation.

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@,System.Double@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane.
maximumDeviation: The distance from the furthest point to the plane.
Returns: A value indicating the result of the operation.

Rhino.Geometry.Plane.op_Equality(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Determines if two planes are equal.
a: A first plane.
b: A second plane.
Returns: true if the two planes have all equal components; false otherwise.

Rhino.Geometry.Plane.op_Inequality(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Determines if two planes are different.
a: A first plane.
b: A second plane.
Returns: true if the two planes have any different componet components; false otherwise.

Rhino.Geometry.Plane.Equals(Rhino.Geometry.Plane)
Determines if another plane has the same components as this plane.
plane: A plane.
Returns: true if plane has the same components as this plane; false otherwise.

Rhino.Geometry.Plane.GetPlaneEquation
Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
Returns:
Array of four values.

Rhino.Geometry.Plane.PointAt(System.Double,System.Double)
Evaluate a point on the plane.
u: evaulation parameter.
v: evaulation parameter.
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis.

Rhino.Geometry.Plane.PointAt(System.Double,System.Double,System.Double)
Evaluate a point on the plane.
u: evaulation parameter.
v: evaulation parameter.
w: evaulation parameter.
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis + z*plane.zaxis.

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.BoundingBox,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extends this plane through a bounding box.
box: A box to use as minimal extension boundary.
s:
If this function returns true,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns true,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.Box,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extend this plane through a Box.
box: A box to use for extension.
s:
If this function returns true,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns true,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.ClosestParameter(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Gets the parameters of the point on the plane closest to a test point.
testPoint: Point to get close to.
s: Parameter along plane X-direction.
t: Parameter along plane Y-direction.
Returns:
true if a parameter could be found,
false if the point could not be projected successfully.

Rhino.Geometry.Plane.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the plane closest to a test point.
testPoint: Point to get close to.
Returns:
The point on the plane that is closest to testPoint,
or Point3d.Unset on failure.

Rhino.Geometry.Plane.DistanceTo(Rhino.Geometry.Point3d)
Returns the signed distance from testPoint to its projection onto this plane.
If the point is below the plane, a negative distance is returned.
testPoint: Point to test.
Returns: Signed distance from this plane to testPoint.

Rhino.Geometry.Plane.RemapToPlaneSpace(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Convert a point from World space coordinates into Plane space coordinates.
ptSample: World point to remap.
ptPlane: Point in plane (s,t,d) coordinates.
Returns: true on success, false on failure.
Remarks: D stands for distance, not disease.

Rhino.Geometry.Plane.Flip
Flip this plane by swapping out the X and Y axes and inverting the Z axis.

Rhino.Geometry.Plane.Transform(Rhino.Geometry.Transform)
Transform the plane with a Transformation matrix.
xform: Transformation to apply to plane.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Translate(Rhino.Geometry.Vector3d)
Translate (move) the plane along a vector.
delta: Translation (motion) vector.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
sinAngle: Sin(angle).
cosAngle: Cos(angle).
axis: Axis of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
angle: Angle in radians.
axis: Axis of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
angle: Angle in radians.
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
sinAngle: Sin(angle)
cosAngle: Cos(angle)
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Plane.Origin
Gets or sets the origin point of this plane.

Rhino.Geometry.Plane.OriginX
Gets or sets the X coordinate of the origin of this plane.

Rhino.Geometry.Plane.OriginY
Gets or sets the Y coordinate of the origin of this plane.

Rhino.Geometry.Plane.OriginZ
Gets or sets the Z coordinate of the origin of this plane.

Rhino.Geometry.Plane.XAxis
Gets or sets the X axis vector of this plane.

Rhino.Geometry.Plane.YAxis
Gets or sets the Y axis vector of this plane.

Rhino.Geometry.Plane.ZAxis
Gets or sets the Z axis vector of this plane.

Rhino.Geometry.Plane.WorldXY
plane coincident with the World XY plane.

Rhino.Geometry.Plane.WorldYZ
plane coincident with the World YZ plane.

Rhino.Geometry.Plane.WorldZX
plane coincident with the World ZX plane.

Rhino.Geometry.Plane.Unset
Gets a plane that contains Unset origin and axis vectors.

Rhino.Geometry.Plane.Normal
Gets the normal of this plane. This is essentially the ZAxis of the plane.

Rhino.Geometry.Plane.IsValid
Gets a value indicating whether or not this is a valid plane.
A plane is considered to be valid when all fields contain reasonable
information and the equation jibes with point and zaxis.