Rhino.Geometry.TextEntity
Represents text geometry.
This class refers to the geometric element that is independent from the document.

Rhino.Geometry.TextEntity.#ctor
Initializes a new instance of the Rhino.Geometry.TextEntity class.

Rhino.Geometry.TextEntity.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.TextEntity.Explode
Explodes this text entity into an array of curves.
Returns: An array of curves that forms the outline or content of this text entity.

Rhino.Geometry.TextEntity.FontIndex
Gets or sets the index of font in document font table used by the text.

Rhino.Geometry.TextEntity.Justification
Gets or sets the justification of text in relation to its base point.

Rhino.Geometry.TextEntity.MaskEnabled
Determines whether or not to draw a Text Mask

Rhino.Geometry.TextEntity.MaskUsesViewportColor
If true, the viewport's color is used for the mask color. If
false, the color defined by MaskColor is used

Rhino.Geometry.TextEntity.MaskColor
Color to use for drawing a text mask when it is enabled. If the mask is
enabled and MaskColor is System.Drawing.Color.Transparent, then the
viewport's color will be used for the MaskColor

Rhino.Geometry.TextEntity.MaskOffset
distance around text to display mask

Rhino.Geometry.TextEntity.AnnotativeScalingEnabled
Scale annotation according to detail scale factor in paperspace
or by 1.0 in paperspace and not in a detail
Otherwise, dimscale or text scale is used