Rhino.PlugInSettings.SettingsFileName(System.Boolean)
Computes full path to settings file to read or write.

Rhino.PlugInSettings.#ctor(System.Reflection.Assembly,System.Guid,Rhino.PlugInSettings)
PersistentSettingsManager constructor.
pluginAssembly: Requires a valid Skin, DLL or PlugIn object to attach to.
pluginId: Requires a PlugIn Id to attach to.
allUserSettings: All user setting to compare for changes.

Rhino.PlugInSettings.#ctor(System.Guid,Rhino.PlugInSettings)
PersistentSettingsManager constructor
pluginId:
allUserSettings:

Rhino.PlugInSettings.ReadSettings
Returns:

Rhino.PlugInSettings.ReadSettingsHelper(System.Boolean)
Reads existing settings for a plug-in and its associated commands.
Clears the dirty flag for the settings.
Returns:
true if settings are successfully read. false if there was no existing
settings file to read, or if a read lock could not be acquired.

Rhino.PlugInSettings.DeleteDirectory(System.String)
Helper method to delete a directory if it is empty.
directory: Full path to directory to delete.
Returns: Returns true if the directory was empty and successfully deleted otherwise returns false.

Rhino.PlugInSettings.WriteSettingsHelper(System.Boolean)
Flushes the current settings to the user's roaming directory.
If an xml file for the guid already exists, it attempts to update
the file in order to maintain comments, etc. If the xml is corrupt
or the file does not exist, it writes out a new file.
Returns:
true if settings where flushed to disk, otherwise false.

Rhino.PlugInSettings.WriteTempFile(System.String)
Constructs a temporary file and write plug-in and plug-in command settings to the temp file.
Only writes PersistentSettings that contain one or more item with a value that differs
from the default value.