Rhino.DocObjects.BitmapEntry.Save(System.String)
fileName:
Returns:

Rhino.DocObjects.BitmapEntry.FileName
The name of this bitmap.

Rhino.DocObjects.BitmapEntry.IsReference
Gets a value indicting whether this bitmap is a referenced bitmap.
Referenced bitmaps are part of referenced documents.