Rhino.Geometry.RTree
Represents a spatial search structure based on implementations of the
R-tree algorithm by Toni Gutman.
Remarks:
The opennurbs rtree code is a modifed version of the free and unrestricted
R-tree implementation obtianed from http://www.superliminal.com/sources/sources.htm .

Rhino.Geometry.RTree.#ctor
Initializes a new, empty instance of the tree.

Rhino.Geometry.RTree.CreateMeshFaceTree(Rhino.Geometry.Mesh)
Constructs a new tree with an element for each face in the mesh.
The element id is set to the index of the face.
mesh: A mesh.
Returns: A new tree, or null on error.

Rhino.Geometry.RTree.CreatePointCloudTree(Rhino.Geometry.PointCloud)
Constructs a new tree with an element for each pointcloud point.
cloud: A pointcloud.
Returns: A new tree, or null on error.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point3d,System.Int32)
Inserts an element into the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point3d,System.IntPtr)
Inserts an element into the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.BoundingBox,System.Int32)
Inserts an element into the tree.
box: A bounding box.
elementId: A number.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.BoundingBox,System.IntPtr)
Inserts an element into the tree.
box: A bounding box.
elementId: A pointer.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point2d,System.Int32)
Inserts an element into the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point2d,System.IntPtr)
Inserts an element into the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully inserted.

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point3d,System.Int32)
Removes an element from the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully removed.

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point3d,System.IntPtr)
Removes an element from the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully removed.

Rhino.Geometry.RTree.Remove(Rhino.Geometry.BoundingBox,System.Int32)
Removes an element from the tree.
box: A bounding box.
elementId: A number.
Returns: true if element was successfully removed.

Rhino.Geometry.RTree.Remove(Rhino.Geometry.BoundingBox,System.IntPtr)
Removes an element from the tree.
box: A bounding box.
elementId: A pointer.
Returns: true if element was successfully removed.

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point2d,System.Int32)
Removes an element from the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully removed.

Rhino.Geometry.RTree.Clear
Removes all elements.

Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.

Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.

Rhino.Geometry.RTree.SearchOverlaps(Rhino.Geometry.RTree,Rhino.Geometry.RTree,System.Double,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches two R-trees for all pairs elements whose bounding boxes overlap.
treeA: A first tree.
treeB: A second tree.
tolerance:
If the distance between a pair of bounding boxes is less than tolerance,
then callback is called.
callback: A callback event handler.
Returns:
true if entire tree was searched.  It is possible no results were found.

Rhino.Geometry.RTree.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.RTree.Count
Gets the number of items in this tree.