Rhino.Render.TextureMappingType
Defines enumerated constants for mapping types such as planar, cylindrical or spherical.

Rhino.Render.TextureMappingType.CylinderMapping
(u, v, w) = logitude, height, radius.