Rhino.IndexPair.#ctor(System.Int32,System.Int32)
Initializes a new instance of Rhino.IndexPair with two indices.
i: A first index.
j: A second index.

Rhino.IndexPair.I
Gets or sets the first, I index.

Rhino.IndexPair.J
Gets or sets the second, J index.