Rhino.Geometry.Light.#ctor
Initializes a new light.

Rhino.Geometry.Light.SetAttenuation(System.Double,System.Double,System.Double)
Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
a0: The new constant attenuation divisor term.
a1: The new reverse linear attenuation divisor term.
a2: The new reverse quadratic attenuation divisor term.

Rhino.Geometry.Light.GetAttenuation(System.Double)
Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
d: The distance to evaluate.
Returns: 0 if a0 + d*a1 + d^2*a2 <= 0.

Rhino.Geometry.Light.GetSpotLightRadii(System.Double@,System.Double@)
Gets the spot light radii.
innerRadius: The inner radius. This out parameter is assigned during this call.
outerRadius: The outer radius. This out parameter is assigned during this call.
Returns: true if operation succeeded; otherwise, false.

Rhino.Geometry.Light.IsEnabled
Gets or sets a value that defines if the light is turned on (true) or off (false).

Rhino.Geometry.Light.LightStyle
Gets or sets a light style on this camera.

Rhino.Geometry.Light.IsPointLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraPoint or WorldPoint.

Rhino.Geometry.Light.IsDirectionalLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraDirectional or WorldDirectional.

Rhino.Geometry.Light.IsSpotLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraSpot or WorldSpot.

Rhino.Geometry.Light.IsLinearLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle WorldLinear.

Rhino.Geometry.Light.IsRectangularLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle WorldRectangular.

Rhino.Geometry.Light.IsSunLight
Gets a value indicating whether this object is a Sun light.

Rhino.Geometry.Light.CoordinateSystem
Gets a value, determined by LightStyle, that explains whether
the camera diretions are relative to World or Camera spaces.

Rhino.Geometry.Light.Location
Gets or sets the light or 3D position or location.

Rhino.Geometry.Light.Direction
Gets or sets the vector direction of the camera.

Rhino.Geometry.Light.PerpendicularDirection
Gets a perpendicular vector to the camera direction.

Rhino.Geometry.Light.Intensity
Gets or sets the light intensity.

Rhino.Geometry.Light.PowerWatts
Gets or sets the light power in watts (W).

Rhino.Geometry.Light.PowerLumens
Gets or sets the light power in lumens (lm).

Rhino.Geometry.Light.PowerCandela
Gets or sets the light power in candelas (cd).

Rhino.Geometry.Light.Ambient
Gets or sets the ambient color.

Rhino.Geometry.Light.Diffuse
Gets or sets the diffuse color.

Rhino.Geometry.Light.Specular
Gets or sets the specular color.

Rhino.Geometry.Light.SpotAngleRadians
Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2  (0 to 90 degrees).

Rhino.Geometry.Light.SpotExponent
The spot exponent varies from 0.0 to 128.0 and provides
an exponential interface for controling the focus or
concentration of a spotlight (like the
OpenGL GL_SPOT_EXPONENT parameter).  The spot exponent
and hot spot parameters are linked; changing one will
change the other.
A hot spot setting of 0.0 corresponds to a spot exponent of 128.
A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.

Rhino.Geometry.Light.HotSpot
The hot spot setting runs from 0.0 to 1.0 and is used to
provides a linear interface for controling the focus or
concentration of a spotlight.
A hot spot setting of 0.0 corresponds to a spot exponent of 128.
A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.

Rhino.Geometry.Light.Length
Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)

Rhino.Geometry.Light.Width
Gets or sets the width in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)

Rhino.Geometry.Light.SpotLightShadowIntensity
Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)

Rhino.Geometry.Light.Name
Gets or sets the spot light name.