Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer
Wrapper for a C++ ON_SimpleArray<ON_Brep*> or ON_SimpleArray<const ON_Brep*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Add(Rhino.Geometry.Brep,System.Boolean)
Adds a brep to the list.
brep: A brep to add.
asConst: Whether this brep should be treated as non-modifiable.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Count
Gets the amount of breps in this array.