Rhino.Geometry.AreaMassProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Curve)
Computes an AreaMassProperties for a closed planar curve.
closedPlanarCurve: Curve to measure.
Returns: The AreaMassProperties for the given curve or null on failure.
Throws System.ArgumentNullException: When closedPlanarCurve is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Curve,System.Double)
Computes an AreaMassProperties for a closed planar curve.
closedPlanarCurve: Curve to measure.
planarTolerance: absolute tolerance used to insure the closed curve is planar
Returns: The AreaMassProperties for the given curve or null on failure.
Throws System.ArgumentNullException: When closedPlanarCurve is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Hatch)
Computes an AreaMassProperties for a hatch.
hatch: Hatch to measure.
Returns: The AreaMassProperties for the given hatch or null on failure.
Throws System.ArgumentNullException: When hatch is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Mesh)
Computes an AreaMassProperties for a mesh.
mesh: Mesh to measure.
Returns: The AreaMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep)
Computes an AreaMassProperties for a brep.
brep: Brep to measure.
Returns: The AreaMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Surface)
Computes an AreaMassProperties for a surface.
surface: Surface to measure.
Returns: The AreaMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.

Rhino.Geometry.AreaMassProperties.Area
Gets the area solution.

Rhino.Geometry.AreaMassProperties.AreaError
Gets the uncertainty in the area calculation.

Rhino.Geometry.AreaMassProperties.Centroid
Gets the area centroid in the world coordinate system.

Rhino.Geometry.AreaMassProperties.CentroidError
Gets the uncertainty in the centroid calculation.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the area
Y is integral of "y dm" over the area
Z is integral of "z dm" over the area.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "xx dm" over the area
Y is integral of "yy dm" over the area
Z is integral of "zz dm" over the area.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the area
Y is integral of "yz dm" over the area
Z is integral of "zx dm" over the area.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm.
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesRadiiOfGyration
Radii of gyration with respect to world coordinate system.
X = sqrt(integral of (y^2 + z^2) dm/M)
Y = sqrt(integral of (z^2 + x^2) dm/M)
Z = sqrt(integral of (z^2 + y^2) dm/M)
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesSecondMoments
Second moments with respect to centroid coordinate system.
X = integral of (x-x0)^2 dm
Y = integral of (y-y0)^2 dm
Z = integral of (z-z0)^2 dm
where (x0,y0,z0) = centroid.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesMomentsOfInertia
Moments of inertia with respect to centroid coordinate system.
X = integral of ((y-y0)^2 + (z-z0)^2) dm
Y = integral of ((z-z0)^2 + (x-x0)^2) dm
Z = integral of ((z-z0)^2 + (y-y0)^2) dm
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesRadiiOfGyration
Radii of gyration with respect to centroid coordinate system.
X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M)
Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M)
Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M)
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.