Rhino.Display.DisplayModeDescription.GetDisplayModes
Gets all display mode descriptions that Rhino currently knows about.
Returns:
Copies of all of the display mode descriptions. If you want to modify
these descriptions, you must call UpdateDisplayMode or AddDisplayMode.

Rhino.Display.DisplayModeDescription.UpdateDisplayMode(Rhino.Display.DisplayModeDescription)


Rhino.Display.DisplayModeDescription.DisplayAttributes
