Rhino.Display.Text3d.#ctor(System.String)
Constructs a new instance of Text3d.
text: Text string.

Rhino.Display.Text3d.#ctor(System.String,Rhino.Geometry.Plane,System.Double)
Constructs a new instance of Text3d.
text: Text string.
plane: 3D Plane for text.
height: Height (in units) for text.

Rhino.Display.Text3d.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Display.Text3d.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Display.Text3d.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Display.Text3d.Text
Gets or sets the text string for this Text3d object.

Rhino.Display.Text3d.TextPlane
Gets or sets the 3D aligned plane for this Text3d object.

Rhino.Display.Text3d.Height
Gets or sets the height (in units) of this Text3d object.
The height should be a positive number larger than zero.

Rhino.Display.Text3d.FontFace
Gets or sets the FontFace name.

Rhino.Display.Text3d.Bold
Gets or sets whether this Text3d object will be drawn in Bold.

Rhino.Display.Text3d.Italic
Gets or sets whether this Text3d object will be drawn in Italics.

Rhino.Display.Text3d.BoundingBox
Gets the boundingbox for this Text3d object.