Rhino.DocObjects.SurfaceObject.DuplicateSurfaceGeometry
Constructs a new deep copy of the surface geometry.
Returns: The copy of the geometry.

Rhino.DocObjects.SurfaceObject.SurfaceGeometry
Gets the surface geometry linked with this object.