Rhino.Geometry.SumSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a new sum surface by extruding a curve A along a path B.
curveA: The curve used as extrusion profile.
curveB: The curve used as path.
Returns: A new sum surface on success; null on failure.