Rhino.Display.ColorConverter.XYZ_To_RGB(System.Double,System.Double,System.Double,System.Byte@,System.Byte@,System.Byte@)
Converts XYZ space colors to RGB.
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)

Rhino.Display.ColorConverter.RGB_To_XYZ(System.Int32,System.Int32,System.Int32,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to XYZ.
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)

Rhino.Display.ColorConverter.RGB_To_HSL(System.Int32,System.Int32,System.Int32,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to HSL.
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
l: Luminance channel (0.0~1.0)

Rhino.Display.ColorConverter.HSL_To_RGB(System.Double,System.Double,System.Double,System.Byte@,System.Byte@,System.Byte@)
Converts HSL space colors to RGB.
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
l: Luminance channel (0.0~1.0)
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)

Rhino.Display.ColorConverter.RGB_To_CMY(System.Int32,System.Int32,System.Int32,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to CMY.
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)
c: Cyan channel (0.0~1.0)
m: Magenta channel (0.0~1.0)
y: Yellow channel (0.0~1.0)