Rhino.UnitSystem
Provides enumerated values for several unit systems.

Rhino.UnitSystem.None
No unit system is specified.

Rhino.UnitSystem.Angstroms
1.0e-10 meters.

Rhino.UnitSystem.Nanometers
1.0e-9 meters.

Rhino.UnitSystem.Microns
1.0e-6 meters.

Rhino.UnitSystem.Millimeters
1.0e-3 meters.

Rhino.UnitSystem.Centimeters
1.0e-2 meters.

Rhino.UnitSystem.Decimeters
1.0e-1 meters.

Rhino.UnitSystem.Meters
The base unit in the International System of Units.

Rhino.UnitSystem.Dekameters
1.0e+1 meters.

Rhino.UnitSystem.Hectometers
1.0e+2 meters.

Rhino.UnitSystem.Kilometers
1.0e+3 meters.

Rhino.UnitSystem.Megameters
1.0e+6 meters.

Rhino.UnitSystem.Gigameters
1.0e+9 meters.

Rhino.UnitSystem.Microinches
2.54e-8 meters (1.0e-6 inches).

Rhino.UnitSystem.Mils
2.54e-5 meters (0.001 inches).

Rhino.UnitSystem.Inches
0.0254 meters.

Rhino.UnitSystem.Feet
0.3048 meters (12 inches).

Rhino.UnitSystem.Yards
0.9144 meters (36 inches).

Rhino.UnitSystem.Miles
1609.344 meters (5280 feet).

Rhino.UnitSystem.PrinterPoint
Printer distance 1/72 inches (computer points).

Rhino.UnitSystem.PrinterPica
Printer distance 1/6 inches (computer picas).

Rhino.UnitSystem.NauticalMile
Terrestrial distance, 1852 meters.
Approximately 1 minute of arc on a terrestrial great circle.
See http://en.wikipedia.org/wiki/Nautical_mile .

Rhino.UnitSystem.Astronomical
Astronomical unit distance.
http://en.wikipedia.org/wiki/Astronomical_unit
1.495979e+11  // http://units.nist.gov/Pubs/SP811/appenB9.htm
An astronomical unit (au) is the mean distance from the
center of the earth to the center of the sun.

Rhino.UnitSystem.Lightyears
Light Year
http://en.wikipedia.org/wiki/Light_year
9.46073e+15 meters   http://units.nist.gov/Pubs/SP811/appenB9.htm
A light year is the distance light travels in one Julian year.
The speed of light is exactly 299792458 meters/second.
A Julian year is exactly 365.25 * 86400 seconds and is
approximately the time it takes for one earth orbit.

Rhino.UnitSystem.Parsecs
Parallax Second
http://en.wikipedia.org/wiki/Parsec
3.085678e+16 meters   http://units.nist.gov/Pubs/SP811/appenB9.htm.

Rhino.UnitSystem.CustomUnitSystem
Custom unit systems
x meters with x defined in ON_3dmUnitsAndTolerances.m_custom_unit_scale.