Rhino.Geometry.Intersect.IntersectionEvent.SurfacePointParameter(System.Double@,System.Double@)
If this instance records a Curve|Surface intersection event,
and the intersection type is point, then use this function
to get the U and V parameters on the surface where the intersection occurs.
u: Parameter on surface u direction where the intersection occurs.
v: Parameter on surface v direction where the intersection occurs.

Rhino.Geometry.Intersect.IntersectionEvent.SurfaceOverlapParameter(Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
If this instance records a Curve|Surface intersection event,
and the intersection type if overlap, then use this function
to get the U and V domains on the surface where the overlap occurs.
uDomain: Domain along surface U direction for overlap event.
vDomain: Domain along surface V direction for overlap event.

Rhino.Geometry.Intersect.IntersectionEvent.IsPoint
All curve intersection events are either a single point or an overlap.

Rhino.Geometry.Intersect.IntersectionEvent.IsOverlap
All curve intersection events are either a single point or an overlap.

Rhino.Geometry.Intersect.IntersectionEvent.PointA
Gets the point on Curve A where the intersection occured.
If the intersection type is overlap, then this will return the
start of the overlap region.

Rhino.Geometry.Intersect.IntersectionEvent.PointA2
Gets the end point of the overlap on Curve A.
If the intersection type is not overlap, this value is meaningless.

Rhino.Geometry.Intersect.IntersectionEvent.PointB
Gets the point on Curve B (or Surface B) where the intersection occured.
If the intersection type is overlap, then this will return the
start of the overlap region.

Rhino.Geometry.Intersect.IntersectionEvent.PointB2
Gets the end point of the overlap on Curve B (or Surface B).
If the intersection type is not overlap, this value is meaningless.

Rhino.Geometry.Intersect.IntersectionEvent.ParameterA
Gets the parameter on Curve A where the intersection occured.
If the intersection type is overlap, then this will return the
start of the overlap region.

Rhino.Geometry.Intersect.IntersectionEvent.ParameterB
Gets the parameter on Curve A where the intersection occured.
If the intersection type is overlap, then this will return the
start of the overlap region.

Rhino.Geometry.Intersect.IntersectionEvent.OverlapA
Gets the interval on curve A where the overlap occurs.
If the intersection type is not overlap, this value is meaningless.

Rhino.Geometry.Intersect.IntersectionEvent.OverlapB
Gets the interval on curve B where the overlap occurs.
If the intersection type is not overlap, this value is meaningless.