Rhino.UI.Localization.UnitSystemName(Rhino.UnitSystem,System.Boolean,System.Boolean,System.Boolean)
Gets localized unit system name.  Uses current application locale id.
units: The unit system.
capitalize: true if the name should be capitalized.
singular: true if the name is expressed for a singular element.
abbreviate: true if name should be the abbreviation.
Returns: The unit system name.

Rhino.UI.Localization.FormatNumber(System.Double,Rhino.UnitSystem,Rhino.UI.DistanceDisplayMode,System.Int32,System.Boolean)
Get a string version of a number in a given unit system / display mode.
x: The number to format into a string.
units: The unit system for the number.
mode: How the number should be formatted.
precision: The precision of the number.
appendUnitSystemName: Adds unit system name to the end of the number.
Returns: The formatted number.

Rhino.UI.Localization.LocalizeString(System.String,System.Int32)
Returns localized version of a given English string. This function should be autogenerated by the
RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
english: The text in English.
contextId: The context ID.
Returns: The localized string.

Rhino.UI.Localization.LocalizeString(System.String,System.Object,System.Int32)
Returns localized version of a given English string. This function should be autogenerated by the
RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
english: The text in English.
assemblyOrObject: An assembly or an object from an assembly.
contextId: The context ID.
Returns: The localized string.

Rhino.UI.Localization.GetAssemblyFromObject(System.Object)
Check to see if the passed object is an assembly, if not then get the assembly that owns the object type.
assemblyOrObject: An assembly or an object from an assembly.
Returns: The localized string.

Rhino.UI.Localization.LocalizeCommandName(System.String)
Commands that need to be localized should call this function.
The localized command name.

Rhino.UI.Localization.LocalizeForm(System.Windows.Forms.Control)
A form or user control should call this in its constructor if it wants to be localized
the typical constructor for a localize form would look like:
MyForm::MyForm()
{
SuspendLayout();
InitializeComponent();
Rhino.UI.Localize.LocalizeForm( this );
ResumeLayout(true);
}

Rhino.UI.Localization.LocalizeToolStripItemCollection(System.Windows.Forms.Control,System.Windows.Forms.ToolStripItemCollection)
A form or user control should call this in its constructor if it wants to localize
context menus that are set on the fly and not assigned to a forms control in design
studio.
MyForm::MyForm()
{
SuspendLayout();
InitializeComponent();
Rhino.UI.Localize.LocalizeToolStripItemCollection( this, this.MyToolStrip.Items );
}

Rhino.UI.Localization.SetLanguageId(System.Int32)
Sets the Id used for Localization in RhinoCommon.  Only useful for when
using RhinoCommon outside of the Rhino process
id:
Returns: true if the language id could be set