Rhino.PersistentSettingsManager.Create(System.Guid)
pluginId:
Returns:

Rhino.PersistentSettingsManager.Create(Rhino.PlugIns.PlugIn)
plugin:
Returns:

Rhino.PersistentSettingsManager.Create(Rhino.Runtime.Skin)
skin:
Returns:

Rhino.PersistentSettingsManager.WriteSettings
If they exist and contain modified values write global settings first then local settings.
Returns: Returns true if local settings were successfully written.