Rhino.FileIO.File3dmSettings
Contains settings used within the whole 3dm file.

Rhino.FileIO.File3dmSettings.ModelUrl
Gets or sets a Uniform Resource Locator (URL) direction for the model.

Rhino.FileIO.File3dmSettings.ModelBasepoint
Gets or sets the model basepoint that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.

Rhino.FileIO.File3dmSettings.ModelAbsoluteTolerance
Gets or sets the model space absolute tolerance.

Rhino.FileIO.File3dmSettings.ModelAngleToleranceRadians
Gets or sets the model space angle tolerance.

Rhino.FileIO.File3dmSettings.ModelAngleToleranceDegrees
Gets or sets the model space angle tolerance.

Rhino.FileIO.File3dmSettings.ModelRelativeTolerance
Gets or sets the model space relative tolerance.

Rhino.FileIO.File3dmSettings.PageAbsoluteTolerance
Gets or sets the page space absolute tolerance.

Rhino.FileIO.File3dmSettings.PageAngleToleranceRadians
Gets or sets the page space angle tolerance.

Rhino.FileIO.File3dmSettings.PageAngleToleranceDegrees
Gets or sets the page space angle tolerance.

Rhino.FileIO.File3dmSettings.PageRelativeTolerance
Gets or sets the page space relative tolerance.

Rhino.FileIO.File3dmSettings.ModelUnitSystem
Gets or sets the model unit system, using Rhino.UnitSystem enumeration.

Rhino.FileIO.File3dmSettings.PageUnitSystem
Gets or sets the page unit system, using Rhino.UnitSystem enumeration.