Rhino.Geometry.Cone.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new cone with a specified base plane, height and radius.
plane: Base plane of cone.
height: Height of cone.
radius: Radius of cone.

Rhino.Geometry.Cone.AngleInRadians
Computes the angle (in radians) between the axis and the
side of the cone.
The angle and the height have the same sign.
Returns: Math.Atan(Radius / Height) if the height is not 0; 0 if the radius is 0; Math.PI otherwise.

Rhino.Geometry.Cone.AngleInDegrees
Computes the angle (in degrees) between the axis and the
side of the cone.
The angle and the height have the same sign.
Returns: An angle in degrees.

Rhino.Geometry.Cone.ToNurbsSurface
Constructs a Nurbs surface representation of this Cone.
This is synonymous with calling NurbsSurface.CreateFromCone().
Returns: A Nurbs surface representation of the cone or null.

Rhino.Geometry.Cone.ToRevSurface
Constructs a RevSurface representation of this Cone.
This is synonymous with calling RevSurface.CreateFromCone().
Returns: A RevSurface representation of the cone or null.

Rhino.Geometry.Cone.ToBrep(System.Boolean)
Gets a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
capBottom: true if the bottom should be filled with a surface. false otherwise.
Returns: A brep (polysurface) representation of this cone values.

Rhino.Geometry.Cone.Unset
Gets an invalid Cone.

Rhino.Geometry.Cone.Plane
Gets or sets the base plane of the cone.

Rhino.Geometry.Cone.Height
Gets or sets the height of the circular right cone.

Rhino.Geometry.Cone.Radius
Gets or sets the radius of the cone.

Rhino.Geometry.Cone.IsValid
true if plane is valid, height is not zero and radius is not zero.

Rhino.Geometry.Cone.BasePoint
Center of base circle.

Rhino.Geometry.Cone.ApexPoint
Point at tip of the cone.

Rhino.Geometry.Cone.Axis
Unit vector axis of cone.