Rhino.Display.ColorLAB.#ctor(System.Drawing.Color)
Constructs a new instance of ColorLAB that is equivalent to an RGB color.
rgb: RGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorLAB with custom channel values.

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorLAB with custom channel values.

Rhino.Display.ColorLAB.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest LAB equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The LAB equivalent of the HSL color.

Rhino.Display.ColorLAB.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest LAB equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The LAB equivalent of the CMYK color.

Rhino.Display.ColorLAB.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest LAB equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The LAB equivalent of the XYZ color.

Rhino.Display.ColorLAB.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest LAB equivalent of an LCH color.
lch: Target color in LCH space.
Returns: The LAB equivalent of the LCH color.

Rhino.Display.ColorLAB.L
Gets or sets the lightness channel. The channel is limited to 0~1.

Rhino.Display.ColorLAB.A
Gets or sets the Base channel. The channel is limited to 0~1.

Rhino.Display.ColorLAB.B
Gets or sets the Opponent channel. The channel is limited to 0~1.

Rhino.Display.ColorLAB.Alpha
Gets or sets the Alpha channel. The channel is limited to 0~1.