Rhino.UI.StackedDialogPage
Provides a base class to inherit from for the addition of stacked dialog pages.

Rhino.UI.StackedDialogPage.OnApply
Called when stacked dialog OK button is pressed.
Returns:
If return value is true then the dialog will be closed. A return of false means
there was an error and dialog remains open so page can be properly updated.

Rhino.UI.StackedDialogPage.OnCancel
Called when stacked dialog Cancel button is pressed.

Rhino.UI.StackedDialogPage.OnActivate(System.Boolean)
Called when this page is activated/deactivated.
active: If true then this page is on top otherwise it is about to be hidden.
Returns:
If true then the page is hidden and the requested page is not
activated otherwise will not allow you to change the current page.
Default returns true

Rhino.UI.StackedDialogPage.OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).

Rhino.UI.StackedDialogPage.PageControl
Return the control that represents this page. This will typically be a custom user control.

Rhino.UI.StackedDialogPage.ShowDefaultsButton
Called when this page is activated.
Returns:
true  : if the page wants the "Defaults" button to appear.
false : if the page does not want the "Defaults" button to appear.
Default returns false
Note: returning false implies that OnDefaults() method will never get called.