Rhino.Commands.SelCommand
For adding nestable selection commands that work like the native Rhino
SelCrv command, derive your command from SelCommand and override the
virtual SelFilter function.

Rhino.Commands.SelCommand.SelFilter(Rhino.DocObjects.RhinoObject)
Override this virtual function and return true if object should be selected.
rhObj: The object to check regarding selection status.
Returns: true if the object should be selected; false otherwise.