Rhino.Geometry.Point2d.#ctor(System.Double,System.Double)
Initializes a new instance of Rhino.Geometry.Point2d from coordinates.
x: The X (first) coordinate.
y: The Y (second) coordinate.

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Vector2d)
Initializes a new instance of Rhino.Geometry.Point2d by converting a vector.
vector: The vector that will be copied.

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Point2d)
Initializes a new instance of Rhino.Geometry.Point2d by copying another Rhino.Geometry.Point2d.
point: The point that will be copied.

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Point3d)
Initializes a new instance of Rhino.Geometry.Point3d by copying the first two coordiantes of a Rhino.Geometry.Point3d.
point: The point that will be used: the Z (third) coordinate is discarded.

Rhino.Geometry.Point2d.op_Multiply(Rhino.Geometry.Point2d,System.Double)
Multiplies a Rhino.Geometry.Point2d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point2d.Multiply(Rhino.Geometry.Point2d,System.Double)
Multiplies a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point2d.op_Multiply(System.Double,Rhino.Geometry.Point2d)
Multiplies a Rhino.Geometry.Point2d by a number.
t: A number.
point: A point.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point2d.Multiply(System.Double,Rhino.Geometry.Point2d)
Multiplies a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
t: A number.
point: A point.
Returns: A new point that is coordinatewise multiplied by t.

Rhino.Geometry.Point2d.op_Division(Rhino.Geometry.Point2d,System.Double)
Divides a Rhino.Geometry.Point2d by a number.
t: A number.
point: A point.
Returns: A new point that is coordinatewise divided by t.

Rhino.Geometry.Point2d.Divide(Rhino.Geometry.Point2d,System.Double)
Divides a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinatewise divided by t.

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Adds a point with a vector.
point: A point.
vector: A vector.
Returns: A new point that is coordinatewise summed with the vector.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that is coordinatewise summed with the vector.

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d)
Adds a vector with a point.
vector: A vector.
point: A point.
Returns: A new point that is coordinatewise summed with the vector.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d)
Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that is coordinatewise summed with the vector.

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Adds a point with a point.
point1: A point.
point2: A point.
Returns: A new point that is coordinatewise summed with the other point.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point1: A point.
point2: A point.
Returns: A new point that is coordinatewise summed with the other point.

Rhino.Geometry.Point2d.op_Subtraction(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Subtracts a vector from a point.
point: A point.
vector: A vector.
Returns: A new point that is coordinatewise subtracted by vector.

Rhino.Geometry.Point2d.Subtract(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that is coordinatewise subtracted by vector.

Rhino.Geometry.Point2d.op_Subtraction(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Subtracts point2 from point1.
point1: A point (minuend).
point2: A point (subtrahend).
Returns: A new vector that is point1 coordinatewise subtracted by point2.

Rhino.Geometry.Point2d.Subtract(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: A point (minuend).
point2: A point (subtrahend).
Returns: A new vector that is point1 coordinatewise subtracted by point2.

Rhino.Geometry.Point2d.op_Equality(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether two Rhino.Geometry.Point2d have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.

Rhino.Geometry.Point2d.op_Inequality(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether two Rhino.Geometry.Point2d have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.

Rhino.Geometry.Point2d.op_LessThan(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.

Rhino.Geometry.Point2d.op_LessThanOrEqual(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified point comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.

Rhino.Geometry.Point2d.op_GreaterThan(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified Rhino.Geometry.Point2d comes after
(has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.

Rhino.Geometry.Point2d.op_GreaterThanOrEqual(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified Rhino.Geometry.Point2d comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.

Rhino.Geometry.Point2d.Equals(Rhino.Geometry.Point2d)
Determines whether the specified Point2d has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.

Rhino.Geometry.Point2d.CompareTo(Rhino.Geometry.Point2d)
Compares this Rhino.Geometry.Point2d with another Rhino.Geometry.Point2d.
Coordinates evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Point2d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.

Rhino.Geometry.Point2d.DistanceTo(Rhino.Geometry.Point2d)
Computes the distance between two points.
other: Another point.
Returns: The length of the line between the two points, or 0 if either point is invalid.

Rhino.Geometry.Point2d.X
Gets or sets the X (first) coordinate of the point.

Rhino.Geometry.Point2d.Y
Gets or sets the Y (second) coordinate of the point.

Rhino.Geometry.Point2d.IsValid
If any coordinate of a point is UnsetValue, then the point is not valid.

Rhino.Geometry.Point2d.MinimumCoordinate
Gets the smallest (both positive and negative) valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.

Rhino.Geometry.Point2d.MaximumCoordinate
Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.

Rhino.Geometry.Point2d.Origin
Gets a point at 0,0.

Rhino.Geometry.Point2d.Unset
Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.