Rhino.DocObjects.ViewInfo.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.DocObjects.ViewInfo.Name
Gets or sets the name of the NamedView.

Rhino.DocObjects.ViewInfo.Viewport
Gets the viewport, or viewing frustum, associated with this view.