Rhino.Geometry.Point.#ctor(Rhino.Geometry.Point3d)
Initializes a new point instance with a location.
location: A position in 3D space.

Rhino.Geometry.Point.Location
Gets or sets the location (position) of this point.