Rhino.Geometry.BrepEdge.IsSmoothManifoldEdge(System.Double)
For a manifold, non-boundary edge, decides whether or not the two surfaces
on either side meet smoothly.
angleToleranceRadians:
used to decide if surface normals on either side are parallel.
Returns:
true if edge is manifold, has exactly 2 trims, and surface normals on either
side agree to within angle_tolerance.

Rhino.Geometry.BrepEdge.AdjacentFaces
Gets the indices of all the BrepFaces that use this edge.

Rhino.Geometry.BrepEdge.Tolerance
Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue)
A value of UnsetValue indicates that the tolerance should be computed.
The maximum distance from the edge's 3d curve to any surface of a face
that has this edge as a portion of its boundary must be <= this tolerance.

Rhino.Geometry.BrepEdge.TrimCount
Gets the number of trim-curves that use this edge.

Rhino.Geometry.BrepEdge.Valence
Gets the topological valency of this edge. The topological valency
is defined by how many adjacent faces share this edge.

Rhino.Geometry.BrepEdge.Brep
Gets the Brep that owns this edge.

Rhino.Geometry.BrepEdge.EdgeIndex
Gets the index of this edge in the Brep.Edges collection.