Rhino.Geometry.SweepTwoRail
Utility class for generating breps by sweeping cross section curves over
two rail curves.

Rhino.Geometry.SweepTwoRail.ClosedSweep
If the input rails are closed, ClosedSweep determines if the swept breps
will also be closed.