Rhino.Geometry.IsoStatus
Defines enumerated values for isoparametric curve direction on a surface, such as X or Y,
and curve sides, such as North or West boundary.
Note: odd values are all x-constant; even values > 0 are all y-constant.

Rhino.Geometry.IsoStatus.None
curve is not an isoparameteric curve.