Rhino.Geometry.Collections.MeshTextureCoordinateList.Clear
Clears the Texture Coordinate list on the mesh.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Add(System.Single,System.Single)
Adds a new texture coordinate to the end of the Texture list.
s: S component of new texture coordinate.
t: T component of new texture coordinate.
Returns: The index of the newly added texture coordinate.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Add(System.Double,System.Double)
Adds a new texture coordinate to the end of the Texture list.
s: S component of new texture coordinate.
t: T component of new texture coordinate.
Returns: The index of the newly added texture coordinate.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Add(Rhino.Geometry.Point2f)
Adds a new texture coordinate to the end of the Texture list.
tc: Texture coordinate to add.
Returns: The index of the newly added texture coordinate.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Add(Rhino.Geometry.Point3d)
Adds a new texture coordinate to the end of the Texture list.
tc: Texture coordinate to add.
Returns: The index of the newly added texture coordinate.

Rhino.Geometry.Collections.MeshTextureCoordinateList.AddRange(Rhino.Geometry.Point2f[])
Appends an array of texture coordinates.
textureCoordinates: Texture coordinates to append.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,System.Single,System.Single)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
s: S component of texture coordinate.
t: T component of texture coordinate.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,System.Double,System.Double)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
s: S component of texture coordinate.
t: T component of texture coordinate.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,Rhino.Geometry.Point2f)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
tc: Texture coordinate point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinate(System.Int32,Rhino.Geometry.Point3f)
Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
index: Index of texture coordinate to set.
tc: Texture coordinate point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinates(Rhino.Geometry.Point2f[])
Sets all texture coordinates in one go.
textureCoordinates: Texture coordinates to assign to the mesh.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.SetTextureCoordinates(Rhino.Render.TextureMapping)
Set all texture coordinates based on a texture mapping function
mapping: The new mapping type.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.NormalizeTextureCoordinates
Scales the texture coordinates so the texture domains are [0,1]
and eliminate any texture rotations.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.TransposeTextureCoordinates
Transposes texture coordinates.
The region of the bitmap the texture uses does not change.
All texture coordinates rows (Us) become columns (Vs), and vice versa.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshTextureCoordinateList.ReverseTextureCoordinates(System.Int32)
Reverses one coordinate direction of the texture coordinates.
The region of the bitmap the texture uses does not change.
Either Us or Vs direction is flipped.
direction:
0 = first texture coordinate is reversed.
1 = second texture coordinate is reversed.
Returns: true if operation succeeded; otherwise, false.

Rhino.Geometry.Collections.MeshTextureCoordinateList.GetEnumerator
Gets an enumerator that yields all texture coordinates in this collection.
Returns: The enumerator.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Count
Gets or sets the number of texture coordinates.