Rhino.Geometry.Ray3d.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Initializes a new Ray3d instance.
position: The position.
direction: The direction.

Rhino.Geometry.Ray3d.PointAt(System.Double)
Evaluates a point along the ray.
t: The t parameter.
Returns: A point at (Direction*t + Position).

Rhino.Geometry.Ray3d.op_Equality(Rhino.Geometry.Ray3d,Rhino.Geometry.Ray3d)
Determines whether two Rhino.Geometry.Ray3d have equal values.
a: The first Rhino.Geometry.Ray3d.
b: The second Rhino.Geometry.Ray3d.
Returns: true if position and direction of the two rays are equal; otherwise false.

Rhino.Geometry.Ray3d.op_Inequality(Rhino.Geometry.Ray3d,Rhino.Geometry.Ray3d)
Determines whether two Rhino.Geometry.Ray3d have different values.
a: The first Rhino.Geometry.Ray3d.
b: The second Rhino.Geometry.Ray3d.
Returns: true if position or direction (or both) in the two rays are different; otherwise false.

Rhino.Geometry.Ray3d.Equals(Rhino.Geometry.Ray3d)
Determines whether the specified Ray3d has the same value as the present ray.
ray: The specified ray.
Returns: true if ray has the same position and direction as this; otherwise false.

Rhino.Geometry.Ray3d.GetHashCode
Computes a hashing number that represents the current ray.
Returns: A signed integer that represents both postion and direction, but is not unique.

Rhino.Geometry.Ray3d.Position
Gets the starting position of this ray.

Rhino.Geometry.Ray3d.Direction
Gets the direction vector of this ray.