Rhino.UI.OpenFileDialog.#ctor
Create a new open file dialog.

Rhino.UI.OpenFileDialog.ShowDialog
Show the actual dialog to allow the user to select a file.

Rhino.UI.OpenFileDialog.DefaultExt
The default file name extension. The returned string does not include the period.

Rhino.UI.OpenFileDialog.FileName
Gets or sets a string containing the file name selected in the file dialog box.

Rhino.UI.OpenFileDialog.Title
Gets or sets the file dialog box title.

Rhino.UI.OpenFileDialog.Filter
Gets or sets the current file name filter string, which determines
the choices that appear in the "Save as file type" or "Files of type"
box in the dialog box. See System.Windows.Forms.FileDialog for details.

Rhino.UI.OpenFileDialog.InitialDirectory
Gets or sets the initial directory displayed by the file dialog box.

Rhino.UI.OpenFileDialog.MultiSelect
Gets or sets a value indicating whether the dialog box allows multiple files to be selected

Rhino.UI.OpenFileDialog.FileNames
Gets the names of all of the selected files in the dialog box