Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate (Count must be >= 2)
Returns: interpolated curve on success. null on failure.

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
Returns: interpolated curve on success. null on failure.

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
startTangent: A starting tangent.
endTangent: An ending tangent.
Returns: interpolated curve on success. null on failure.

Rhino.Geometry.Curve.CreateFittedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double)
-
points: -
degree: -
startTangent: -
endTangent: -
fittingTolerance: -
Returns: -

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Constructs a curve from a set of control-point locations.
points: Control points.
degree: Degree of curve. The number of control points must be at least degree+1.

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a control-point of degree=3 (or less).
points: Control points of curve.

Rhino.Geometry.Curve.CreateMeanCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Constructs a mean, or average, curve from two curves.
curveA: A first curve.
curveB: A second curve.
angleToleranceRadians:
The angle tolerance, in radians, used to match kinks between curves.
If you are unsure how to set this parameter, then either use the
document's angle tolerance RhinoDoc.AngleToleranceRadians,
or the default value (RhinoMath.UnsetValue)
Returns: The average curve, or null on error.
Throws System.ArgumentNullException: If curveA or curveB are null.

Rhino.Geometry.Curve.CreateMeanCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a mean, or average, curve from two curves.
curveA: A first curve.
curveB: A second curve.
Returns: The average curve, or null on error.
Throws System.ArgumentNullException: If curveA or curveB are null.

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.BlendContinuity)
Create a Blend curve between two existing curves.
curveA: Curve to blend from (blending will occur at curve end point).
curveB: Curve to blend to (blending will occur at curve start point).
continuity: Continuity of blend.
Returns: A curve representing the blend between A and B or null on failure.

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.BlendContinuity,System.Double,System.Double)
Create a Blend curve between two existing curves.
curveA: Curve to blend from (blending will occur at curve end point).
curveB: Curve to blend to (blending will occur at curve start point).
continuity: Continuity of blend.
bulgeA: Bulge factor at curveA end of blend. Values near 1.0 work best.
bulgeB: Bulge factor at curveB end of blend. Values near 1.0 work best.
Returns: A curve representing the blend between A and B or null on failure.

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Joins a collection of curve segments together.
inputCurves: Curve segments to join.
Returns: An array of curves which contains.

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
Returns: An array of joint curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve startpoints.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
Returns: An array of joint curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.

Rhino.Geometry.Curve.MakeEndsMeet(Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.Curve,System.Boolean)
Makes adjustments to the ends of one or both input curves so that they meet at a point.
curveA: 1st curve to adjust.
adjustStartCurveA:
Which end of the 1st curve to adjust: true is start, false is end.
curveB: 2nd curve to adjust.
adjustStartCurveB:
which end of the 2nd curve to adjust true==start, false==end.
Returns: true on success.

Rhino.Geometry.Curve.GetFilletPoints(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Double@,System.Double@,Rhino.Geometry.Plane@)
Finds points at which to cut a pair of curves so that a fillet of given radius can be inserted.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter value for base point on curve0.
t1Base: Parameter value for base point on curve1.
t0: Parameter value of fillet point on curve 0.
t1: Parameter value of fillet point on curve 1.
filletPlane:
The fillet is contained in this plane with the fillet center at the plane origin.
Returns: true on success, false on failure.
Remarks:
A fillet point is a pair of curve parameters (t0,t1) such that there is a circle
of radius point3 tangent to curve c0 at t0 and tangent to curve c1 at t1. Of all possible
fillet points this function returns the one which is the closest to the base point
t0Base, t1Base. Distance from the base point is measured by the sum of arc lengths
along the two curves.

Rhino.Geometry.Curve.CreateFillet(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Computes the fillet arc for a curve filleting operation.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter on curve0 where the fillet ought to start (approximately).
t1Base: Parameter on curve1 where the fillet ought to end (approximately).
Returns: The fillet arc on success, or Arc.Unset on failure.

Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean union of two or more closed, planar curves.
Note, curves must be co-planar.
curves: The co-planar curves to union.
Returns: Result curves on success, empty array if no union could be calculated.

Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean intersection of two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, empty array if no intersection could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean difference between two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, empty array if no difference could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean difference between a closed planar curve, and a list of closed planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
subtractors: curves to subtract from the first closed curve.
Returns: Result curves on success, empty array if no difference could be calculated.

Rhino.Geometry.Curve.DoDirectionsMatch(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Determines whether two curves travel more or less in the same direction.
curveA: First curve to test.
curveB: Second curve to test.
Returns: true if both curves more or less point in the same direction,
false if they point in the opposite directions.

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,Rhino.Geometry.Mesh,Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a mesh using a direction and tolerance.
curve: A curve.
mesh: A mesh.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curve: A curve.
meshes: A list, an array or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.

Rhino.Geometry.Curve.ProjectToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curves: A list, an array or any enumerable of curves.
meshes: A list, an array or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,Rhino.Geometry.Vector3d,System.Double)
Projects a Curve onto a Brep along a given direction.
curve: Curve to project.
brep: Brep to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Projects a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@)
Projects a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
brepIndices: (out) Integers that identify for each resulting curve which Brep it was projected onto.
Returns: An array of projected curves or null if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Projects a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@,System.Int32[]@)
Projects a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
curveIndices: Index of which curve in the input list was the source for a curve in the return array.
brepIndices: Index of which brep was used to generate a curve in the return array.
Returns: An array of projected curves. Array is empty if the projection set is empty.

Rhino.Geometry.Curve.ProjectToPlane(Rhino.Geometry.Curve,Rhino.Geometry.Plane)
Constructs a curve by projecting an existing curve to a plane.
curve: A curve.
plane: A plane.
Returns: The projected curve on success; null on failure.

Rhino.Geometry.Curve.PullToBrepFace(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double)
Pull a curve to a BrepFace using closest point projection.
curve: Curve to pull.
face: Brepface that pulls.
tolerance: Tolerance to use for pulling.
Returns: An array of pulled curves, or an empty array on failure.

Rhino.Geometry.Curve.GetDistancesBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Computes the distance between two arbitrary curves.
curveA: A curve.
curveB: Another curve.
tolerance: A tolerance value.
maxDistance: The maximum distance value. This is an out reference argument.
maxDistanceParameterA: The maximum distance parameter on curve A. This is an out reference argument.
maxDistanceParameterB: The maximum distance parameter on curve B. This is an out reference argument.
minDistance: The minimum distance value. This is an out reference argument.
minDistanceParameterA: The minimum distance parameter on curve A. This is an out reference argument.
minDistanceParameterB: The minimum distance parameter on curve B. This is an out reference argument.
Returns: true if the operation succeeded; otherwise false.

Rhino.Geometry.Curve.PlanarClosedCurveRelationship(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines whether two coplanar simple closed curves are disjoint or intersect;
otherwise, if the regions have a containment relationship, discovers
which curve encloses the other.
curveA: A first curve.
curveB: A second curve.
testPlane: A plane.
tolerance: A tolerance value.
Returns:
A value indicating the relationship between the first and the second curve.

Rhino.Geometry.Curve.PlanarCurveCollision(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines if tro coplanar curves collide (intersect).
curveA: A curve.
curveB: Another curve.
testPlane: A valid plane containing the curves.
tolerance: A tolerance value for intersection.
Returns: true if the curves intersect, otherwise false

Rhino.Geometry.Curve.Duplicate
Constructs an exact duplicate of this Curve.
Rhino.Geometry.Curve.DuplicateCurve

Rhino.Geometry.Curve.DuplicateCurve
Constructs an exact duplicate of this curve.
Returns: An exact copy of this curve.

Rhino.Geometry.Curve.NonConstOperation
For derived classes implementers.
Defines the necessary implementation to free the instance from being const.

Rhino.Geometry.Curve.ChangeDimension(System.Int32)
Changes the dimension of a curve.
desiredDimension: The desired dimension.
Returns:
true if the curve's dimension was already desiredDimension
or if the curve's dimension was successfully changed to desiredDimension;
otherwise false.

Rhino.Geometry.Curve.IsLinear
Test a curve to see if it is linear to within RhinoMath.ZeroTolerance units (1e-12).
Returns: true if the curve is linear.

Rhino.Geometry.Curve.IsLinear(System.Double)
Test a curve to see if it is linear to within the custom tolerance.
tolerance: Tolerance to use when checking linearity.
Returns:
true if the ends of the curve are farther than tolerance apart
and the maximum distance from any point on the curve to
the line segment connecting the curve ends is <= tolerance.

Rhino.Geometry.Curve.IsPolyline
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
Returns: true if this curve can be represented as a polyline; otherwise, false.

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
Returns: true if this curve can be represented as a polyline; otherwise, false.

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@,System.Double[]@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
parameters:
if true is returned, then the parameters of the polyline
points are returned here.
Returns: true if this curve can be represented as a polyline; otherwise, false.

Rhino.Geometry.Curve.IsArc
Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
Returns:
true if the curve can be represented by an arc or a circle within tolerance.

Rhino.Geometry.Curve.IsArc(System.Double)
Test a curve to see if it can be represented by an arc or circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
true if the curve can be represented by an arc or a circle within tolerance.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
arc: On success, the Arc will be filled in.
Returns: true if the curve could be converted into an arc.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an arc.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
Returns: true if the curve could be converted into an arc within the given plane.

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an arc within the given plane.

Rhino.Geometry.Curve.IsCircle
Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
Returns:
true if the Curve can be represented by a circle within tolerance.

Rhino.Geometry.Curve.IsCircle(System.Double)
Test a curve to see if it can be represented by a circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
true if the curve can be represented by a circle to within tolerance.

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@)
Try to convert this curve into a circle using RhinoMath.ZeroTolerance.
circle: On success, the Circle will be filled in.
Returns: true if the curve could be converted into a Circle.

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@,System.Double)
Try to convert this curve into a Circle using a custom tolerance.
circle: On success, the Circle will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into a Circle within tolerance.

Rhino.Geometry.Curve.IsEllipse
Test a curve to see if it can be represented by an ellipse within RhinoMath.ZeroTolerance.
Returns:
true if the Curve can be represented by an ellipse within tolerance.

Rhino.Geometry.Curve.IsEllipse(System.Double)
Test a curve to see if it can be represented by an ellipse within a given tolerance.
tolerance: Tolerance to use for checking.
Returns:
true if the Curve can be represented by an ellipse within tolerance.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
ellipse: On success, the Ellipse will be filled in.
Returns: true if the curve could be converted into an Ellipse.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an Ellipse.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
Returns: true if the curve could be converted into an Ellipse within the given plane.

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an Ellipse within the given plane.

Rhino.Geometry.Curve.IsPlanar
Test a curve for planarity.
Returns:
true if the curve is planar (flat) to within RhinoMath.ZeroTolerance units (1e-12).

Rhino.Geometry.Curve.IsPlanar(System.Double)
Test a curve for planarity.
tolerance: Tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= RhinoMath.ZeroTolerance.

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@,System.Double)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
tolerance: Tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
Returns:
true if the maximum distance from the curve to the testPlane is <= RhinoMath.ZeroTolerance.

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane,System.Double)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
tolerance: Tolerance to use when checking.
Returns:
true if the maximum distance from the curve to the testPlane is <= tolerance.

Rhino.Geometry.Curve.ChangeClosedCurveSeam(System.Double)
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
t:
Curve parameter of new start/end point. The returned curves domain will start at t.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.IsClosable(System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return false.
Returns: true if start and end points are close enough based on above conditions.

Rhino.Geometry.Curve.IsClosable(System.Double,System.Double,System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return false.
minimumAbsoluteSize:
If greater than 0.0 and none of the interior sampled points are at
least minimumAbsoluteSize from start, this function will return false.
minimumRelativeSize:
If greater than 1.0 and chord length is less than
minimumRelativeSize*gap, this function will return false.
Returns: true if start and end points are close enough based on above conditions.

Rhino.Geometry.Curve.MakeClosed(System.Double)
If IsClosed, just return true. Otherwise, decide if curve can be closed as
follows: Linear curves polylinear curves with 2 segments, Nurbs with 3 or less
control points cannot be made closed. Also, if tolerance > 0 and the gap between
start and end is larger than tolerance, curve cannot be made closed.
Adjust the curve's endpoint to match its start point.
tolerance:
If nonzero, and the gap is more than tolerance, curve cannot be made closed.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Vector3d)
Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane.
Only works with simple (no self intersections) closed planar curves.
upDirection: A vector that is considered "up".
Returns: The orientation of this curve with respect to a defined up direction.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Plane)
Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane.
Only works with simple (no self intersections) closed planar curves.
plane:
The plane in which to solve the orientation.
Returns: The orientation of this curve in the given plane.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Transform)
Determines the orientation (counterclockwise or clockwise) of a closed planar curve.
Only works with simple (no self intersections) closed planar curves.
xform:
Transformation to map the curve to the xy plane. If the curve is parallel
to the xy plane, you may pass Identity matrix.
Returns: The orientation of this curve in the world xy-plane.

Rhino.Geometry.Curve.Reverse
Reverses the direction of the curve.
Returns: true on success, false on failure.
Remarks: If reversed, the domain changes from [a,b] to [-b,-a]

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@)
Finds parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to search from.
t: Parameter of local closest point.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double)
Finds the parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to project.
t: parameter of local closest point returned here.
maximumDistance: The maximum allowed distance.
Past this distance, the search is given up and false is returned.
Use 0 to turn off this parameter.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
Both curve and point are projected to the World XY plane.
testPoint: Point to test.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in in which to compare point and region.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane,System.Double)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in in which to compare point and region.
tolerance: Tolerance to use during comparison.
Returns: Relationship between point and curve region.

Rhino.Geometry.Curve.PointAt(System.Double)
Evaluates point at a curve parameter.
t: Evaluation parameter.
Returns: Point (location of curve at the parameter t).
Remarks: No error handling.

Rhino.Geometry.Curve.PointAtLength(System.Double)
Gets a point at a certain length along the curve. The length must be
non-negative and less than or equal to the length of the curve.
Lengths will not be wrapped when the curve is closed or periodic.
length: Length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified length from the start point or Poin3d.Unset on failure.

Rhino.Geometry.Curve.PointAtNormalizedLength(System.Double)
Gets a point at a certain normalized length along the curve. The length must be
between or including 0.0 and 1.0, where 0.0 equals the start of the curve and
1.0 equals the end of the curve.
length: Normalized length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified normalized length from the start point or Poin3d.Unset on failure.

Rhino.Geometry.Curve.SetStartPoint(Rhino.Geometry.Point3d)
Forces the curve to start at a specified point.
Not all curve types support this operation.
point: New start point of curve.
Returns: true on success, false on failure.
Remarks: Some start points cannot be moved. Be sure to check return code.

Rhino.Geometry.Curve.SetEndPoint(Rhino.Geometry.Point3d)
Forces the curve to end at a specified point.
Not all curve types support this operation.
point: New end point of curve.
Returns: true on success, false on failure.
Remarks: Some end points cannot be moved. Be sure to check return code

Rhino.Geometry.Curve.TangentAt(System.Double)
Evaluates the unit tangent vector at a curve parameter.
t: Evaluation parameter.
Returns: Unit tangent vector of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.Curve.FrameAt(System.Double,Rhino.Geometry.Plane@)
Returns a 3d frame at a parameter.
t: Evaluation parameter.
plane: The frame is returned here.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.DerivativeAt(System.Double,System.Int32)
Evaluate the derivatives at the specified curve parameter.
t: Curve parameter to evaluate.
derivativeCount: Number of derivatives to evaluate, must be at least 0.
Returns: An array of vectors that represents all the derivatives starting at zero.

Rhino.Geometry.Curve.DerivativeAt(System.Double,System.Int32,Rhino.Geometry.CurveEvaluationSide)
Evaluate the derivatives at the specified curve parameter.
t: Curve parameter to evaluate.
derivativeCount: Number of derivatives to evaluate, must be at least 0.
side: Side of parameter to evaluate. If the parameter is at a kink,
it makes a big difference whether the evaluation is from below or above.
Returns: An array of vectors that represents all the derivatives starting at zero.

Rhino.Geometry.Curve.CurvatureAt(System.Double)
Evaluate the curvature vector at a curve parameter.
t: Evaluation parameter.
Returns: Curvature vector of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.Curve.PerpendicularFrameAt(System.Double,Rhino.Geometry.Plane@)
Return a 3d frame at a parameter. This is slightly different than FrameAt in
that the frame is computed in a way so there is minimal rotation from one
frame to the next.
t: Evaluation parameter.
plane: The frame is returned here.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.GetPerpendicularFrames(System.Collections.Generic.IEnumerable{System.Double})
Gets a collection of perpendicular frames along the curve. Perpendicular frames
are also known as 'Zero-twisting frames' and they minimize rotation from one frame to the next.
parameters: A collection of strictly increasing curve parameters to place perpendicular frames on.
Returns: An array of perpendicular frames on success or null on failure.
Throws System.InvalidOperationException: Thrown when the curve parameters are not increasing.

Rhino.Geometry.Curve.IsContinuous(Rhino.Geometry.Continuity,System.Double)
Test continuity at a curve parameter value.
continuityType: Type of continuity to test for.
t: Parameter to test.
Returns:
true if the curve has at least the c type continuity at the parameter t.

Rhino.Geometry.Curve.GetNextDiscontinuity(Rhino.Geometry.Continuity,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
continuityType: Type of continuity to search for.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it
possible to repeatedly call GetNextDiscontinuity() and step through the discontinuities.
t1:
(t0 != t1)  If there is a discontinuity at t1 it will be ignored unless continuityType is
a locus discontinuity type and t1 is at the start or end of the curve.
t: If a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that
all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end
of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the
ends of their domains.  All closed curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.

Rhino.Geometry.Curve.GetLength
Gets the length of the curve with a fractional tolerance of 1.0e-8.
Returns: The length of the curve on success, or zero on failure.

Rhino.Geometry.Curve.GetLength(System.Double)
Get the length of the curve.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: The length of the curve on success, or zero on failure.

Rhino.Geometry.Curve.GetLength(Rhino.Geometry.Interval)
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
subdomain:
The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Returns: The length of the sub-curve on success, or zero on failure.

Rhino.Geometry.Curve.GetLength(System.Double,Rhino.Geometry.Interval)
Get the length of a sub-section of the curve.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Returns: The length of the sub-curve on success, or zero on failure.

Rhino.Geometry.Curve.IsShort(System.Double)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
Returns: true if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.

Rhino.Geometry.Curve.IsShort(System.Double,Rhino.Geometry.Interval)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
subdomain:
The test is performed on the interval that is the intersection of subdomain with Domain()
Returns: true if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.

Rhino.Geometry.Curve.RemoveShortSegments(System.Double)
Looks for segments that are shorter than tolerance that can be removed.
Does not change the domain, but it will change the relative parameterization.
tolerance: Tolerance which defines "short" segments.
Returns:
true if removable short segments were found.
false if no removable short segments were found.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@)
Gets the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals length.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double)
Gets the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals s.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Gets the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the subdomain.
t:
Parameter such that the length of the curve from the start of the subdomain to t is s.
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Gets the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the subdomain.
t:
Parameter such that the length of the curve from the start of the subdomain to t is s.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
fractionalTolerance:
Desired fractional precision for each segment.
fabs("true" length - actual length)/(actual length) <= fractionalTolerance.
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
A 0.0 s value corresponds to subdomain->Min() and a 1.0 s value corresponds to subdomain->Max().
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
fractionalTolerance:
Desired fractional precision for each segment.
fabs("true" length - actual length)/(actual length) <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
A 0.0 s value corresponds to subdomain->Min() and a 1.0 s value corresponds to subdomain->Max().
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the points at the start and end of the curve are included.
Returns:
List of curve parameters at the division points on success, null on failure.

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the points at the start and end of the curve are included.
points: A list of division points. If the function returns successfully, this point-array will be filled in.
Returns: Array containing division curve parameters on success, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeStart: If true, then the points at the start of the curve is included.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeStart: If true, then the point at the start of the curve is included.
points: If function is successful, points at each parameter value are returned in points.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideEquidistant(System.Double)
Calculates 3d points on a curve where the linear distance between the points is equal.
distance: The distance betwen division points.
Returns: An array of equidistant points, or null on error.

Rhino.Geometry.Curve.DivideAsContour(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Divides this curve at fixed steps along a defined contour line.
contourStart: The start of the contouring line.
contourEnd: The end of the contouring line.
interval: A distance to measure on the contouring axis.
Returns: An array of points; or null on error.

Rhino.Geometry.Curve.GetCurveParameterFromNurbsFormParameter(System.Double,System.Double@)
Convert a NURBS curve parameter to a curve parameter.
nurbsParameter: Nurbs form parameter.
curveParameter: Curve parameter.
Returns: true on success, false on failure.
Remarks:
If HasNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.

Rhino.Geometry.Curve.GetNurbsFormParameterFromCurveParameter(System.Double,System.Double@)
Convert a curve parameter to a NURBS curve parameter.
curveParameter: Curve parameter.
nurbsParameter: Nurbs form parameter.
Returns: true on success, false on failure.
Remarks:
If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.

Rhino.Geometry.Curve.Trim(System.Double,System.Double)
Removes portions of the curve outside the specified interval.
t0:
Start of the trimming interval. Portions of the curve before curve(t0) are removed.
t1:
End of the trimming interval. Portions of the curve after curve(t1) are removed.
Returns: Trimmed portion of this curve is successfull, null on failure.

Rhino.Geometry.Curve.Trim(Rhino.Geometry.Interval)
Removes portions of the curve outside the specified interval.
domain:
Trimming interval. Portions of the curve before curve(domain[0])
and after curve(domain[1]) are removed.
Returns: Trimmed portion of this curve is successfull, null on failure.

Rhino.Geometry.Curve.Split(System.Double)
Splits (divides) the curve at the specified parameter.
The parameter must be in the interior of the curve's domain.
t:
Parameter to split the curve at in the interval returned by Domain().
Returns:
Two curves on success, null on failure.

Rhino.Geometry.Curve.Split(System.Collections.Generic.IEnumerable{System.Double})
Splits (divides) the curve at a series of specified parameters.
The parameter must be in the interior of the curve's domain.
t:
Parameters to split the curve at in the interval returned by Domain().
Returns:
Multiple curves on success, null on failure.

Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double)
Splits a curve into pieces using a polysurface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Curve.Extend(System.Double,System.Double)
Where possible, analytically extends curve to include the given domain.
This will not work on closed curves. The original curve will be identical to the
restriction of the resulting curve to the original curve domain.
t0: Start of extension domain, if the start is not inside the
Domain of this curve, an attempt will be made to extend the curve.
t1: End of extension domain, if the end is not inside the
Domain of this curve, an attempt will be made to extend the curve.
Returns: Extended curve on success, null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.Interval)
Where possible, analytically extends curve to include the given domain.
This will not work on closed curves. The original curve will be identical to the
restriction of the resulting curve to the original curve domain.
domain: Extension domain.
Returns: Extended curve on success, null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,System.Double,Rhino.Geometry.CurveExtensionStyle)
Extends a curve by a specific length.
side: Curve end to extend.
length: Length to add to the curve end.
style: Extension style.
Returns: A curve with extended ends or null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve until it intersects a collection of objects.
side: The end of the curve to extend.
style: The style or type of extension to use.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,Rhino.Geometry.Point3d)
Extends a curve to a point.
side: The end of the curve to extend.
style: The style or type of extension to use.
endPoint: A new end point.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendOnSurface(Rhino.Geometry.CurveEnd,Rhino.Geometry.Surface)
Extends a curve on a surface.
side: The end of the curve to extend.
surface: Surface that contains the curve.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendOnSurface(Rhino.Geometry.CurveEnd,Rhino.Geometry.BrepFace)
Extends a curve on a surface.
side: The end of the curve to extend.
face: BrepFace that contains the curve.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendByLine(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve by a line until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.ExtendByArc(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve by an Arc until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.

Rhino.Geometry.Curve.Simplify(Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
2. The Nurbs Curves segments do not have fully multiple interior knots.
3. Rational Nurbs curves do not have constant weights.
4. Any segment for which IsLinear() or IsArc() is true is a Line,
Polyline segment, or an Arc.
5. Adjacent Colinear or Cocircular segments are combined.
6. Segments that meet with G1-continuity have there ends tuned up so
that they meet with G1-continuity to within machine precision.
options: Simplification options.
distanceTolerance: A distance tolerance for the simplification.
angleToleranceRadians: An angle tolerance for the simplification.
Returns: New simplified curve on success, null on failure.

Rhino.Geometry.Curve.SimplifyEnd(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Same as SimplifyCurve, but simplifies only the last two segments at "side" end.
end: If CurveEnd.Start the function simplifies the last two start
side segments, otherwise if CurveEnd.End the last two end side segments are simplified.
options: Simplification options.
distanceTolerance: A distance tolerance for the simplification.
angleToleranceRadians: An angle tolerance for the simplification.
Returns: New simplified curve on success, null on failure.

Rhino.Geometry.Curve.Fair(System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to
remove large curvature variations while limiting the geometry changes to be no
more than the specified tolerance.
distanceTolerance: Maximum allowed distance the faired curve is allowed to deviate from the input.
angleTolerance: (in radians) kinks with angles <= angleTolerance are smoothed out 0.05 is a good default.
clampStart: The number of (control vertices-1) to preserve at start.
0 = preserve start point
1 = preserve start point and 1st derivative
2 = preserve start point, 1st and 2nd derivative
clampEnd: Same as clampStart.
iterations: The number of iteratoins to use in adjusting the curve.
Returns: Returns new faired Curve on success, null on failure.

Rhino.Geometry.Curve.Fit(System.Int32,System.Double,System.Double)
Fits a new curve through an existing curve.
degree: The degree of the returned Curve. Must be bigger than 1.
fitTolerance: The fitting tolerance. If fitTolerance is RhinoMath.UnsetValue or <=0.0,
the document absolute tolerance is used.
angleTolerance: The kink smoothing tolerance in radians.
If angleTolerance is 0.0, all kinks are smoothed
If angleTolerance is >0.0, kinks smaller than angleTolerance are smoothed
If angleTolerance is RhinoMath.UnsetValue or <0.0, the document angle tolerance is used for the kink smoothing
Returns: Returns a new fitted Curve if successful, null on failure.

Rhino.Geometry.Curve.Rebuild(System.Int32,System.Int32,System.Boolean)
Rebuild a curve with a specific point count.
pointCount: Number of control points in the rebuild curve.
degree: Degree of curve. Valid values are between and including 1 and 11.
preserveTangents: If true, the end tangents of the input curve will be preserved.
Returns: A Nurbs curve on success or null on failure.

Rhino.Geometry.Curve.HasNurbsForm
Does a NURBS curve representation of this curve exist?
Returns:
0   unable to create NURBS representation with desired accuracy.
1   success - NURBS parameterization matches the curve's to the desired accuracy
2   success - NURBS point locus matches the curve's and the domain of the NURBS
curve is correct. However, This curve's parameterization and the
NURBS curve parameterization may not match. This situation happens
when getting NURBS representations of curves that have a
transendental parameterization like circles.

Rhino.Geometry.Curve.ToNurbsCurve
Constructs a NURBS curve representation of this curve.
Returns: NURBS representation of the curve on success, null on failure.

Rhino.Geometry.Curve.ToNurbsCurve(Rhino.Geometry.Interval)
Constructs a NURBS curve representation of this curve.
subdomain: The NURBS representation for this portion of the curve is returned.
Returns: NURBS representation of the curve on success, null on failure.

Rhino.Geometry.Curve.SpanDomain(System.Int32)
Get the domain of the curve span with the given index.
Use the SpanCount property to test how many spans there are.
spanIndex: Index of span.
Returns: Interval of the span with the given index.

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Gets a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the nurb will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount: An amount of subsegments.
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength: The minimum permitted edge length.
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
Returns: PolylineCurve on success, null on error.

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean,Rhino.Geometry.Interval)
Gets a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the nurb will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount: An amount of subsegments.
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength: The minimum permitted edge length.
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
curveDomain: This subdomain of the NURBS curve is approximated.
Returns: PolylineCurve on success, null on error.

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double)
Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve.
Then it "connects the points" so that you have a polyline on the mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance (RhinoDoc.ModelAbsoluteTolerance is a good default)
Returns: A polyline curve on success, null on failure.

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Plane,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets this curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the offset_curves[] array.
plane: Offset solution plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets this curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the offset_curves[] array.
directionPoint: A point that indicates the direction of the offset.
normal: The normal to the offset plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double,System.Double)
Offset this curve on a brep face surface. This curve must lie on the surface.
face: The brep face on which to offset.
distance: A distance to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face is null.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
face: The brep face on which to offset.
throughPoint: 2d point on the brep face to offset through.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face is null.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double[],System.Double[],System.Double)
Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
face: The brep face on which to offset.
curveParameters: Curve parameters corresponding to the offset distances.
offsetDistances: distances to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face, curveParameters or offsetDistances are null.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
surface: A surface on which to offset.
distance: A distance to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface is null.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
surface: A surface on which to offset.
throughPoint: 2d point on the brep face to offset through.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface is null.

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double[],System.Double[],System.Double)
Offset this curve on a surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
surface: A surface on which to offset.
curveParameters: Curve parameters corresponding to the offset distances.
offsetDistances: Distances to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface, curveParameters or offsetDistances are null.

Rhino.Geometry.Curve.Domain
Gets or sets the domain of the curve.

Rhino.Geometry.Curve.Dimension
Gets the dimension of the object.
The dimension is typically three. For parameter space trimming
curves the dimension is two. In rare cases the dimension can
be one or greater than three.

Rhino.Geometry.Curve.SpanCount
Gets the number of non-empty smooth (c-infinity) spans in the curve.

Rhino.Geometry.Curve.Degree
Gets the maximum algebraic degree of any span
or a good estimate if curve spans are not algebraic.

Rhino.Geometry.Curve.IsClosed
Gets a value indicating whether or not this curve is a closed curve.

Rhino.Geometry.Curve.IsPeriodic
Gets a value indicating whether or not this curve is considered to be Periodic.

Rhino.Geometry.Curve.PointAtStart
Evaluates point at the start of the curve.

Rhino.Geometry.Curve.PointAtEnd
Evaluates point at the end of the curve.

Rhino.Geometry.Curve.TangentAtStart
Evaluates the unit tangent vector at the start of the curve.
Returns: Unit tangent vector of the curve at the start point.
Remarks: No error handling.

Rhino.Geometry.Curve.TangentAtEnd
Evaluate unit tangent vector at the end of the curve.
Returns: Unit tangent vector of the curve at the end point.
Remarks: No error handling.