Rhino.Geometry.Leader
Represents a leader, or an annotation entity with text that resembles an arrow pointing to something.
This class refers to the geometric element that is independent from the document.

Rhino.Geometry.Leader.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.