Rhino.DocObjects.Layer.GetDefaultLayerProperties
Constructs a layer with the current default properties.
The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
Returns: A new layer instance.

Rhino.DocObjects.Layer.Default
Sets layer to default settings.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.IsValidName(System.String)
Determines if a given string is valid for a layer name.
name: A name to be validated.
Returns: true if the name is valid for a layer name; otherwise, false.

Rhino.DocObjects.Layer.GetChildren
Gets immediate children of this layer. Note that child layers may have their own children.
Returns: Array of child layers. null if this layer does not have any children.

Rhino.DocObjects.Layer.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.DocObjects.Layer.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.DocObjects.Layer.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.

Rhino.DocObjects.Layer.Name
Gets or sets the name of this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.FullPath
Gets the full path to this layer. The full path includes nesting information.

Rhino.DocObjects.Layer.LayerIndex
Gets or sets the index of this layer.

Rhino.DocObjects.Layer.Id
Gets or sets the ID of this layer object.
You typically do not need to assign a custom ID.

Rhino.DocObjects.Layer.ParentLayerId
Gets the ID of the parent layer. Layers can be origanized in a hierarchical structure,
in which case this returns the parent layer ID. If the layer has no parent,
Guid.Empty will be returned.

Rhino.DocObjects.Layer.IgesLevel
Gets or sets the IGES level for this layer.

Rhino.DocObjects.Layer.Color
Gets or sets the display color for this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.PlotColor
Gets or sets the plot color for this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.PlotWeight
Gets or sets the thickness of the plotting pen in millimeters.
A thickness of 0.0 indicates the "default" pen weight should be used.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.LinetypeIndex
Gets or sets the line-type index for this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.RenderMaterialIndex
Gets or sets the index of render material for objects on this layer that have
MaterialSource() == MaterialFromLayer.
A material index of -1 indicates no material has been assigned
and the material created by the default Material constructor
should be used.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.IsVisible
Gets or sets the visibility of this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.IsLocked
Gets or sets a value indicating the locked state of this layer.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.IsExpanded
Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
Remarks: If you are modifying a layer inside a Rhino document,
you must call CommitChanges for the modifications to take effect.

Rhino.DocObjects.Layer.IsDeleted
Gets a value indicating whether this layer has been deleted and is
currently in the Undo buffer.

Rhino.DocObjects.Layer.IsReference
Gets a value indicting whether this layer is a referenced layer.
Referenced layers are part of referenced documents.

Rhino.DocObjects.Layer.SortIndex
Runtime index used to sort layers in layer dialog.

Rhino.DocObjects.Layer.UserStringCount
Gets the amount of user strings.