Rhino.Geometry.Quaternion
Represents the four coefficient values in a quaternion.
The first value a is the real part,
while the rest multipies i, j and k, that are imaginary.
quaternion = a + bi + cj + dk

Rhino.Geometry.Quaternion.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new quaternion with the provided coefficients.
a: A number. This is the real part.
b: Another number. This is the first coefficient of the imaginary part.
c: Another number. This is the second coefficient of the imaginary part.
d: Another number. This is the third coefficient of the imaginary part.

Rhino.Geometry.Quaternion.op_Equality(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Determines whether two quaternions have the same value.
a: A quaternion.
b: Another quaternion.
Returns: true if the quaternions have exactly equal coefficients; otherwise false.

Rhino.Geometry.Quaternion.op_Inequality(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Determines whether two quaternions have different values.
a: A quaternion.
b: Another quaternion.
Returns: true if the quaternions differ in any coefficient; otherwise false.

Rhino.Geometry.Quaternion.Equals(Rhino.Geometry.Quaternion)
Determines whether this quaternion has the same value of another quaternion.
other: Another quaternion to compare.
Returns: true if the quaternions have exactly equal coefficients; otherwise false.

Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)
Sets all coefficients of the quaternion.

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Int32)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Single)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Double)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Division(Rhino.Geometry.Quaternion,System.Double)
Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
y: A number.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Addition(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Adds two quaternions.
This sums each quaternion coefficient with its correspondant and returns
a new result quaternion.
a: A quaternion.
b: Another quaternion.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Subtraction(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Subtracts a quaternion from another one.
This computes the difference of each quaternion coefficient with its
correspondant and returns a new result quaternion.
a: A quaternion.
b: Another quaternion.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
a: The first term.
b: The second term.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.Invert
Modifies this quaternion to become
(a/L2, -b/L2, -c/L2, -d/L2),
where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
Returns:
true if successful. false if the quaternion is zero and cannot be inverted.

Rhino.Geometry.Quaternion.MatrixForm
Returns 4x4 real valued matrix form of the quaternion
a  b  c  d
-b  a -d  c
-c  d  a -b
-d -c  b  a
which has the same arithmetic properties as the quaternion.
Returns: A transform value.
Remarks:
Do not confuse this with the rotation defined by the quaternion. This
function will only be interesting to math nerds and is not useful in
rendering or animation applications.

Rhino.Geometry.Quaternion.SetRotation(System.Double,Rhino.Geometry.Vector3d)
Sets the quaternion to cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the unit quaternion
that represents the rotation of angle about axis.
angle: in radians.
axisOfRotation: The direction of the axis of rotation.

Rhino.Geometry.Quaternion.Rotation(System.Double,Rhino.Geometry.Vector3d)
Returns the unit quaternion
cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the
unit quaternion that represents the rotation of angle about axis.
angle: An angle in radians.
axisOfRotation: The axis of rotation.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.Product(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
The quaternion product of p and q.  This is the same value as p*q.
p: The first trasform.
q: The second trasform.
Returns: A transform value.

Rhino.Geometry.Quaternion.CrossProduct(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Computes the vector cross product of p and q = (0,x,y,z),
where (x,y,z) = CrossProduct(p.Vector,q.Vector).
This is not the same as the quaternion product p*q.
p: A quaternion.
q: Another quaternion.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.Zero
Returns the dafault quaternion, where all coefficients are 0.

Rhino.Geometry.Quaternion.Identity
Returns the (1,0,0,0) quaternion.

Rhino.Geometry.Quaternion.I
Returns the (0,1,0,0) quaternion.

Rhino.Geometry.Quaternion.J
Returns the (0,0,1,0) quaternion.

Rhino.Geometry.Quaternion.K
Returns the (0,0,0,1) quaternion.

Rhino.Geometry.Quaternion.A
Gets or sets the real part of the quaternion.

Rhino.Geometry.Quaternion.B
Gets or sets the first imaginary coefficient of the quaternion.

Rhino.Geometry.Quaternion.C
Gets or sets the second imaginary coefficient of the quaternion.

Rhino.Geometry.Quaternion.D
Gets or sets the third imaginary coefficient of the quaternion.

Rhino.Geometry.Quaternion.IsValid
Determines if the four coefficients are valid numbers within RhinoCommon.
See Rhino.RhinoMath.IsValidDouble(System.Double).

Rhino.Geometry.Quaternion.Conjugate
Gets a new quaternion that is the conjugate of this quaternion.
This is (a,-b,-c,-d)

Rhino.Geometry.Quaternion.Inverse
Computes a new inverted quaternion,
(a/L2, -b/L2, -c/L2, -d/L2),
where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
If this is the zero quaternion, then the zero quaternion is returned.

Rhino.Geometry.Quaternion.LengthSquared
Gets the result of (a^2 + b^2 + c^2 + d^2).

Rhino.Geometry.Quaternion.Vector
The imaginary part of the quaternion
(B,C,D)

Rhino.Geometry.Quaternion.Scalar
The real (scalar) part of the quaternion
This is Rhino.Geometry.Quaternion.A.

Rhino.Geometry.Quaternion.IsZero
true if a, b, c, and d are all zero.

Rhino.Geometry.Quaternion.IsScalar
true if b, c, and d are all zero.

Rhino.Geometry.Quaternion.IsVector
true if a = 0 and at least one of b, c, or d is not zero.