Rhino.Display.ColorXYZ.#ctor(System.Drawing.Color)
Constructs a new instance of ColorXYZ that is equivalent to an RGB color.
rgb: RGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorXYZ with custom channel values.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorXYZ with custom channel values.
alpha: Alpha channel value, channel will be limited to 0~1.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.

Rhino.Display.ColorXYZ.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest XYZ equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The XYZ equivalent of the HSL color.

Rhino.Display.ColorXYZ.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest XYZ equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The XYZ equivalent of the CMYK color.

Rhino.Display.ColorXYZ.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest XYZ equivalent of a Lab color.
lab: Target color in LAB space.
Returns: The XYZ equivalent of the LAB color.

Rhino.Display.ColorXYZ.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest XYZ equivalent of an LCH color.
lch: Target color in LCH space.
Returns: The XYZ equivalent of the LCH color.

Rhino.Display.ColorXYZ.X
Gets or set the X channel value. Channel will be limited to 0~1.

Rhino.Display.ColorXYZ.Y
Gets or set the Y channel value. Channel will be limited to 0~1.

Rhino.Display.ColorXYZ.Z
Gets or set the Z channel value. Channel will be limited to 0~1.

Rhino.Display.ColorXYZ.A
Gets or set the Alpha channel value. Channel will be limited to 0~1.