Rhino.UI.LocalizationUtils.GetContainersPropertiesFromControl(System.Windows.Forms.Control,System.Collections.Generic.List{System.ComponentModel.IContainer}@)
Obtains container properties from a control.
c: A control.
components: A list of components is returned.

Rhino.UI.LocalizationUtils.GetComponentControls(System.Windows.Forms.Control)
Check to see if there are any System.Window.Control items in any components lists associated with the control like System.Windows.Forms.ContextMenuStrip
which need to be localized.
control: A control that might need to be localized.
Returns: An array of controls.

Rhino.UI.LocalizationUtils.GetToolTip(System.Windows.Forms.Control)
Iterate a controls list of data members for filed's of type System.ComponentModel.IContainer and if found
then iterate the containers control components and return the ToolTip components found.
control: A control.
Returns: An array of tooltips.