Rhino.Geometry.BezierCurve.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Create bezier curve with controls defined by a list of 2d points
controlPoints:

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create bezier curve with controls defined by a list of 3d points
controlPoints:

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point4d})
Create bezier curve with controls defined by a list of 4d points
controlPoints:

Rhino.Geometry.BezierCurve.CreateLoftedBezier(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Loft a bezier through a list of points
points: 2 or more points to interpolate
Returns: new bezier curve if successful

Rhino.Geometry.BezierCurve.CreateLoftedBezier(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Loft a bezier through a list of points
points: 2 or more points to interpolate
Returns: new bezier curve if successful

Rhino.Geometry.BezierCurve.GetBoundingBox(System.Boolean)
Boundingbox solver. Gets the world axis aligned boundingbox for the curve.
accurate: If true, a physically accurate boundingbox will be computed.
If not, a boundingbox estimate will be computed. For some geometry types there is no
difference between the estimate and the accurate boundingbox. Estimated boundingboxes
can be computed much (much) faster than accurate (or "tight") bounding boxes.
Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Returns:
The boundingbox of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.

Rhino.Geometry.BezierCurve.PointAt(System.Double)
Evaluates point at a curve parameter.
t: Evaluation parameter.
Returns: Point (location of curve at the parameter t).
Remarks: No error handling.

Rhino.Geometry.BezierCurve.TangentAt(System.Double)
Evaluates the unit tangent vector at a curve parameter.
t: Evaluation parameter.
Returns: Unit tangent vector of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.BezierCurve.CurvatureAt(System.Double)
Evaluate the curvature vector at a curve parameter.
t: Evaluation parameter.
Returns: Curvature vector of the curve at the parameter t.
Remarks: No error handling.

Rhino.Geometry.BezierCurve.ToNurbsCurve
Constructs a NURBS curve representation of this curve.
Returns: NURBS representation of the curve on success, null on failure.

Rhino.Geometry.BezierCurve.GetControlVertex2d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when index is out of range

Rhino.Geometry.BezierCurve.GetControlVertex3d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when index is out of range

Rhino.Geometry.BezierCurve.GetControlVertex4d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
Homogenous value of control vertex. If the bezier is not
rational, the weight is 1.
Throws System.ArgumentOutOfRangeException: when index is out of range

Rhino.Geometry.BezierCurve.MakeRational
Make bezier rational
Returns: true if successful

Rhino.Geometry.BezierCurve.MakeNonRational
Make bezier non-rational
Returns: treu if successful

Rhino.Geometry.BezierCurve.IncreaseDegree(System.Int32)
Increase degree of bezier
desiredDegree:
Returns: true if successful.  false if desiredDegree < current degree.

Rhino.Geometry.BezierCurve.ChangeDimension(System.Int32)
Change dimension of bezier.
desiredDimension:
Returns: true if successful.  false if desired_dimension < 1

Rhino.Geometry.BezierCurve.CreateCubicBeziers(Rhino.Geometry.Curve,System.Double,System.Double)
Constructs an array of cubic, non-rational beziers that fit a curve to a tolerance.
sourceCurve: A curve to approximate.
distanceTolerance:
The max fitting error. Use RhinoMath.SqrtEpsilon as a minimum.
kinkTolerance:
If the input curve has a g1-discontinuity with angle radian measure
greater than kinkTolerance at some point P, the list of beziers will
also have a kink at P.
Returns: A new array of bezier curves. The array can be empty and might contain null items.

Rhino.Geometry.BezierCurve.IsValid
Tests an object to see if it is valid.

Rhino.Geometry.BezierCurve.IsRational
Gets a value indicating whether or not the curve is rational.
Rational curves have control-points with custom weights.

Rhino.Geometry.BezierCurve.ControlVertexCount
Number of control vertices in this curve