Rhino.Geometry.BrepRegionFaceSide.Brep
The brep this side belongs to.

Rhino.Geometry.BrepRegionFaceSide.Region
The region this side belongs to.

Rhino.Geometry.BrepRegionFaceSide.SurfaceNormalPointsIntoRegion
Gets true if BrepFace's surface normal points into region; false otherwise.

Rhino.Geometry.BrepRegionFaceSide.Face
Gets the face this side belongs to.