Rhino.FileIO.File3dmObjectTable
Represents a simple object table for a file that is open externally.
This class mimics Rhino.DocObjects.Tables.ObjectTable while providing external eccess to the file.

Rhino.FileIO.File3dmObjectTable.Dump
Prepares a text dump of object table.
Returns: A string containing the dump.

Rhino.FileIO.File3dmObjectTable.FindByLayer(System.String)
Finds all File3dmObject that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.

Rhino.FileIO.File3dmObjectTable.GetBoundingBox
Gets the bounding box containing every object in this table.
Returns: The computed bounding box.

Rhino.FileIO.File3dmObjectTable.GetEnumerator
Gets the enumerator that visits any Rhino.FileIO.File3dmObject in this table.
Returns: The enumerator.

Rhino.FileIO.File3dmObjectTable.AddPoint(System.Double,System.Double,System.Double)
Adds a point object to the table.
x: X component of point coordinate.
y: Y component of point coordinate.
z: Z component of point coordinate.
Returns: id of new object.

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3d)
Adds a point object to the table.
point: A location for point.
Returns: Id of new object.

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: A location for point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3f)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3f,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: An array of object unique identifiers.

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds multiple points to the document.
points: Points to add.
Returns: An array of object unique identifiers.

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: An array of object unique identifiers.

Rhino.FileIO.File3dmObjectTable.AddPointCloud(Rhino.Geometry.PointCloud)
Adds a point cloud object to the document.
cloud: PointCloud to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: attributes to apply to point cloud.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid)
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportId: The viewport id that the new clipping plane will clip.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid})
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportIds: A list, an array or any enumerable of viewport ids that the new clipping plane will clip.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportIds: list of viewport ids that the new clipping plane will clip.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension)
Adds a linear dimension to the 3dm file object table.
dimension: A dimension.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)
Adds a linear dimension to the 3dm file object table.
dimension: A dimension.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Adds a line object to Rhino.
from: A line start point.
to: A line end point.
Returns: A unique identifier of new rhino object.

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
from: The start point of the line.
to: The end point of the line.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Line)
Adds a line object to Rhino.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Line,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
line: A line.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a polyline object to Rhino.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a polyline object to Rhino.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddArc(Rhino.Geometry.Arc)
Adds a curve object to the document representing an arc.
arc: An arc.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an arc.
arc: An arc to add.
attributes: attributes to apply to arc.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddCircle(Rhino.Geometry.Circle)
Adds a curve object to the document representing a circle.
circle: A circle to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing a circle.
circle: A circle to add.
attributes: attributes to apply to circle.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddEllipse(Rhino.Geometry.Ellipse)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse to add.
attributes: attributes to apply to ellipse.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddSphere(Rhino.Geometry.Sphere)
Adds a surface object to the document representing a sphere.
sphere: A sphere to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to the document representing a sphere.
sphere: A sphere to add.
attributes: Attributes to link with the sphere.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddCurve(Rhino.Geometry.Curve)
Adds a curve object to the table.
curve: A curve to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the table.
curve: A duplicate of this curve is added to Rhino.
attributes: Attributes to apply to curve.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d)
Adds a text dot object to the table.
text: The text.
location: The location.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to the table.
text: The text.
location: The location.
attributes: Attributes to link with curve.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Adds a text dot object to Rhino.
dot: The text dot.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
dot: The text dot.
attributes: Attributes to link with curve.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddText(Rhino.Display.Text3d)
Adds an annotation text object to the document.
text3d: The text object to add.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddText(Rhino.Display.Text3d,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text3d: The text object to add.
attributes: Attributes to link to the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
justification: The justification of the text.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
justification: The justification of the text.
attributes: Attributes to link to the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddSurface(Rhino.Geometry.Surface)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddMesh(Rhino.Geometry.Mesh)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddBrep(Rhino.Geometry.Brep)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Adds an annotation leader to the document.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Adds an annotation leader to the document.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Adds an annotation leader to the document.
text: The text.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Adds an annotation leader to the document.
text: The text.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
text: The text.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddLeader(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddHatch(Rhino.Geometry.Hatch)
Adds a hatch to the document.
hatch: A hatch.
Returns: A unique identifier for the hatch, or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.AddHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)
Adds a hatch to the document.
hatch: A hatch.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the hatch, or System.Guid.Empty on failure.

Rhino.FileIO.File3dmObjectTable.Count
Gets the number of File3dmObjects in this table.

Rhino.FileIO.File3dmObjectTable.Item(System.Int32)
Gets the File3dmObject at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of File3dmObject to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The File3dmObject at [index].