Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32)
Constructs a new triangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.

Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a new quadrangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.

Rhino.Geometry.MeshFace.IsValid
Gets a value indicating whether or not this mesh face
is considered to be valid. Note that even valid mesh faces
could potentially be invalid in the context of a specific Mesh,
if one or more of the corner indices exceeds the number of
vertices on the mesh. If you want to perform a complete
validity check, use IsValid(int) instead.

Rhino.Geometry.MeshFace.IsValid(System.Int32)
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes upper bound indices into account.
vertexCount: Number of vertices in the mesh that this face is a part of.
Returns: true if the face is considered valid, false if not.

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32)
Sets all the corners for this face as a triangle.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32,System.Int32)
Sets all the corners for this face as a quad.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.

Rhino.Geometry.MeshFace.Flip
Reverses the orientation of the face by swapping corners.
The first corner is always maintained.

Rhino.Geometry.MeshFace.Unset
Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.

Rhino.Geometry.MeshFace.DebuggerDisplayUtil
Internal property that figures out the debugger display for Mesh Faces.

Rhino.Geometry.MeshFace.A
Gets or sets the first corner index of the mesh face.

Rhino.Geometry.MeshFace.B
Gets or sets the second corner index of the mesh face.

Rhino.Geometry.MeshFace.C
Gets or sets the third corner index of the mesh face.

Rhino.Geometry.MeshFace.D
Gets or sets the fourth corner index of the mesh face.
If D equals C, the mesh face is considered to be a triangle
rather than a quad.

Rhino.Geometry.MeshFace.IsTriangle
Gets a value indicating whether or not this mesh face is a triangle.
A mesh face is considered to be a triangle when C equals D, thus it is
possible for an Invalid mesh face to also be a triangle.

Rhino.Geometry.MeshFace.IsQuad
Gets a value indicating whether or not this mesh face is a quad.
A mesh face is considered to be a triangle when C does not equal D,
thus it is possible for an Invalid mesh face to also be a quad.