Rhino.DocObjects.HatchPattern.ReadFromFile(System.String,System.Boolean)
Reads hatch pattern definitions from a file.
filename:
Name of an existing file. If filename is null or empty, default hatch pattern filename is used.
quiet:
If file doesn't exist, and quiet is false, an error meesage box is shown.
Returns: An array of hatch patterns. This can be null, but not empty.

Rhino.DocObjects.HatchPattern.IsDeleted
Deleted hatch patterns are kept in the runtime hatch pattern table so that undo
will work with hatch patterns.  Call IsDeleted to determine to determine if
a hatch pattern is deleted.

Rhino.DocObjects.HatchPattern.IsReference
Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the
document are "normal" or "reference". Reference hatch patterns are not saved.

Rhino.DocObjects.HatchPattern.Index
Index in the hatch pattern table for this pattern. -1 if not in the table.

Rhino.DocObjects.HatchPattern.Name
