Rhino.Geometry.InstanceDefinitionGeometry
Represents the geometry in a block definition.

Rhino.Geometry.InstanceDefinitionGeometry.#ctor
Initializes a new block definition.

Rhino.Geometry.InstanceDefinitionGeometry.Name
Gets or sets the name of the definition.

Rhino.Geometry.InstanceDefinitionGeometry.Description
Gets or sets the description of the definition.