Rhino.Runtime.Interop.NativeRhinoDocPointer(Rhino.RhinoDoc)
Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
doc: A document.
Returns: A pointer value.

Rhino.Runtime.Interop.NativeGeometryConstPointer(Rhino.Geometry.GeometryBase)
Returns the underlying const ON_Geometry* for a RhinoCommon class. You should only
be interested in using this function if you are writing C++ code.
geometry: A geometry object. This can be null and in such a case System.IntPtr.Zero is returned.
Returns: A pointer to the const geometry.

Rhino.Runtime.Interop.NativeGeometryNonConstPointer(Rhino.Geometry.GeometryBase)
Returns the underlying non-const ON_Geometry* for a RhinoCommon class. You should
only be interested in using this function if you are writing C++ code.
geometry: A geometry object. This can be null and in such a case System.IntPtr.Zero is returned.
Returns: A pointer to the non-const geometry.

Rhino.Runtime.Interop.RhinoObjectConstPointer(Rhino.DocObjects.RhinoObject)
Returns the underlying const CRhinoObject* for a RhinoCommon class. You should only
be interested in using this function if you are writing C++ code.
rhinoObject: A Rhino object.
Returns: A pointer to the Rhino const object.

Rhino.Runtime.Interop.RhinoObjectFromPointer(System.IntPtr)
Constructs a RhinoCommon Rhino object from an unmanaged C++ RhinoObject pointer.
pRhinoObject: The original pointer.
Returns: A new Rhino object, or null if the pointer was invalid or System.IntPtr.Zero.

Rhino.Runtime.Interop.CreateFromNativePointer(System.IntPtr)
Constructs a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry*
must be declared on the heap and its lifetime becomes controlled by RhinoCommon.
pGeometry: ON_Geometry*
Returns: The appropriate geometry class in RhinoCommon on success.

Rhino.Runtime.Interop.TryCopyFromOnArc(System.Object,Rhino.Geometry.Arc@)
Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc.
source: A source OnArc.
destination: A destination arc.
Returns: true if the operation succeeded; false otherwise.

Rhino.Runtime.Interop.TryCopyToOnArc(Rhino.Geometry.Arc,System.Object)
Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc.
source: A source arc.
destination: A destination OnArc.
Returns: true if the operation succeeded; false otherwise.

Rhino.Runtime.Interop.FromOnBrep(System.Object)
Copies a Rhino_DotNet brep to a RhinoCommon brep class.
source:
RMA.OpenNURBS.IOnBrep or RMA.OpenNURBS.OnBrep.
Returns:
RhinoCommon object on success. This will be an independent copy.

Rhino.Runtime.Interop.FromOnSurface(System.Object)
Copies a Rhino_DotNet surface to a RhinoCommon Surface class.
source:
Any of the following in the RMA.OpenNURBS namespace are acceptable.
IOnSurface, OnSurface, IOnPlaneSurface, OnPlaneSurface, IOnClippingPlaneSurface,
OnClippingPlaneSurface, IOnNurbsSurface, OnNurbsSurfac, IOnRevSurface, OnRevSurface,
IOnSumSurface, OnSumSurface.
Returns:
RhinoCommon object on success. This will be an independent copy.

Rhino.Runtime.Interop.FromOnMesh(System.Object)
Copies a Rhino_DotNet mesh to a RhinoCommon mesh class.
source:
RMA.OpenNURBS.IOnMesh or RMA.OpenNURBS.OnMesh.
Returns:
RhinoCommon object on success. This will be an independent copy.

Rhino.Runtime.Interop.FromOnCurve(System.Object)
Copies a Rhino_DotNet curve to a RhinoCommon curve class.
source:
RMA.OpenNURBS.IOnCurve or RMA.OpenNURBS.OnCurve.
Returns:
RhinoCommon object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToOnBrep(Rhino.Geometry.Brep)
Constructs a Rhino_DotNet OnBrep that is a copy of a given brep.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToOnSurface(Rhino.Geometry.Surface)
Constructs a Rhino_DotNet OnSurface that is a copy of a given curve.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToOnMesh(Rhino.Geometry.Mesh)
Constructs a Rhino_DotNet OnMesh that is a copy of a given mesh.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToOnCurve(Rhino.Geometry.Curve)
Constructs a Rhino_DotNet OnCurve that is a copy of a given curve.
source: A RhinoCommon source curve.
Returns:
Rhino_DotNet object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToOnXform(Rhino.Geometry.Transform)
Constructs a Rhino_DotNet OnXform from a given RhinoCommon Transform.
source: A RhinoCommon source transform.
Returns:
Rhino_DotNet object on success. This will be an independent copy.

Rhino.Runtime.Interop.ToIRhinoViewport(Rhino.Display.RhinoViewport)
Convert a Rhino.Display.Viewport to an RMA.Rhino.IRhinoViewport.
source: A RhinoCommon viewport.
Returns:
Rhino_DotNet IRhinoViewport object on success. This will be an independent copy.

Rhino.Runtime.Interop.PlugInPointer(Rhino.PlugIns.PlugIn)
Gets a C++ plug-in pointer for a given RhinoCommon plug-in.
This is a Rhino SDK function.
plugin: A plug-in.
Returns: A pointer.