Rhino.PlugIns.RenderPlugIn.Render(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean)
Called by Render and RenderPreview commands if this plug-in is set as the default render engine.
doc: A document.
mode: A command running mode.
fastPreview: If true, lower quality faster render expected.
Returns: If true, then the renderer is reuired to construct a rapid preview and not the high-quality final result.