Rhino.DocObjects.Custom.UserDictionary.Dictionary
Gets the dictionary that is associated with this class.
This dictionary is unique.

Rhino.DocObjects.Custom.UserDictionary.Description
Gets the text "RhinoCommon UserDictionary".

Rhino.DocObjects.Custom.UserDictionary.ShouldWrite
Writes this entity if the count is larger than 0.