Rhino.Geometry.Ellipse
Represents the values of a plane and the two semiaxes radii in an ellipse.

Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new ellipse from base plane and both principal radii.
plane: Base plane of ellipse.
radius1: Ellipse radius along base plane X direction.
radius2: Ellipse radius along base plane Y direction.

Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new ellipse from a center point and the two semiaxes intersections.
center: A center for the ellipse. The avarage of the foci.
second: The intersection of the ellipse X axis with the ellipse itself.
third: A point that determines the radius along the Y semiaxis.
If the point is at right angle with the (center - second point) vector,
it will be the intersection of the ellipse Y axis with the ellipse itself.

Rhino.Geometry.Ellipse.ToNurbsCurve
Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
Returns: A nurbs curve representation of this ellipse or null if no such representation could be made.

Rhino.Geometry.Ellipse.Plane
Gets or sets the base plane of the ellipse.

Rhino.Geometry.Ellipse.Radius1
Gets or sets the radius of the ellipse along the base plane X semiaxis.

Rhino.Geometry.Ellipse.Radius2
Gets or sets the radius of the ellipse along the base plane Y semiaxis.