Rhino.ApplicationSettings.GeneralSettings.GetDefaultState
Gets the factory settings.
Returns: A new general state with factory settings.

Rhino.ApplicationSettings.GeneralSettings.GetCurrentState
Gets the current settings.
Returns: A new general state with current settings.

Rhino.ApplicationSettings.GeneralSettings.MouseSelectMode
Gets or sets the current selection mode.

Rhino.ApplicationSettings.GeneralSettings.MaximumPopupMenuLines
Gets or sets the maximum number of popup menu lines.

Rhino.ApplicationSettings.GeneralSettings.MinimumUndoSteps
Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and
they use more than MaximumUndoMemoryMb.

Rhino.ApplicationSettings.GeneralSettings.MaximumUndoMemoryMb
Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and
they use more than MaximumUndoMemoryMb.

Rhino.ApplicationSettings.GeneralSettings.NewObjectIsoparmCount
Gets or sets the number of isoparm curves to show on new objects.

Rhino.ApplicationSettings.GeneralSettings.MiddleMouseMode
Gets or sets what happens when the user clicks the middle mouse.

Rhino.ApplicationSettings.GeneralSettings.MiddleMousePopupToolbar
Gets or sets the toolbar to popup when the middle mouse is clicked on
a view, this value is only used when MiddleMouseMode is set to
PopupToolbar.

Rhino.ApplicationSettings.GeneralSettings.MiddleMouseMacro
Gets or sets the toolbar to popup when the middle mouse is clicked on
a view, this value is only used when MiddleMouseMode is set to
PopupToolbar.

Rhino.ApplicationSettings.GeneralSettings.EnableContextMenu
true if right mouse down + delay will pop up context menu on a mouse up if no move happens.

Rhino.ApplicationSettings.GeneralSettings.ContextMenuDelay
Time to wait before permitting context menu display.

Rhino.ApplicationSettings.GeneralSettings.AutoUpdateCommandHelp
Command help dialog auto-update feature.