Rhino.Render.RenderSettings.#ctor
Initializes a new instance of the Rhino.Render.RenderSettings class.

Rhino.Render.RenderSettings.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Render.RenderSettings.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Render.RenderSettings.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Render.RenderSettings.AmbientLight
Gets or sets the ambient light color used in rendering.

Rhino.Render.RenderSettings.BackgroundColorTop
Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.

Rhino.Render.RenderSettings.BackgroundColorBottom
Gets or sets the background bottom color used in rendering.

Rhino.Render.RenderSettings.UseHiddenLights
Gets or sets a value indicating whether to render using lights that are on layers that are off.

Rhino.Render.RenderSettings.DepthCue
Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.

Rhino.Render.RenderSettings.FlatShade
Gets or sets a value indicating whether to render using flat shading.

Rhino.Render.RenderSettings.RenderBackfaces
Gets or sets a value indicating whether to render back faces.

Rhino.Render.RenderSettings.RenderPoints
Gets or sets a value indicating whether to instruct the rendering engine to show points.

Rhino.Render.RenderSettings.RenderCurves
Gets or sets a value indicating whether to instruct the rendering engine to show curves.

Rhino.Render.RenderSettings.RenderIsoparams
Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.

Rhino.Render.RenderSettings.RenderMeshEdges
Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.

Rhino.Render.RenderSettings.RenderAnnotations
Gets or sets a value indicating whether to instruct the rendering engine to show annotations,
such as linear dimensions or angular dimensions.

Rhino.Render.RenderSettings.AntialiasLevel
0=none, 1=normal, 2=best.

Rhino.Render.RenderSettings.UseViewportSize
Gets or sets a value indicating whether to use the resolution of the
viewport being rendered or ImageSize when rendering

Rhino.Render.RenderSettings.ImageSize
Gets or sets a value indicating the size of the rendering result if
UseViewportSize is set to false.  If UseViewportSize is set to true,
then this value is ignored.

Rhino.Render.RenderSettings.ShadowmapLevel
0=none, 1=normal, 2=best.

Rhino.Render.RenderSettings.BackgroundStyle
How the viewport's backgroun should be filled.