Rhino.PersistentSettings.SetStringList(System.String,System.String[])
Including a item with the value of StringListRootKey will cause the ProgramData value to get inserted at
that location in the list when calling GetStringList.
key: The string key.
value: An array of values to set.

Rhino.PersistentSettings.ParseXmlNodes(System.Xml.XmlNode)
Parse XmlNode for settings "entry" elements, add entry elements to the dictionary
first and if then check the defaults list and make sure the entry is in the list before setting the
default value.

Rhino.PersistentSettings.StringListRootKey
Adding this string to a string list when calling SetStringList will cause the ProgramData setting to
get inserted at that location in the list.