Rhino.ApplicationSettings.SmartTrackSettingsState.UseSmartTrack
Gets or sets if the 'smart track' feature is active.

Rhino.ApplicationSettings.SmartTrackSettingsState.UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.

Rhino.ApplicationSettings.SmartTrackSettingsState.SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.

Rhino.ApplicationSettings.SmartTrackSettingsState.SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.

Rhino.ApplicationSettings.SmartTrackSettingsState.ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.

Rhino.ApplicationSettings.SmartTrackSettingsState.MaxSmartPoints
Gets or sets the maximum number of smart points.

Rhino.ApplicationSettings.SmartTrackSettingsState.LineColor
Gets or sets the smart track line color.

Rhino.ApplicationSettings.SmartTrackSettingsState.TanPerpLineColor
Gets or sets the tangent and perpendicular line color.

Rhino.ApplicationSettings.SmartTrackSettingsState.PointColor
Gets or sets the point color.

Rhino.ApplicationSettings.SmartTrackSettingsState.ActivePointColor
Gets or sets the active point color.