Rhino.DocumentOpenEventArgs.FileName
Name of file being opened.

Rhino.DocumentOpenEventArgs.Merge
true if file is being merged into the current document. This
occurs during the "Import" command.

Rhino.DocumentOpenEventArgs.Reference
true is file is openend as a reference file.