Rhino.Geometry.Continuity
Provides enumerated values for continuity along geometry,
such as continuous first derivative or continuous unit tangent and curvature.

Rhino.Geometry.Continuity.Cinfinity_continuous
Analytic discontinuity.