Rhino.PlugIns.LicenseStatus.#ctor
Public constructor.

Rhino.PlugIns.LicenseStatus.ProductId
The id of the product or plugin.

Rhino.PlugIns.LicenseStatus.BuildType
The build type of the product, where:
100 = A release build, either commercical, education, nfr, etc.
200 = A evaluation build
300 = A beta build, such as a wip.

Rhino.PlugIns.LicenseStatus.LicenseTitle
The title of the license. (e.g. "Rhinoceros 5.0 Commercial")

Rhino.PlugIns.LicenseStatus.SerialNumber
The "for display only" product license or serial number.

Rhino.PlugIns.LicenseStatus.LicenseType
The license type. (e.g. Standalone, Network, etc.)

Rhino.PlugIns.LicenseStatus.ExpirationDate
The date and time the license will expire.
This value can be null if:
1.) The license type is "Standalone" and the license does not expire.
2.) The license type is "Network".
3.) The license type is "NetworkCheckedOut" and the checkout does not expire
Note, date and time is in local time coordinates.

Rhino.PlugIns.LicenseStatus.CheckOutExpirationDate
The date and time the checked out license will expire.
Note, this is only set if m_license_type = LicenceType.Standalone
and if "limited license checkout" was enabled on the Zoo server.
Note, date and time is in local time coordinates.

Rhino.PlugIns.LicenseStatus.RegisteredOwner
The registered owner of the product. (e.g. "Dale Fugier")

Rhino.PlugIns.LicenseStatus.RegisteredOrganization
The registered organization of the product (e.g. "Robert McNeel and Associates")

Rhino.PlugIns.LicenseStatus.ProductIcon
The product's icon. Note, this can be null.