Rhino.UI.LocalizationStringTable.XmlFileExists(System.String,System.String,System.Int32)
Look for XML file decorating the name with both the Locale ID as a number and a System.Globalization.CultureInfo.Name.

Rhino.UI.LocalizationStringTable.StripTrailingSquareBrackets(System.String)
Strip trailing "[[some number]]" from end of string.

Rhino.UI.LocalizationStringTable.ResourceNameContainsLocaleID(System.String,System.Int32,System.String)
Takes an embedded resource name and checks to see if it contains ".Localization." in the name and starts
or ends with the locale ID or locale culture string.

Rhino.UI.LocalizationStringTable.LoadFromAssemblyEmbeddedResource(System.Reflection.Assembly,System.Int32)
Looks in the specified assembly for an embedded resource that contains ".Localization." in the name and starts
or ends with the locale ID or locale culture string.

Rhino.UI.LocalizationStringTable.TextReaderFromFile(System.Reflection.Assembly,System.Int32)
Look in the assembly folder or sub folders for a XML file that starts with the locale ID or locale ID
converted to culture string (something like "es-es") and if it is found attach a XmlTextReader to it.

Rhino.UI.LocalizationStringTable.LoadFromFile(System.Reflection.Assembly,System.Int32)
Look for a XML file with the current language ID and if one is not found then look in the specified assembly
for an embedded resource with the name "*.Localization.[locale]*.xml", if one is found then parse the XML
and extract the strings from it.
a: Check this assembly folder and its embedded resources for the specified locale XML file.
language_id: Locale ID to check for.
Returns: true if the operation was successful.

Rhino.UI.LocalizationStringTable.LocalizeControlTree(System.String,System.String,System.Windows.Forms.Control,System.Windows.Forms.ToolTip[])
Recursive helper function for LocalizeUtils.LocalizeForm.

Rhino.UI.LocalizationStringTable.LocalizeToolStripCollection(System.String,System.String,System.Windows.Forms.ToolStripItemCollection)
Recursive helper function for LocalizeUtils.LocalizeForm.

Rhino.UI.LocalizationStringTable.LocalizeComboBoxItems(System.String,System.String,System.Windows.Forms.ComboBox)
Localizes combo list items.
form_name: The form name.
form_class_name: The form class name.
cb: A Windows Forms combo box.