Rhino.PlugIns.LicenseBuildType
License build type enumerations.

Rhino.PlugIns.LicenseBuildType.Release
A release build (e.g. commercical, education, nfr, etc.)

Rhino.PlugIns.LicenseBuildType.Beta
A beta build (e.g. wip)