Rhino.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Initializes a new instance of a vector, using its three components.
x: The X (first) component.
y: The Y (second) component.
z: The Z (third) component.

Rhino.Geometry.Vector3d.#ctor(Rhino.Geometry.Point3d)
Initializes a new instance of a vector, copying the three components from the three coordinates of a point.
point: The point to copy from.

Rhino.Geometry.Vector3d.#ctor(Rhino.Geometry.Vector3f)
Initializes a new instance of a vector, copying the three components from a single-precision vector.
vector: A single-precision vector.

Rhino.Geometry.Vector3d.#ctor(Rhino.Geometry.Vector3d)
Initializes a new instance of a vector, copying the three components from a vector.
vector: A double-precision vector.

Rhino.Geometry.Vector3d.op_Multiply(Rhino.Geometry.Vector3d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3d.Multiply(Rhino.Geometry.Vector3d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3d.op_Multiply(System.Double,Rhino.Geometry.Vector3d)
Multiplies a vector by a number, having the effect of scaling it.
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3d.Multiply(System.Double,Rhino.Geometry.Vector3d)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3d.op_Division(Rhino.Geometry.Vector3d,System.Double)
Divides a Rhino.Geometry.Vector3d by a number, having the effect of shrinking it.
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector3d.Divide(Rhino.Geometry.Vector3d,System.Double)
Divides a Rhino.Geometry.Vector3d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector3d.op_Addition(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Sums up two vectors.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector3d.Add(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector3d.op_Subtraction(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Subtracts the second vector from the first one.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector3d.Subtract(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector3d.op_Multiply(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Multiplies two vectors together, returning the dot product (or inner product).
This differs from the cross product.
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.

Rhino.Geometry.Vector3d.Multiply(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Multiplies two vectors together, returning the dot product (or inner product).
This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.

Rhino.Geometry.Vector3d.op_UnaryNegation(Rhino.Geometry.Vector3d)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector3d.Negate(Rhino.Geometry.Vector3d)
Computes the opposite vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector3d.op_Equality(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether two vectors have the same value.
a: A vector.
b: Another vector.
Returns: true if all coordinates are pairwise equal; false otherwise.

Rhino.Geometry.Vector3d.op_Inequality(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether two vectors have different values.
a: A vector.
b: Another vector.
Returns: true if any coordinate pair is different; false otherwise.

Rhino.Geometry.Vector3d.CrossProduct(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length and
with a result that is oriented following the right hand rule.

Rhino.Geometry.Vector3d.VectorAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Compute the angle between two vectors.
This operation is commutative.
a: First vector for angle.
b: Second vector for angle.
Returns: If the input is valid, the angle (in radians) between a and b; RhinoMath.UnsetValue otherwise.

Rhino.Geometry.Vector3d.VectorAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Plane)
Computes the angle on a plane between two vectors.
a: First vector.
b: Second vector.
plane: Two-dimensional plane on which to perform the angle measurement.
Returns: On success, the angle (in radians) between a and b as projected onto the plane; RhinoMath.UnsetValue on failure.

Rhino.Geometry.Vector3d.op_LessThan(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.

Rhino.Geometry.Vector3d.op_LessThanOrEqual(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.

Rhino.Geometry.Vector3d.op_GreaterThan(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.

Rhino.Geometry.Vector3d.op_GreaterThanOrEqual(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.

Rhino.Geometry.Vector3d.IsTiny(System.Double)
Determines whether a vector is very short.
tolerance:
A nonzero value used as the coordinate zero tolerance.
.
Returns: (Math.Abs(X) <= tiny_tol) AND (Math.Abs(Y) <= tiny_tol) AND (Math.Abs(Z) <= tiny_tol).

Rhino.Geometry.Vector3d.IsTiny
Uses RhinoMath.ZeroTolerance for IsTiny calculation.
Returns: true if vector is very small, otherwise false.

Rhino.Geometry.Vector3d.Equals(Rhino.Geometry.Vector3d)
Determines whether the specified vector has the same value as the present vector.
vector: The specified vector.
Returns: true if vector has the same coordinates as this; otherwise false.

Rhino.Geometry.Vector3d.CompareTo(Rhino.Geometry.Vector3d)
Compares this Rhino.Geometry.Vector3d with another Rhino.Geometry.Vector3d.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Vector3d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.

Rhino.Geometry.Vector3d.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.

Rhino.Geometry.Vector3d.Transform(Rhino.Geometry.Transform)
Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
transformation: Transformation matrix to apply.

Rhino.Geometry.Vector3d.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotates this vector around a given axis.
angleRadians: Angle of rotation (in radians).
rotationAxis: Axis of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Vector3d.Reverse
Reverses (inverts) this vector in place.
If this vector is Invalid, no changes will occur and false will be returned.
Returns: true on success or false if the vector is invalid.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d)
Determines whether this vector is parallel to another vector, within one degree (within Pi / 180).
other: Vector to use for comparison.
Returns:
Parallel indicator:
+1 = both vectors are parallel
0 = vectors are not parallel, or at least one of the vectors is zero
-1 = vectors are anti-parallel.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d,System.Double)
Determines whether this vector is parallel to another vector, within a provided tolerance.
other: Vector to use for comparison.
angleTolerance: Angle tolerance (in radians).
Returns:
Parallel indicator:
+1 = both vectors are parallel.
0 = vectors are not parallel or at least one of the vectors is zero.
-1 = vectors are anti-parallel.

Rhino.Geometry.Vector3d.IsPerpendicularTo(Rhino.Geometry.Vector3d)
Test to see whether this vector is perpendicular to within one degree of another one.
other: Vector to compare to.
Returns: true if both vectors are perpendicular, false if otherwise.

Rhino.Geometry.Vector3d.IsPerpendicularTo(Rhino.Geometry.Vector3d,System.Double)
Determines whether this vector is perpendicular to another vector, within a provided angle tolerance.
other: Vector to use for comparison.
angleTolerance: Angle tolerance (in radians).
Returns: true if vectors form Pi-radians (90-degree) angles with each other; otherwise false.

Rhino.Geometry.Vector3d.PerpendicularTo(Rhino.Geometry.Vector3d)
Sets this vector to be perpendicular to another vector.
Result is not unitized.
other: Vector to use as guide.
Returns: true on success, false if input vector is zero or invalid.

Rhino.Geometry.Vector3d.Zero
Gets the value of the vector with components 0,0,0.

Rhino.Geometry.Vector3d.XAxis
Gets the value of the vector with components 1,0,0.

Rhino.Geometry.Vector3d.YAxis
Gets the value of the vector with components 0,1,0.

Rhino.Geometry.Vector3d.ZAxis
Gets the value of the vector with components 0,0,1.

Rhino.Geometry.Vector3d.Unset
Gets the value of the vector with each component set to RhinoMath.UnsetValue.

Rhino.Geometry.Vector3d.X
Gets or sets the X (first) component of the vector.

Rhino.Geometry.Vector3d.Y
Gets or sets the Y (second) component of the vector.

Rhino.Geometry.Vector3d.Z
Gets or sets the Z (third) component of the vector.

Rhino.Geometry.Vector3d.IsValid
Gets a value indicating whether this vector is valid.
A valid vector must be formed of valid component values for x, y and z.

Rhino.Geometry.Vector3d.MinimumCoordinate
Gets the smallest (both positive and negative) component value in this vector.

Rhino.Geometry.Vector3d.MaximumCoordinate
Gets the largest (both positive and negative) component value in this vector.

Rhino.Geometry.Vector3d.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
If this vector is invalid, its length is considered 0.

Rhino.Geometry.Vector3d.SquareLength
Computes the squared length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
While the Length property checks for input validity,
this property does not. You should check validity in advance,
if this vector can be invalid.

Rhino.Geometry.Vector3d.IsUnitVector
Gets a value indicating whether or not this is a unit vector.
A unit vector has length 1.

Rhino.Geometry.Vector3d.IsZero
Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.