Rhino.DocObjects.AnnotationObjectBase
Provides a base class for Rhino.Geometry.AnnotationBase-derived
objects that are placed in a document.

Rhino.DocObjects.AnnotationObjectBase.DisplayText
Gets the text that is displayed to users.