Rhino.FileIO.BinaryArchiveReader
Represents an entity that is capable of reading a binary archive and
instantiating stringly-typed objects.

Rhino.FileIO.BinaryArchiveReader.Read3dmChunkVersion(System.Int32@,System.Int32@)
A chunk version is a single byte that encodes a major.minor
version number.  Useful when creating I/O code for 3dm chunks
that may change in the future.  Increment the minor version
number if new information is added to the end of the chunk.
Increment the major version if the format of the chunk changes
in some other way.
major: 0 to 15.
minor: 0 to 16.
Returns: true on successful read.

Rhino.FileIO.BinaryArchiveReader.ReadDictionary
Reads a complete Rhino.Collections.ArchivableDictionary from the archive.
Returns: The newly instantiated object.

Rhino.FileIO.BinaryArchiveReader.ReadBool
Reads a System.Boolean from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadByte
Reads a System.Byte from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSByte
Reads a System.SByte from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadShort
Reads a System.Int16 from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadUShort
Reads a System.UInt16 from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadInt
Reads a System.Int32 from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadUInt
Reads a System.UInt32 from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadInt64
Reads a System.Int64 from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSingle
Reads a System.Single from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadDouble
Reads a System.Double from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadGuid
Reads a System.Guid from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadString
Reads a System.String from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadBoolArray
Reads an array of System.Boolean from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadByteArray
Reads an array of System.Byte from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSByteArray
Reads an array of System.SByte from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadShortArray
Reads an array of System.Int16 from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadIntArray
Reads an array of System.Int32 from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSingleArray
Reads an array of System.Single from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadDoubleArray
Reads an array of System.Double from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadGuidArray
Reads an array of System.Guid from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadStringArray
Reads an array of System.String from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadColor
Reads a System.Drawing.Color from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPoint
Reads a System.Drawing.Point from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPointF
Reads a System.Drawing.PointF from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadRectangle
Reads a System.Drawing.Rectangle from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadRectangleF
Reads a System.Drawing.RectangleF from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSize
Reads a System.Drawing.Size from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadSizeF
Reads a System.Drawing.SizeF from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadFont
Reads a System.Drawing.Font from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadInterval
Reads a Rhino.Geometry.Interval from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPoint2d
Reads a Rhino.Geometry.Point2d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPoint3d
Reads a Rhino.Geometry.Point3d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPoint4d
Reads a Rhino.Geometry.Point4d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadVector2d
Reads a Rhino.Geometry.Vector2d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadVector3d
Reads a Rhino.Geometry.Vector3d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadBoundingBox
Reads a Rhino.Geometry.BoundingBox from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadRay3d
Reads a Rhino.Geometry.Ray3d from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadTransform
Reads a Rhino.Geometry.Transform from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPlane
Reads a Rhino.Geometry.Plane from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadLine
Reads a Rhino.Geometry.Line from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadPoint3f
Reads a Rhino.Geometry.Point3f from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadVector3f
Reads a Rhino.Geometry.Vector3f from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadMeshingParameters
Reads a Rhino.Geometry.MeshingParameters from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadGeometry
Reads a Rhino.Geometry.GeometryBase-derived object from the archive.
The Rhino.Geometry.GeometryBase class is abstract.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadErrorOccured
Gets or sets whether en error occurred during reading.

Rhino.FileIO.BinaryArchiveReader.Archive3dmVersion
If a 3dm archive is being read or written, then this is the
version of the 3dm archive format (1, 2, 3, 4 or 5).
0     a 3dm archive is not being read/written
1     a version 1 3dm archive is being read/written
2     a version 2 3dm archive is being read/written
3     a version 3 3dm archive is being read/written
4     a version 4 3dm archive is being read/written
5     an old version 5 3dm archive is being read
50    a version 5 3dm archive is being read/written.