Rhino.ApplicationSettings.ModelAidSettings.GetCurrentState
Gets the current settings.
Returns: A new model aid state with current settings.

Rhino.ApplicationSettings.ModelAidSettings.GetDefaultState
Gets the factory settings.
Returns: A new model aid state with factory settings.

Rhino.ApplicationSettings.ModelAidSettings.UpdateFromState(Rhino.ApplicationSettings.ModelAidSettingsState)
Updates from a particular setting state.
state: The new states that will be set.

Rhino.ApplicationSettings.ModelAidSettings.GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.

Rhino.ApplicationSettings.ModelAidSettings.ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.

Rhino.ApplicationSettings.ModelAidSettings.AltPlusArrow
true means Alt+arrow is used for nudging.

Rhino.ApplicationSettings.ModelAidSettings.DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.

Rhino.ApplicationSettings.ModelAidSettings.HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.Osnap
Enables or disables Rhino's object snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.SnapToLocked
Gets or sets the locked state of the snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.OrthoAngle
Gets or sets the base orthogonal angle.

Rhino.ApplicationSettings.ModelAidSettings.NudgeKeyStep
Enables or disables Rhino's object snap projection.

Rhino.ApplicationSettings.ModelAidSettings.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nurge step amount.

Rhino.ApplicationSettings.ModelAidSettings.ShiftNudgeKeyStep
Gets or sets the Shift-key based nurge step amount.

Rhino.ApplicationSettings.ModelAidSettings.OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.

Rhino.ApplicationSettings.ModelAidSettings.NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set.

Rhino.ApplicationSettings.ModelAidSettings.ControlPolygonDisplayDensity
Gets or sets the control polygon display density.

Rhino.ApplicationSettings.ModelAidSettings.OsnapCursorMode
Gets or sets the OSnap cursor mode.

Rhino.ApplicationSettings.ModelAidSettings.OsnapModes
Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.

Rhino.ApplicationSettings.ModelAidSettings.MousePickboxRadius
radius of mouse pick box in pixels.

Rhino.ApplicationSettings.ModelAidSettings.PointDisplay
Gets or sets the point display mode.

Rhino.ApplicationSettings.ModelAidSettings.AutoGumballEnabled
When AutoGumball is on, a gumball automatically appears
when objects are prepicked.

Rhino.ApplicationSettings.ModelAidSettings.SnappyGumballEnabled
When SnappyGumball is on, a dragging a gumball moves the center point.
When snappy gumball is off, dragging a gumball moves the mouse down point.