Rhino.Geometry.BoundingBox.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a new boundingbox from two corner points.
min: Point containing all the minimum coordinates.
max: Point containing all the maximum coordinates.

Rhino.Geometry.BoundingBox.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructs a boundingbox from numeric extremes.
minX: Lower extreme for box X size.
minY: Lower extreme for box Y size.
minZ: Lower extreme for box Z size.
maxX: Upper extreme for box X size.
maxY: Upper extreme for box Y size.
maxZ: Upper extreme for box Z size.

Rhino.Geometry.BoundingBox.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a boundingbox from a collection of points.
points: Points to include in the boundingbox.

Rhino.Geometry.BoundingBox.ToString
Constructs the string representation of this aligned boundingbox.
Returns: Text.

Rhino.Geometry.BoundingBox.PointAt(System.Double,System.Double,System.Double)
Evaluates the boundingbox with normalized parameters.
The box has idealized side length of 1x1x1.
tx: Normalized (between 0 and 1 is inside the box) parameter along the X direction.
ty: Normalized (between 0 and 1 is inside the box) parameter along the Y direction.
tz: Normalized (between 0 and 1 is inside the box) parameter along the Z direction.
Returns: The point at the {tx, ty, tz} parameters.

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d)
Finds the closest point on or in the boundingbox.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Finds the closest point on or in the boundingbox.
point: Sample point.
includeInterior: If false, the point is projected onto the boundary faces only,
otherwise the interior of the box is also taken into consideration.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.BoundingBox.FurthestPoint(Rhino.Geometry.Point3d)
Finds the furthest point on the Box.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.

Rhino.Geometry.BoundingBox.Inflate(System.Double)
Inflates the box with equal amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
amount: Amount (in model units) to inflate this box in all directions.

Rhino.Geometry.BoundingBox.Inflate(System.Double,System.Double,System.Double)
Inflate the box with custom amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
xAmount: Amount (in model units) to inflate this box in the x direction.
yAmount: Amount (in model units) to inflate this box in the y direction.
zAmount: Amount (in model units) to inflate this box in the z direction.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d)
Tests a point for boundingbox inclusion. This is the same as calling Contains(point, false)
point: Point to test.
Returns: true if the point is on the inside of or coincident with this boundingbox; otherwise false.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d,System.Boolean)
Tests a point for BoundingBox inclusion.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the BoundingBox.
I.e. coincident points will be considered 'outside'.
Returns:
If 'strict' is affirmative, true if the point is inside this boundingbox; false if it is on the surface or outside.
If 'strict' is negative, true if the point is on the surface or on the inside of the boundingbox; otherwise false.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox)
Determines whether this boundingbox contains another boundingbox.
This is the same as calling Contains(box,false).
box: Box to test.
Returns: true if the box is on the inside of this boundingbox, or is coincident with the surface of it.

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Determines whether this boundingbox contains another boundingbox.
The user can choose how to treat boundingboxes with coincidents surfaces.
box: Box to test.
strict: If true, the box needs to be fully on the inside of the boundingbox.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this BoundingBox.

Rhino.Geometry.BoundingBox.MakeValid
Ensures that the box is defined in an increasing fashion along X, Y and Z axes.
If the Min or Max points are unset, this function will not change the box.
Returns: true if the box was made valid, false if the box could not be made valid.

Rhino.Geometry.BoundingBox.Corner(System.Boolean,System.Boolean,System.Boolean)
Gets one of the eight corners of the box.
minX: true for the minimum on the X axis; false for the maximum.
minY: true for the minimum on the Y axis; false for the maximum.
minZ: true for the minimum on the Z axis; false for the maximum.
Returns: The requested point.

Rhino.Geometry.BoundingBox.IsDegenerate(System.Double)
Determines whether a bounding box is degenerate (flat) in one or more directions.
tolerance:
Distances <= tolerance will be considered to be zero.  If tolerance
is negative (default), then a scale invarient tolerance is used.
Returns:
0 = box is not degenerate
1 = box is a rectangle (degenerate in one direction).
2 = box is a line (degenerate in two directions).
3 = box is a point (degenerate in three directions)
4 = box is not valid.

Rhino.Geometry.BoundingBox.GetCorners
Gets an array filled with the 8 corner points of this box.
See remarks for the return order.
Returns: An array of 8 corners.
Remarks:
[0] Min.X, Min.Y, Min.Z
[1] Max.X, Min.Y, Min.Z
[2] Max.X, Max.Y, Min.Z
[3] Min.X, Max.Y, Min.Z
[4] Min.X, Min.Y, Max.Z
[5] Max.X, Min.Y, Max.Z
[6] Max.X, Max.Y, Max.Z
[7] Min.X, Max.Y, Max.Z

Rhino.Geometry.BoundingBox.GetEdges
Gets an array of the 12 edges of this box.
Returns: If the boundingbox IsValid, the 12 edges; otherwise, null.

Rhino.Geometry.BoundingBox.Transform(Rhino.Geometry.Transform)
Updates this boundingbox to be the smallest axis aligned
boundingbox that contains the transformed result of its 8 original corner
points.
xform: A transform.
Returns: true if this operation is sucessfull; otherwise false.

Rhino.Geometry.BoundingBox.ToBrep
Constructs a Rhino.Geometry.Brep representation of this boundingbox.
Returns: If this operation is sucessfull, a Brep representation of this box; otherwise null.

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox)
Updates this BoundingBox to represent the union of itself and another box.
other: Box to include in this union.
Remarks: If either this BoundingBox or the other BoundingBox is InValid,
the Valid BoundingBox will be the only one included in the union.

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.Point3d)
Updates this BoundingBox to represent the union of itself and a point.
point: Point to include in the union.
Remarks: If this boundingbox is InValid then the union will be
the BoundingBox containing only the point. If the point is InValid,
this BoundingBox will remain unchanged.

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox,Rhino.Geometry.BoundingBox)
Returns a new BoundingBox that represents the union of boxes a and b.
a: First box to include in union.
b: Second box to include in union.
Returns: The BoundingBox that contains both a and b.
Remarks: Invalid boxes are ignored and will not affect the union.

Rhino.Geometry.BoundingBox.Intersection(Rhino.Geometry.BoundingBox,Rhino.Geometry.BoundingBox)
Computes the intersection of two bounding boxes.
a: A first bounding box.
b: A second bounding box.
Returns: The intersection bounding box.

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox,Rhino.Geometry.Point3d)
Returns a new BoundingBox that represents the union of a bounding box and a point.
box: Box to include in the union.
point: Point to include in the union.
Returns: The BoundingBox that contains both the box and the point.
Remarks: Invalid boxes and points are ignored and will not affect the union.

Rhino.Geometry.BoundingBox.Empty
Gets an [Empty] boundingbox. An Empty box is an invalid structure that has negative width.

Rhino.Geometry.BoundingBox.Unset
Gets a boundingbox that has Unset coordinates for Min and Max.

Rhino.Geometry.BoundingBox.IsValid
Gets a value that indicates whether or not this boundingbox is valid.
Empty boxes are not valid, and neither are boxes with unset points.

Rhino.Geometry.BoundingBox.Min
Gets or sets the point in the minimal corner.

Rhino.Geometry.BoundingBox.Max
Gets or sets the point in the maximal corner.

Rhino.Geometry.BoundingBox.Center
Gets the point in the center of the boundingbox.

Rhino.Geometry.BoundingBox.Diagonal
Gets the diagonal vector of this BoundingBox.
The diagonal connects the Min and Max points.