Rhino.Geometry.Collections.MeshTopologyVertexList.TopologyVertexIndex(System.Int32)
Gets the topology vertex index for an existing mesh vertex in the mesh's
VertexList.
vertexIndex: Index of a vertex in the Mesh.Vertices.
Returns: Index of a topology vertex in the Mesh.TopologyVertices.

Rhino.Geometry.Collections.MeshTopologyVertexList.MeshVertexIndices(System.Int32)
Gets all indices of the mesh vertices that a given topology vertex represents.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices to query.
Returns:
Indices of all vertices that in Mesh.Vertices that a topology vertex represents.

Rhino.Geometry.Collections.MeshTopologyVertexList.IndicesFromFace(System.Int32)
Returns TopologyVertexIndices for a given mesh face index.
faceIndex: The index of a face to query.
Returns: An array of vertex indices.

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedTopologyVertices(System.Int32)
Gets all topological vertices that are connected to a given vertex.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all topological vertices that are connected to this topological vertex.
null if no vertices are connected to this vertex.

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedTopologyVertices(System.Int32,System.Boolean)
Gets all topological vertices that are connected to a given vertex.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
sorted: if true, thr vertices are returned in a radially sorted order.
Returns:
Indices of all topological vertices that are connected to this topological vertex.
null if no vertices are connected to this vertex.

Rhino.Geometry.Collections.MeshTopologyVertexList.SortEdges
Sorts the edge list for the mesh topology vertex list so that
the edges are in radial order when you call ConnectedTopologyVertices.
A nonmanifold edge is treated as a boundary edge with respect
to sorting.  If any boundary or nonmanifold edges end at the
vertex, then the first edge will be a boundary or nonmanifold edge.
Returns: true on success.

Rhino.Geometry.Collections.MeshTopologyVertexList.SortEdges(System.Int32)
Sorts the edge list for as single mesh topology vertex so that
the edges are in radial order when you call ConnectedTopologyVertices.
A nonmanifold edge is treated as a boundary edge with respect
to sorting.  If any boundary or nonmanifold edges end at the
vertex, then the first edge will be a boundary or nonmanifold edge.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices>
Returns: true on success.

Rhino.Geometry.Collections.MeshTopologyVertexList.IsHidden(System.Int32)
Returns true if the topological vertex is hidden. The mesh topology
vertex is hidden if and only if all the ON_Mesh vertices it represents is hidden.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
Returns: true if mesh topology vertex is hidden.

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedFaces(System.Int32)
Gets all faces that are connected to a given vertex.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all faces in Mesh.Faces that are connected to this topological vertex.
null if no faces are connected to this vertex.

Rhino.Geometry.Collections.MeshTopologyVertexList.GetEnumerator
Gets an enumerator that yields all topology vertices in this collection.
Returns: The enumerator.

Rhino.Geometry.Collections.MeshTopologyVertexList.Count
Gets or sets the number of mesh topology vertices.