Rhino.Geometry.Vector2d.#ctor(System.Double,System.Double)
Initializes a new instance of the vector based on two, X and Y, components.
x: The X (first) component.
y: The Y (second) component.

Rhino.Geometry.Vector2d.op_Equality(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if components of the two vectors are pairwise equal; otherwise false.

Rhino.Geometry.Vector2d.op_Inequality(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if any component of the two vectors is pairwise different; otherwise false.

Rhino.Geometry.Vector2d.op_LessThan(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.

Rhino.Geometry.Vector2d.op_LessThanOrEqual(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.

Rhino.Geometry.Vector2d.op_GreaterThan(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.

Rhino.Geometry.Vector2d.op_GreaterThanOrEqual(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.

Rhino.Geometry.Vector2d.Equals(Rhino.Geometry.Vector2d)
Determines whether the specified vector has the same value as the present vector.
vector: The specified vector.
Returns: true if vector has the same components as this; otherwise false.

Rhino.Geometry.Vector2d.CompareTo(Rhino.Geometry.Vector2d)
Compares this Rhino.Geometry.Vector2d with another Rhino.Geometry.Vector2d.
Components evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Vector2d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.

Rhino.Geometry.Vector2d.X
Gets or sets the X (first) component of this vector.

Rhino.Geometry.Vector2d.Y
Gets or sets the Y (second) component of this vector.

Rhino.Geometry.Vector2d.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.

Rhino.Geometry.Vector2d.Zero
Gets the value of the vector with components 0,0.

Rhino.Geometry.Vector2d.Unset
Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.