Rhino.FileIO.SerializationOptions.#ctor
Initializes a new instance of the Rhino.FileIO.SerializationOptions class.

Rhino.FileIO.SerializationOptions.RhinoVersion
Gets or sets a value indicating the Rhino version.

Rhino.FileIO.SerializationOptions.WriteUserData
Gets or sets a value indicating whether to write user data.