Rhino.Display.ColorLCH.#ctor(System.Drawing.Color)
Constructs a new instance of ColorLCH that is equivalent to an RGB color.
rgb: RGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorLCH with custom channel values.
lightness: Value of lightness channel. This channel is limited to 0~1.
chroma: Value of chroma channel. This channel is limited to -1~1.
hue: Value of chroma channel. This channel is limited to 0~360.

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorLCH with custom channel values.
alpha: Value of Alpha channel. This channel is limited to 0~1.
lightness: Value of Lightness channel. This channel is limited to 0~1.
chroma: Value of Chroma channel. This channel is limited to -1~1.
hue: Value of Hue channel. This channel is limited to 0~360.

Rhino.Display.ColorLCH.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest LCH equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The LCH equivalent of the HSL color.

Rhino.Display.ColorLCH.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest LCH equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The LCH equivalent of the CMYK color.

Rhino.Display.ColorLCH.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest LCH equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The LCH equivalent of the XYZ color.

Rhino.Display.ColorLCH.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest LCH equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The LCH equivalent of the LAB color.

Rhino.Display.ColorLCH.MakePositive
Ensure the Chromaticity of this color is positive.

Rhino.Display.ColorLCH.L
Gets or sets the Lightness channel.

Rhino.Display.ColorLCH.C
Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.

Rhino.Display.ColorLCH.H
Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.

Rhino.Display.ColorLCH.A
Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.