Rhino.Runtime.AssemblyResolver.AddSearchFolder(System.String)
Register a custom folder with the Assembly Resolver. Folders will be
searched recursively, so this could potentially be a very expensive operation.
If at all possible, you should consider only registering individual files.
folder: Path of folder to include during Assembly Resolver events.

Rhino.Runtime.AssemblyResolver.AddSearchFile(System.String)
Register another file with the Assembly Resolver. File must be a .NET assembly,
so it should probably be a dll, rhp or exe.
file: Path of file to include during Assembly Resolver events.