Rhino.DocObjects.Linetype.Default
Set linetype to default settings.

Rhino.DocObjects.Linetype.AppendSegment(System.Double,System.Boolean)
Adds a segment to the pattern.
length: The length of the segment to be added.
isSolid:
If true, the length is interpreted as a line. If false,
then the length is interpreted as a space.
Returns: Index of the added segment.

Rhino.DocObjects.Linetype.RemoveSegment(System.Int32)
Removes a segment in the linetype.
index: Zero based index of the segment to remove.
Returns: true if the segment index was removed.

Rhino.DocObjects.Linetype.SetSegment(System.Int32,System.Double,System.Boolean)
Sets the length and type of the segment at index.
index: Zero based index of the segment.
length: The length of the segment to be added.
isSolid:
If true, the length is interpreted as a line. If false,
then the length is interpreted as a space.
Returns: true if the operation was successful; otherwise false.

Rhino.DocObjects.Linetype.GetSegment(System.Int32,System.Double@,System.Boolean@)
Gets the segment information at a index.
index: Zero based index of the segment.
length: The length of the segment is assigned to the out parameter during this call.
isSolid:
If the length is interpreted as a line, true is assigned during the call to this out parameter.
If the length is interpreted as a space, then false is assigned during the call to this out parameter.
Throws System.IndexOutOfRangeException: If the index is unacceptable.

Rhino.DocObjects.Linetype.Name
The name of this linetype.

Rhino.DocObjects.Linetype.LinetypeIndex
The index of this linetype.

Rhino.DocObjects.Linetype.PatternLength
Total length of one repeat of the pattern.

Rhino.DocObjects.Linetype.SegmentCount
Number of segments in the pattern.

Rhino.DocObjects.Linetype.Id
Gets the ID of this linetype object.

Rhino.DocObjects.Linetype.IsDeleted
Gets a value indicating whether this linetype has been deleted and is
currently in the Undo buffer.

Rhino.DocObjects.Linetype.IsReference
Gets a value indicting whether this linetype is a referenced linetype.
Referenced linetypes are part of referenced documents.

Rhino.DocObjects.Linetype.IsModified
true if this linetype has been modified by LinetypeTable.ModifyLinetype()
and the modifications can be undone.