Rhino.DocObjects.LinearDimensionObject
Represents a Rhino.Geometry.LinearDimension
that is placed in a document.

Rhino.DocObjects.LinearDimensionObject.DimensionStyle
Gets the Rhino.DocObjects.DimensionStyle
associated with this LinearDimensionObject.