Rhino.Input.Custom.GetTransform.AddTransformObjects(Rhino.Collections.TransformObjectList)
Adds any objects you want transformed and grips you want transformed.
Make sure no duplicates are in the list and that no grip ownwers are
passed in as objects.
list: A custom transform object list.

Rhino.Input.Custom.GetTransform.CalculateTransform(Rhino.Display.RhinoViewport,Rhino.Geometry.Point3d)
Retrieves the final transformation.
Override this virtual function to provide your own custom transformation method.
viewport: A Rhino viewport that the user is using.
point: A point that the user is selecting.
Returns: A transformation matrix value.

Rhino.Input.Custom.GetTransform.GetXform
Gets the Transformation.
Call this after having set up options and so on.
Returns: The result based on user choice.