Rhino.Geometry.Collections.BrepFaceList.ShrinkFaces
Shrinks all the faces in this Brep. Sometimes the surfaces extend far beyond the trimming
boundaries of the Brep Face. This function will remove those portions of the surfaces
that are not used.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces
Splits any faces with creases into G1 pieces.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double)
Splits any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double,System.Boolean)
Splits any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
compact: If true, the Brep will be compacted if possible.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occured,
compare the before and after values of Faces.Count

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFace(System.Int32,System.Double)
Splits a single face into G1 pieces.
faceIndex: The index of the face to split.
kinkTolerance: Tolerance (in radians) to use for crease detection.
Returns: true on success, false on failure.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.

Rhino.Geometry.Collections.BrepFaceList.SplitClosedFaces(System.Int32)
Splits closed surfaces so they are not closed.
minimumDegree:
If the degree of the surface < min_degree, the surface is not split.
In some cases, minimumDegree = 2 is useful to preserve piecewise linear
surfaces.
Returns: true if successful.

Rhino.Geometry.Collections.BrepFaceList.SplitBipolarFaces
Splits surfaces with two singularities, like spheres, so the results
have at most one singularity.
Returns: true if successful.

Rhino.Geometry.Collections.BrepFaceList.Flip(System.Boolean)
Flips the orientation of faces.
onlyReversedFaces:
If true, clears all BrepFace.OrientationIsReversed flags by calling BrepFace.Transpose()
on each face with a true OrientationIsReversed setting.
If false, all of the faces are flipped regardless of their orientation.

Rhino.Geometry.Collections.BrepFaceList.RemoveAt(System.Int32)
Deletes a face at a specified index.
faceIndex: The index of the mesh face.

Rhino.Geometry.Collections.BrepFaceList.ExtractFace(System.Int32)
Extracts a face from a Brep.
faceIndex: A face index
Returns: A brep. This can be null.

Rhino.Geometry.Collections.BrepFaceList.StandardizeFaceSurface(System.Int32)
Standardizes the relationship between a BrepFace and the 3d surface it
uses.  When done, the face will be the only face that references its 3d
surface, and the orientations of the face and 3d surface will be the same.
faceIndex: The index of the face.
Returns: true if successful.

Rhino.Geometry.Collections.BrepFaceList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepFaceList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepFaceList.GetEnumerator
Gets an enumerators that yields Rhino.Geometry.BrepFace objects.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepFaceList.Count
Gets the number of brep faces.