Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.BoundingBox)
Returns true if some portion of a world coordinate bounding box is
potentially visible in the viewing frustum.
bbox: A bounding box that is tested for visibility.
Returns: true if the box is potentially visible; otherwise false.

Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.Point3d)
Deterines if a world coordinate point is visible in the viewing frustum.
point: A point that is tested for visibility.
Returns: true if the point is visible; otherwise false.

Rhino.Display.RhinoViewport.SetClippingPlanes(Rhino.Geometry.BoundingBox)
Sets optimal clipping planes to view objects in a world coordinate 3d bounding box.
box: The bounding box

Rhino.Display.RhinoViewport.SetCameraTarget(Rhino.Geometry.Point3d,System.Boolean)
Set viewport target point. By default the camera location
is translated so that the camera direction vector is parallel
to the vector from the camera location to the target location.
targetLocation: new target location.
updateCameraLocation:
if true, the camera location is translated so that the camera direction
vector is parallel to the vector from the camera location to the target
location.
If false, the camera location is not changed.
Remarks:
In general, Rhino users expect to have the camera direction vector and
the vector from the camera location to the target location to be parallel.
If you use the RhinoViewport functions to set the camera location, camera
direction, and target point, then the relationship between these three
points and vectors is automatically maintained.  If you directly manipulate
the camera properties, then you should carefully set the target by calling
SetTarget() with updateCameraLocation=false.

Rhino.Display.RhinoViewport.SetCameraLocations(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Set viewport camera location and target location. The camera direction vector is
changed so that it is parallel to the vector from the camera location to
the target location.
targetLocation: new target location.
cameraLocation: new camera location.

Rhino.Display.RhinoViewport.SetCameraLocation(Rhino.Geometry.Point3d,System.Boolean)
Set viewport camera location. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction
vector.
cameraLocation: new camera location.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction vector.
If false, the target location is not changed. See the remarks section of
RhinoViewport.SetTarget for important details.

Rhino.Display.RhinoViewport.SetCameraDirection(Rhino.Geometry.Vector3d,System.Boolean)
Set viewport camera direction. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction.
cameraDirection: new camera direction.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction.
If false, the target location is not changed.
See the remarks section of RhinoViewport.SetTarget for important details.

Rhino.Display.RhinoViewport.ConstructionPlane
Simple plane information for this viewport's construction plane. If you want
detailed construction lpane information, use GetConstructionPlane.

Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Sets the construction plane to cplane.
cplane: The constuction plane to set.

Rhino.Display.RhinoViewport.PushConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Pushes the current construction plane on the viewport's
construction plane stack and sets the construction plane
to cplane.
cplane: The constuction plane to push.

Rhino.Display.RhinoViewport.PopConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PushConstructionPlane.
Returns: true if a construction plane was popped.

Rhino.Display.RhinoViewport.NextConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PreviousConstructionPlane.
Returns: true if successful.

Rhino.Display.RhinoViewport.PreviousConstructionPlane
Sets the construction plane to the plane that was
active before the last call to NextConstructionPlane
or SetConstructionPlane.
Returns: true if successful.

Rhino.Display.RhinoViewport.SetProjection(Rhino.Display.DefinedViewportProjection,System.String,System.Boolean)
Set viewport to a defined projection.
projection: The "standard" projection type.
viewName: If not null or empty, the name is set.
updateConstructionPlane: If true, the construction plane is set to the viewport plane.
Returns: true if successful.

Rhino.Display.RhinoViewport.PushViewProjection
Appends the current view projection and target to the viewport's view stack.

Rhino.Display.RhinoViewport.SetViewProjection(Rhino.DocObjects.ViewportInfo,System.Boolean)
Sets the viewport camera projection.
projection: The "standard" projection type.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera location to the target
is parallel to the camera direction vector.  If false, the target location is not changed.
Returns: true on success.

Rhino.Display.RhinoViewport.PopViewProjection
Sets the view projection and target to the settings at the top of
the view stack and removes those settings from the view stack.
Returns: true if there were settings that could be popped from the stack.

Rhino.Display.RhinoViewport.NextViewProjection
Sets the view projection and target to the settings that
were active before the last call to PrevView.
Returns: true if the view stack was popped.

Rhino.Display.RhinoViewport.PreviousViewProjection
Sets the view projection and target to the settings that
were active before the last call to NextViewProjection.
Returns: true if the view stack was popped.

Rhino.Display.RhinoViewport.ZoomExtents
Dollies the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful.

Rhino.Display.RhinoViewport.ZoomExtentsSelected
Dollies the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful.

Rhino.Display.RhinoViewport.ZoomBoundingBox(Rhino.Geometry.BoundingBox)
Zooms the viewport to the given bounding box.
box: The bouding box to zoom.
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.MouseRotateAroundTarget(System.Drawing.Point,System.Drawing.Point)
Rotates the viewport around target.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.MouseRotateCamera(System.Drawing.Point,System.Drawing.Point)
Rotates the view around the camera location.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.KeyboardRotate(System.Boolean,System.Double)
Emulates the keyboard arrow key in terms of interaction.
leftRight: left/right rotate if true, up/down rotate if false.
angleRadians:
If less than 0, rotation is to left or down.
If greater than 0, rotation is to right or up.
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.KeyboardDolly(System.Boolean,System.Double)
Emulates the keyboard arrow key in terms of interaction.
leftRight: left/right dolly if true, up/down dolly if false.
amount: The dolly amount.
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.KeyboardDollyInOut(System.Double)
Emulates the keyboard arrow key in terms of interaction.
amount: The dolly amount.
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean)
Zooms or dollies in order to scale the viewport projection of observed objects.
magnificationFactor: The scale factor.
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean,System.Drawing.Point)
Zooms or dollies in order to scale the viewport projection of observed objects.
magnificationFactor: The scale factor.
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
fixedScreenPoint: A point in the sceen that should remain fixed.
Returns: true if operation succeeded; otherwise false.

Rhino.Display.RhinoViewport.GetPickTransform(System.Int32,System.Int32)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box. This takes a single point and inflates it by
Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define
the screen rectangle.
clientX: The client point X coordinate.
clientY: The client point Y coordinate.
Returns: A transformation matrix.

Rhino.Display.RhinoViewport.GetPickTransform(System.Drawing.Point)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box. This takes a single point and inflates it by
Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define
the screen rectangle.
clientPoint: The client point.
Returns: A transformation matrix.

Rhino.Display.RhinoViewport.GetPickTransform(System.Drawing.Rectangle)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box.
clientRectangle: The client rectangle.
Returns: A transformation matrix.

Rhino.Display.RhinoViewport.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates about the specified axis. A positive rotation angle results
in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: angle of rotation in radians.
rotationAxis: direction of the axis of rotation.
rotationCenter: point on the axis of rotation.
Returns: true if geometry successfully rotated.

Rhino.Display.RhinoViewport.GetCameraFrame(Rhino.Geometry.Plane@)
Gets the camera plane.
frame: A plane is assigned to this out parameter during the call, if the operation succeeded.
Returns: true if current camera orientation is valid.

Rhino.Display.RhinoViewport.GetFrustum(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Gets the view frustum.
left: left < right.
right: left < right.
bottom: bottom < top.
top: bottom < top.
nearDistance: 0 < nearDistance < farDistance.
farDistance: 0 < nearDistance < farDistance.
Returns: true if operation succeeded.

Rhino.Display.RhinoViewport.GetFrustumCenter(Rhino.Geometry.Point3d@)
Returns world coordinates of frustum's center.
center: The center coordinate is assigned to this out parameter if this call succeeds.
Returns: true if the center was successfully computed.

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Point3d,System.Double@)
Gets clipping distance of a point.
point: A 3D point.
distance: A computed distance is assigned to this out parameter if this call succeeds.
Returns:
true if the point is ing the view frustum and near_dist/far_dist were set.
false if the bounding box does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Gets near and far clipping distances of a bounding box.
bbox: The bounding box.
nearDistance: The near distance is assigned to this out parameter during this call.
farDistance: The far distance is assigned to this out parameter during this call.
Returns:
true if the bounding box intersects the view frustum and near_dist/far_dist were set.
false if the bounding box does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Sphere,System.Double@,System.Double@)
Gets near and far clipping distances of a sphere.
sphere: The sphere.
nearDistance: The near distance is assigned to this out parameter during this call.
farDistance: The far distance is assigned to this out parameter during this call.
Returns:
true if the sphere intersects the view frustum and near_dist/far_dist were set.
false if the sphere does not intesect the view frustum.

Rhino.Display.RhinoViewport.GetFrustumNearPlane(Rhino.Geometry.Plane@)
Get near clipping plane.
plane:
near clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the near clipping
plane.
Returns:
true if camera and frustum are valid.

Rhino.Display.RhinoViewport.GetFrustumFarPlane(Rhino.Geometry.Plane@)
Get far clipping plane.
plane:
far clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the far clipping
plane.
Returns:
true if camera and frustum are valid.

Rhino.Display.RhinoViewport.GetFrustumLeftPlane(Rhino.Geometry.Plane@)
Get left world frustum clipping plane.
plane:
frustum left side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.

Rhino.Display.RhinoViewport.GetFrustumRightPlane(Rhino.Geometry.Plane@)
Get right world frustum clipping plane.
plane:
frustum right side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.

Rhino.Display.RhinoViewport.GetFrustumBottomPlane(Rhino.Geometry.Plane@)
Get bottom world frustum clipping plane.
plane:
frustum bottom side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.

Rhino.Display.RhinoViewport.GetFrustumTopPlane(Rhino.Geometry.Plane@)
Get top world frustum clipping plane.
plane:
frustum top side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin isthe point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.

Rhino.Display.RhinoViewport.GetNearRect
Get corners of near clipping plane rectangle.
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure.

Rhino.Display.RhinoViewport.GetFarRect
Get corners of far clipping plane rectangle.
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure.

Rhino.Display.RhinoViewport.GetScreenPort(System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Location of viewport in pixels.  These are provided so you can set the port you are using
and get the appropriate transformations to and from screen space.
portLeft: portLeft != portRight.
portRight: portLeft != portRight.
portBottom: portTop != portBottom.
portTop: portTop != portBottom.
portNear: The viewport near value.
portFar: The viewport far value.
Returns: true if the operation is successful.

Rhino.Display.RhinoViewport.GetTransform(Rhino.DocObjects.CoordinateSystem,Rhino.DocObjects.CoordinateSystem)
Gets a transform from origin coordinate system to a target coordinate system.
sourceSystem: The origin coordinate system.
destinationSystem: The target coordinate system.
Returns:
4x4 transformation matrix (acts on the left)
Identity matrix is returned if this function fails.

Rhino.Display.RhinoViewport.GetFrustumLine(System.Double,System.Double,Rhino.Geometry.Line@)
Gets the world coordinate line in the view frustum that projects to a point on the screen.
screenX: (screenx,screeny) = screen location.
screenY: (screenx,screeny) = screen location.
worldLine:
3d world coordinate line segment starting on the near clipping
plane and ending on the far clipping plane.
Returns:
true if successful.
false if view projection or frustum is invalid.

Rhino.Display.RhinoViewport.GetWorldToScreenScale(Rhino.Geometry.Point3d,System.Double@)
Gets the world to screen size scaling factor at a point in frustum.
pointInFrustum: A point in frustum.
pixelsPerUnit:
scale = number of pixels per world unit at the 3d point.
This out parameter is assigned during this call.
Returns: true if the operation is successful.

Rhino.Display.RhinoViewport.WorldToClient(Rhino.Geometry.Point3d)
Convert a point from world coordinates in the viewport to a 2d screen
point in the local coordinates of the viewport (X/Y of point is relative
to top left corner of viewport on screen)
worldPoint: The 3D point in world coordinates.
Returns: The 2D point on the screen.

Rhino.Display.RhinoViewport.ClearTraceImage
Remove trace image (background bitmap) for this viewport if one exists.

Rhino.Display.RhinoViewport.SetTraceImage(System.String,Rhino.Geometry.Plane,System.Double,System.Double,System.Boolean,System.Boolean)
Set trace image (background bitmap) for this viewport.
bitmapFileName: The bitmap file name.
plane: A picture plane.
width: The picture width.
height: The picture height.
grayscale: true if the picture should be in grayscale.
filtered: true if image should be filtered (bilinear) before displayed.
Returns: true if successful.

Rhino.Display.RhinoViewport.ParentView
Gets the parent view, if there is one
Every RhinoView has an associated RhinoViewport that does all the 3d display work.
Those associated viewports return the RhinoView as their parent view. However,
RhinoViewports are used in other image creating contexts that do not have a parent
RhinoView.  If you call ParentView, you MUST check for NULL return values.

Rhino.Display.RhinoViewport.Id
Unique id for this viewport.

Rhino.Display.RhinoViewport.ChangeCounter
The value of change counter is incremented every time the view projection
or construction plane changes. The user can the mouse and nestable view
manipulation commands to change a view at any time. The value of change
counter can be used to detect these changes in code that is sensitive to
the view projection.

Rhino.Display.RhinoViewport.Size
Gets or sets the height and width of the viewport (in pixels)

Rhino.Display.RhinoViewport.Name
Name associated with this viewport.

Rhino.Display.RhinoViewport.CameraTarget
Viewport target point.

Rhino.Display.RhinoViewport.IsPlanView
true if construction plane z axis is parallel to camera direction.

Rhino.Display.RhinoViewport.CameraUp


Rhino.Display.RhinoViewport.CameraX
Gets the "unit to the right" vector.

Rhino.Display.RhinoViewport.CameraY
Gets the "unit up" vector.

Rhino.Display.RhinoViewport.CameraZ
Gets the unit vector in CameraDirection.

Rhino.Display.RhinoViewport.FrustumAspect
Gets the width/height ratio of the frustum.

Rhino.Display.RhinoViewport.Bounds
Gets the size and location of the viewport, in pixels, relative to the parent view.

Rhino.Display.RhinoViewport.ScreenPortAspect
screen port's width/height.