Rhino.Geometry.Interpolator.#ctor
Constructs a new, empty Interpolator.

Rhino.Geometry.Interpolator.#ctor(System.Int32)
Constructs an empty Interpolator with a certain capacity.
initialCapacity: Number of items this interpolator can store without resizing.

Rhino.Geometry.Interpolator.#ctor(Rhino.Collections.RhinoList{System.Double})
Copy all the numbers from an existing RhinoList.
list: List to mimic.

Rhino.Geometry.Interpolator.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Constructs an Interpolator from a collection of numbers.
collection: Collection of numbers to duplicate.

Rhino.Geometry.Interpolator.#ctor(System.Int32,System.Double)
Constructs a new Interpolator with a specified amount of numbers.
amount: Number of values to add to this Interpolator. Must be equal to or larger than zero.
defaultValue: Number to add.

Rhino.Geometry.Interpolator.InterpolateNearestNeighbour(System.Double)
Sample the list of numbers with Nearest Neighbour interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.

Rhino.Geometry.Interpolator.InterpolateLinear(System.Double)
Sample the list of numbers with linear interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.

Rhino.Geometry.Interpolator.InterpolateCosine(System.Double)
Sample the list of numbers with cosine interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.

Rhino.Geometry.Interpolator.InterpolateCubic(System.Double)
Sample the list of numbers with cubic interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.

Rhino.Geometry.Interpolator.InterpolateCatmullRom(System.Double)
Sample the list of numbers with Catmull-Rom interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.

Rhino.Geometry.Interpolator.Cyclical
Gets or sets a value indicating whether or not the values inside this Interpolator
are to be treated as cyclical (i.e. circular).