Rhino.DocObjects.Tables.HatchPatternTable.Find(System.String,System.Boolean)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch patter to be found.
ignoreDeleted: true means don't search deleted hatch patterns.
Returns: Index of the hatch pattern with the given name. -1 if no hatch pattern found.

Rhino.DocObjects.Tables.HatchPatternTable.Add(Rhino.DocObjects.HatchPattern)
Adds a new hatch pattern with specified definition to the table.
pattern:
definition of new hatch pattern. The information in pattern is copied.
If patern.Name is empty the a unique name of the form "HatchPattern 01"
will be automatically created.
Returns:
>=0 index of new hatch pattern
-1  not added because a hatch pattern with that name already exists or
some other problem occured.

Rhino.DocObjects.Tables.HatchPatternTable.Document
Document that owns this table.

Rhino.DocObjects.Tables.HatchPatternTable.Count
Number of patterns in the table.

Rhino.DocObjects.Tables.HatchPatternTable.CurrentHatchPatternIndex
At all times, there is a "current" hatch pattern.  Unless otherwise
specified, new objects are assigned to the current hatch pattern.
The current hatch pattern is never locked, hidden, or deleted.