Rhino.DocObjects.ObjectAttributes.Duplicate
Constructs a copy of this Rhino.DocObjects.ObjectAttributes instance.
Returns: A new instance on success, or null on failure.

Rhino.DocObjects.ObjectAttributes.HasDisplayModeOverride(System.Guid)
Determines if an object has a display mode override for a given viewport.
viewportId: Id of a Rhino Viewport.
Returns: true if the object has a display mode override for the viewport; otherwise, false.

Rhino.DocObjects.ObjectAttributes.SetDisplayModeOverride(Rhino.Display.DisplayModeDescription)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This version affects the object's display mode for all viewports.
mode: The display mode.
Returns: true if setting was successful.

Rhino.DocObjects.ObjectAttributes.SetDisplayModeOverride(Rhino.Display.DisplayModeDescription,System.Guid)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This version sets a display mode for a specific viewport.
mode: The display mode.
rhinoViewportId: The Rhino viewport ID.
Returns: true on success.

Rhino.DocObjects.ObjectAttributes.RemoveDisplayModeOverride
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This function resets an object to use the viewport's display mode for all
viewports.

Rhino.DocObjects.ObjectAttributes.RemoveDisplayModeOverride(System.Guid)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This function resets an object to use the viewport's display mode.
rhinoViewportId: viewport that display mode overrides should be cleared from.

Rhino.DocObjects.ObjectAttributes.GetGroupList
Returns an array of GroupCount group indices.  If GroupCount is zero, then GetGroupList() returns null.
Returns: An array of group indices. null might be retuned in place of an empty array.

Rhino.DocObjects.ObjectAttributes.AddToGroup(System.Int32)
Adds object to the group with specified index by appending index to
group list.
If the object is already in group, nothing is changed.
groupIndex: The index that will be added.

Rhino.DocObjects.ObjectAttributes.RemoveFromGroup(System.Int32)
removes object from the group with specified index.
If the object is not in the group, nothing is changed.
groupIndex: The index that will be removed.

Rhino.DocObjects.ObjectAttributes.RemoveFromAllGroups
Removes object from all groups.

Rhino.DocObjects.ObjectAttributes.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.DocObjects.ObjectAttributes.GetUserString(System.String)
Gets a user string.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.DocObjects.ObjectAttributes.GetUserStrings
Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
Returns: A collection of key strings and values strings. This

Rhino.DocObjects.ObjectAttributes.Mode
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.

Rhino.DocObjects.ObjectAttributes.IsInstanceDefinitionObject
Use this query to determine if an object is part of an instance definition.

Rhino.DocObjects.ObjectAttributes.Visible
object visibility.

Rhino.DocObjects.ObjectAttributes.LinetypeSource
The Linetype used to display an object is specified in one of two ways.
If LinetypeSource is ON::linetype_from_layer, then the object's layer ON_Layer::Linetype() is used.
If LinetypeSource is ON::linetype_from_object, then value of m_linetype is used.

Rhino.DocObjects.ObjectAttributes.ColorSource
The color used to display an object is specified in one of three ways.
If ColorSource is ON::color_from_layer, then the object's layer ON_Layer::Color() is used.
If ColorSource is ON::color_from_object, then value of m_color is used.
If ColorSource is ON::color_from_material, then the diffuse color of the object's
render material is used.  See ON_3dmObjectAttributes::MaterialSource() to
determine where to get the definition of the object's render material.

Rhino.DocObjects.ObjectAttributes.PlotColorSource
The color used to plot an object on paper is specified in one of three ways.
If PlotColorSource is ON::plot_color_from_layer, then the object's layer ON_Layer::PlotColor() is used.
If PlotColorSource is ON::plot_color_from_object, then value of PlotColor() is used.

Rhino.DocObjects.ObjectAttributes.ObjectId
Every object has a Guid (globally unique identifier, also known as UUID, or universally
unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is Guid.Empty, a
new Guid is created. If the value is not null but it is already used by another object
in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.
This value is the same as the one returned by object.Id.

Rhino.DocObjects.ObjectAttributes.Name
Gets or sets an object optional text name.
More than one object in a model can have the same name and
some objects may have no name.

Rhino.DocObjects.ObjectAttributes.LayerIndex
Gets or sets an associated layer index.
Layer definitions in an OpenNURBS model are stored in a layer table.
The layer table is conceptually an array of ON_Layer classes.  Every
OpenNURBS object in a model is on some layer.  The object's layer
is specified by zero based indicies into the ON_Layer array.

Rhino.DocObjects.ObjectAttributes.LinetypeIndex
Gets or sets the linetype index.
Linetype definitions in an OpenNURBS model are stored in a linetype table.
The linetype table is conceptually an array of ON_Linetype classes. Every
OpenNURBS object in a model references some linetype.  The object's linetype
is specified by zero based indicies into the ON_Linetype array.
Index 0 is reserved for continuous linetype (no pattern).

Rhino.DocObjects.ObjectAttributes.MaterialIndex
Gets or sets the material index.
If you want something simple and fast, set the index of
the rendering material.

Rhino.DocObjects.ObjectAttributes.MaterialSource
Determines if the simple material should come from the object or from it's layer.
High quality rendering plug-ins should use m_rendering_attributes.

Rhino.DocObjects.ObjectAttributes.ObjectColor
If ON::color_from_object == ColorSource, then color is the object's display color.

Rhino.DocObjects.ObjectAttributes.PlotColor
If plot_color_from_object == PlotColorSource, then PlotColor is the object's plotting color.

Rhino.DocObjects.ObjectAttributes.PlotWeight
Plot weight in millimeters.
=0.0 means use the default width
<0.0 means don't plot (visible for screen display, but does not show on plot)

Rhino.DocObjects.ObjectAttributes.ObjectDecoration
Used to indicate an object has a decoration (like an arrowhead on a curve)

Rhino.DocObjects.ObjectAttributes.WireDensity
When a surface object is displayed in wireframe, this controls
how many isoparametric wires are used.
value    number of isoparametric wires
-1       boundary wires (off)
0        boundary and knot wires
1        boundary and knot wires and, if there are no interior knots, a single interior wire.
N>=2     boundary and knot wires and (N+1) interior wires.

Rhino.DocObjects.ObjectAttributes.ViewportId
If ViewportId is nil, the object is active in all viewports. If ViewportId is not nil, then
this object is only active in a specific view. This field is primarily used to assign page
space objects to a specific page, but it can also be used to restrict model space to a
specific view.

Rhino.DocObjects.ObjectAttributes.Space
Starting with V4, objects can be in either model space or page space.
If an object is in page space, then ViewportId is not nil and
identifies the page it is on.

Rhino.DocObjects.ObjectAttributes.GroupCount
number of groups object belongs to.