Rhino.DocObjects.Tables.MaterialTable.Add
Adds a new material to the table based on the default material.
Returns: The position of the new material in the table.

Rhino.DocObjects.Tables.MaterialTable.Add(Rhino.DocObjects.Material)
Adds a new material to the table based on a given material.
material: A model of the material to be added.
Returns: The position of the new material in the table.

Rhino.DocObjects.Tables.MaterialTable.Add(Rhino.DocObjects.Material,System.Boolean)
Adds a new material to the table based on a given material.
material: A model of the material to be added.
reference:
true if this material is supposed to be a reference material.
Reference materials are not saved in the file.
Returns: The position of the new material in the table.

Rhino.DocObjects.Tables.MaterialTable.Find(System.String,System.Boolean)
Finds a meterial with a given name.
materialName: Name of the material to search for. The search ignores case.
ignoreDeletedMaterials: true means don't search deleted materials.
Returns:
>=0 index of the material with the given name
-1  no material has the given name.

Rhino.DocObjects.Tables.MaterialTable.Find(System.Guid,System.Boolean)
Finds a material with a matching id.
materialId: A material ID to be found.
ignoreDeletedMaterials: If true, deleted materials are not checked.
Returns:
>=0 index of the material with the given name
-1  no material has the given name.

Rhino.DocObjects.Tables.MaterialTable.Modify(Rhino.DocObjects.Material,System.Int32,System.Boolean)
Modify material settings.
newSettings: This information is copied.
materialIndex:
zero based index of material to set.  This must be in the range 0 <= layerIndex < MaterialTable.Count.
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if materialIndex is out of range or the settings attempt
to lock or hide the current material.

Rhino.DocObjects.Tables.MaterialTable.DeleteAt(System.Int32)
Removes a material at a specific position from this material table.
materialIndex: The position to be removed.
Returns:
true if successful. false if materialIndex is out of range or the
material cannot be deleted because it is the current material or because
it material contains active geometry.

Rhino.DocObjects.Tables.MaterialTable.Document
Document that owns this table.

Rhino.DocObjects.Tables.MaterialTable.Count
Returns number of materials in the material table, including deleted materials.

Rhino.DocObjects.Tables.MaterialTable.CurrentMaterialIndex
At all times, there is a "current" material.  Unless otherwise
specified, new objects are assigned to the current material.
The current material is never locked, hidden, or deleted.

Rhino.DocObjects.Tables.MaterialTable.CurrentMaterialSource
Gets or sets the current material source.