Rhino.RhinoApp.Write(System.String)
Print formatted text in the command window.

Rhino.RhinoApp.Write(System.String,System.Object)
Print formatted text in the command window.

Rhino.RhinoApp.Write(System.String,System.Object,System.Object)
Print formatted text in the command window.

Rhino.RhinoApp.Write(System.String,System.Object,System.Object,System.Object)
Print formatted text in the command window.

Rhino.RhinoApp.WriteLine
Print a newline in the command window.

Rhino.RhinoApp.WriteLine(System.String)
Print text in the command window.

Rhino.RhinoApp.WriteLine(System.String,System.Object)
Print formatted text with a newline in the command window.

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)
Print formatted text with a newline in the command window.

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object,System.Object)
Print formatted text with a newline in the command window.

Rhino.RhinoApp.SetCommandPrompt(System.String,System.String)
Sets the command prompt in Rhino.
prompt: The new prompt text.
promptDefault:
Text that appears in angle brackets and indicates what will happen if the user pressed ENTER.

Rhino.RhinoApp.SetCommandPrompt(System.String)
Set Rhino command prompt.
prompt: The new prompt text.

Rhino.RhinoApp.ClearCommandHistoryWindow
Clear the text in Rhino's command history window.

Rhino.RhinoApp.SendKeystrokes(System.String,System.Boolean)
Sends a string of printable characters, including spaces, to Rhino's command line.
[in] A string to characters to send to the command line. This can be null.
[in] Append a return character to the end of the string.

Rhino.RhinoApp.SetFocusToMainWindow
Sets the focus to the main window.

Rhino.RhinoApp.ReleaseMouseCapture
Releases the mouse capture.

Rhino.RhinoApp.Exit
Exits, or closes, Rhino.

Rhino.RhinoApp.RunScript(System.String,System.Boolean)
Runs a Rhino command script.
script: [in] script to run.
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.

Rhino.RhinoApp.RunScript(System.String,System.String,System.Boolean)
Runs a Rhino command script.
script: [in] script to run.
mruDisplayString: [in] String to display in the most recent command list.
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.

Rhino.RhinoApp.Wait
Pauses to keep Windows message pump alive so views will update
and windows will repaint.

Rhino.RhinoApp.MainWindow
Gets the Windows interface handle of the main window.
Returns: A interface to the handle.

Rhino.RhinoApp.MainWindowHandle
Gets the WindowHandle of the Rhino main window.

Rhino.RhinoApp.GetPlugInObject(System.Guid)
Gets the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given Id.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching id.
pluginId: Guid for a given plug-in.
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.

Rhino.RhinoApp.GetPlugInObject(System.String)
Gets the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given name.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching name.
plugin: Name of a plug-in.
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.

Rhino.RhinoApp.SdkVersion
Rhino SDK 9 digit SDK version number in the form YYYYMMDDn
Rhino will only load plug-ins that were build with exactly the
same version of the SDK.

Rhino.RhinoApp.SdkServiceRelease
Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn
Service service release of the Rhino SDK supported by this executable. Rhino will only
load plug-ins that require a service release of <= this release number.
For example, SR1 will load all plug-ins made with any SDK released up through and including
the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino
tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe
update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.

Rhino.RhinoApp.ExeVersion
Major version of Rhino executable 4, 5, ...

Rhino.RhinoApp.ExeServiceRelease
Service release version of Rhino executable (0, 1, 2, ...)
The integer is the service release number of Rhino.  For example,
this function returns "0" if Rhino V4SR0 is running and returns
"1" if Rhino V4SR1 is running.

Rhino.RhinoApp.BuildDate
Gets the build date.

Rhino.RhinoApp.VersionControlRevision
McNeel version control revision identifier at the time this version
of Rhino was built.

Rhino.RhinoApp.SerialNumber
Gets the product serial number, as seen in Rhino's ABOUT dialog box.

Rhino.RhinoApp.Name
Gets the application name.

Rhino.RhinoApp.NodeType
Gets license the node type.

Rhino.RhinoApp.InstallationType
Gets the product installation type, as seen in Rhino's ABOUT dialog box.

Rhino.RhinoApp.Rhino2Id
Gets the ID of Rhino 2.

Rhino.RhinoApp.Rhino3Id
Gets the ID of Rhino 3.

Rhino.RhinoApp.Rhino4Id
Gets the ID of Rhino 4.

Rhino.RhinoApp.Rhino5Id
Gets the ID of Rhino 5.

Rhino.RhinoApp.CurrentRhinoId
Gets the current ID of Rhino.

Rhino.RhinoApp.IsRunningAutomated
Is Rhino currently being executed through automation

Rhino.RhinoApp.CommandPrompt
Rhino command prompt.

Rhino.RhinoApp.CommandHistoryWindowText
Text in Rhino's command history window.

Rhino.RhinoApp.MainApplicationWindow
Same as MainWindow function, but provides the concrete class instead of an interface

Rhino.RhinoApp.EscapeKeyPressed
Can add or removed delagates that are raised when the escape key is clicked.

Rhino.RhinoApp.Initialized
Is raised when the apllication is fully initialized.

Rhino.RhinoApp.Closing
Is raised when the application is about to close.

Rhino.RhinoApp.AppSettingsChanged
Is raised when settings are changed.

Rhino.RhinoApp.Idle
Occurs when the application finishes processing and is about to enter the idle state

Rhino.RhinoApp.ToolbarFiles
Collection of currently open toolbar files in the application