Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Transform)
Moves the grip to a new location.
xform:
Transformation appliead to the OriginalLocation point.

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Vector3d)
Moves the grip to a new location.
delta:
Translation applied to the OriginalLocation point.

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Point3d)
Moves the grip to a new location.
newLocation:
New location for grip.

Rhino.DocObjects.GripObject.UndoMove
Undoes any grip moves made by calling Move.

Rhino.DocObjects.GripObject.NeighborGrip(System.Int32,System.Int32,System.Int32,System.Boolean)
Used to get a grip's logical neighbors, like NURBS curve, suface,
and cage control point grips.
directionR:
-1 to go back one grip, +1 to move forward one grip.  For curves, surfaces
and cages, this is the first parameter direction.
directionS:
-1 to go back one grip, +1 to move forward one grip.  For surfaces and
cages this is the second parameter direction.
directionT:
For cages this is the third parameter direction
wrap:
Returns: logical neighbor or null if the is no logical neighbor

Rhino.DocObjects.GripObject.Moved
true if the grip has moved from OriginalLocation.

Rhino.DocObjects.GripObject.Weight
The weight of a NURBS control point grip or RhinoMath.UnsetValue
if the grip is not a NURBS control point grip.