Rhino.Geometry.Polyline.#ctor
Initializes a new empty polyline.

Rhino.Geometry.Polyline.#ctor(System.Int32)
Initializes a new empty polyline with an initial capacity.
initialCapacity: Number of vertices this polyline can contain without resizing.

Rhino.Geometry.Polyline.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new polyline from a collection of points.
collection: Points to copy into the local vertex array.

Rhino.Geometry.Polyline.IsClosedWithinTolerance(System.Double)
Determines whether the polyline is closed, provided a tolerance value.
tolerance: If the distance between the start and end point of the polyline
is less than tolerance, the polyline is considered to be closed.
Returns: true if the polyline is closed to within tolerance, false otherwise.

Rhino.Geometry.Polyline.SegmentAt(System.Int32)
Gets the line segment at the given index.
index: Index of segment to retrieve.
Returns: Line segment at index or Line.Unset on failure.

Rhino.Geometry.Polyline.PointAt(System.Double)
Gets the point on the polyline at the given parameter.
The integer part of the parameter indicates the index of the segment.
t: Polyline parameter.
Returns: The point on the polyline at t.

Rhino.Geometry.Polyline.TangentAt(System.Double)
Gets the unit tangent vector along the polyline at the given parameter.
The integer part of the parameter indicates the index of the segment.
t: Polyline parameter.
Returns: The tangent along the polyline at t.

Rhino.Geometry.Polyline.Trim(Rhino.Geometry.Interval)
Constructs a polyline out of a parameter subdomain in this curve.
domain: The subdomain of the polyline.
The integer part of the domain parameters indicate the index of the segment.
Returns: The polyline as defined by the subdomain, or null on failure.

Rhino.Geometry.Polyline.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the polyline which is closest to a test-point.
testPoint: Point to approximate.
Returns: The point on the polyline closest to testPoint.

Rhino.Geometry.Polyline.ClosestParameter(Rhino.Geometry.Point3d)
Gets the parameter along the polyline which is closest to a test-point.
testPoint: Point to approximate.
Returns: The parameter along the polyline closest to testPoint.

Rhino.Geometry.Polyline.GetSegments
Constructs an array of line segments that make up the entire polyline.
Returns: An array of line segments or null if the polyline contains fewer than 2 points.

Rhino.Geometry.Polyline.ToNurbsCurve
Constructs a nurbs curve representation of this polyline.
Returns: A Nurbs curve shaped like this polyline or null on failure.

Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)
Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
tolerance: Vertices closer together than tolerance will be removed.
Returns: Number of points (and segments) removed.

Rhino.Geometry.Polyline.CollapseShortSegments(System.Double)
Collapses all segments until none are shorter than tolerance.
This function is significantly slower than DeleteShortSegments,
since it recursively operates on the shortest segment.
When a segment is collapsed the end-points are placed in the center of the segment.
tolerance: Tolerance to use during collapsing.
Returns: The number of segments that were collapsed.
Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)

Rhino.Geometry.Polyline.ReduceSegments(System.Double)
Constructs a reduction of this polyline by recursively removing the least significant segments.
tolerance: Tolerance for reduction. Whenever a vertex of the polyline is more
significant than tolerance, it will be included in the reduction.
Returns: The number of vertices that disappeared due to reduction.

Rhino.Geometry.Polyline.Smooth(System.Double)
Smoothens the polyline segments by averaging adjacent vertices.
Smoothing requires a polyline with exclusively valid vertices.
amount: Amount to smooth. Zero equals no smoothing, one equals complete smoothing.
Returns: true on success, false on failure.

Rhino.Geometry.Polyline.BreakAtAngles(System.Double)
Breaks this polyline into sections at sharp kinks.
Closed polylines will also be broken at the first and last vertex.
angle: Angle (in radians) between adjacent segments for a break to occur.
Returns: An array of polyline segments, or null on error.

Rhino.Geometry.Polyline.CenterPoint
Compute the center point of the polyline as the weighted average of all segments.
Returns: The weighted average of all segments.

Rhino.Geometry.Polyline.TriangulateClosedPolyline
Attempts to create a list of triangles which represent a
triangulation of a closed polyline
Returns:

Rhino.Geometry.Polyline.IsValid
Gets a value that indicates whether this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed polylines with only two segments are also not considered valid.

Rhino.Geometry.Polyline.SegmentCount
Gets the number of segments for this polyline.

Rhino.Geometry.Polyline.IsClosed
Gets a value that indicates whether this polyline is closed.
The polyline is considered to be closed if its start is
identical to its endpoint.
Rhino.Geometry.Polyline.IsClosedWithinTolerance(System.Double)

Rhino.Geometry.Polyline.Length
Gets the total length of the polyline.