Rhino.Geometry.Transform.#ctor(System.Double)
Initializes a new transform matrix with a specified value along the diagonal.
diagonalValue: Value to assign to all diagonal cells except M33 which is set to 1.0.

Rhino.Geometry.Transform.Translation(Rhino.Geometry.Vector3d)
Constructs a new translation (move) transformation.
motion: Translation (motion) vector.
Returns: A transform matrix which moves geometry along the motion vector.

Rhino.Geometry.Transform.Translation(System.Double,System.Double,System.Double)
Constructs a new translation (move) tranformation.
Right column is (dx, dy, dz, 1.0).
dx: Distance to translate (move) geometry along the world X axis.
dy: Distance to translate (move) geometry along the world Y axis.
dz: Distance to translate (move) geometry along the world Z axis.
Returns: A transform matrix which moves geometry with the specified distances.

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Point3d,System.Double)
Constructs a new uniform scaling transformation with a specified scaling anchor point.
anchor: Defines the anchor point of the scaling operation.
scaleFactor: Scaling factor in all directions.
Returns: A transform matrix which scales geometry uniformly around the anchor point.

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Plane,System.Double,System.Double,System.Double)
Constructs a new non-uniform scaling transformation with a specified scaling anchor point.
plane: Defines the center and orientation of the scaling operation.
xScaleFactor: Scaling factor along the anchor plane X-Axis direction.
yScaleFactor: Scaling factor along the anchor plane Y-Axis direction.
zScaleFactor: Scaling factor along the anchor plane Z-Axis direction.
Returns: A transformation matrix which scales geometry non-uniformly.

Rhino.Geometry.Transform.Rotation(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
sinAngle: Sin of the rotation angle.
cosAngle: Cos of the rotation angle.
rotationAxis: Axis direction of rotation.
rotationCenter: Center point of rotation.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle and rotation center.
angleRadians: Angle (in Radians) of the rotation.
rotationCenter: Center point of rotation. Rotation axis is vertical.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
angleRadians: Angle (in Radians) of the rotation.
rotationAxis: Axis direction of rotation operation.
rotationCenter: Center point of rotation. Rotation axis is vertical.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with start and end directions and rotation center.
startDirection: A start direction.
endDirection: An end direction.
rotationCenter: A rotation center.
Returns: A transformation matrix which rotates geometry around an anchor point.

Rhino.Geometry.Transform.Rotation(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1.
x0: First "from" vector.
y0: Second "from" vector.
z0: Third "from" vector.
x1: First "to" vector.
y1: Second "to" vector.
z1: Third "to" vector.
Returns: A rotation transformation value.

Rhino.Geometry.Transform.Mirror(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Create mirror transformation matrix
The mirror transform maps a point Q to
Q - (2*(Q-P)oN)*N, where
P = pointOnMirrorPlane and N = normalToMirrorPlane.
pointOnMirrorPlane: Point on the mirror plane.
normalToMirrorPlane: Normal vector to the mirror plane.
Returns: A transformation matrix which mirrors geometry in a specified plane.

Rhino.Geometry.Transform.Mirror(Rhino.Geometry.Plane)
Constructs a new Mirror transformation.
mirrorPlane: Plane that defines the mirror orientation and position.
Returns: A transformation matrix which mirrors geometry in a specified plane.

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
plane0: Coordinate system in which the geometry is currently described.
plane1: Target coordinate system in which we want the geometry to be described.
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure.

Rhino.Geometry.Transform.PlaneToPlane(Rhino.Geometry.Plane,Rhino.Geometry.Plane)


Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
initialBasisX: can be any 3d basis.
initialBasisY: can be any 3d basis.
initialBasisZ: can be any 3d basis.
finalBasisX: can be any 3d basis.
finalBasisY: can be any 3d basis.
finalBasisZ: can be any 3d basis.
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure.

Rhino.Geometry.Transform.PlanarProjection(Rhino.Geometry.Plane)
Constructs a projection transformation.
plane: Plane onto which everything will be perpendicularly projected.
Returns: A transformation matrix which projects geometry onto a specified plane.

Rhino.Geometry.Transform.Shear(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a Shear transformation.
plane: Base plane for shear.
x: Shearing vector along plane x-axis.
y: Shearing vector along plane y-axis.
z: Shearing vector along plane z-axis.
Returns: A transformation matrix which shear geometry.

Rhino.Geometry.Transform.op_Equality(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Determines if two transformations are equal in value.
a: A tranform.
b: Another tranform.
Returns: true if transforms are equal; otherwise false.

Rhino.Geometry.Transform.op_Inequality(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Determines if two transformations are different in value.
a: A tranform.
b: Another tranform.
Returns: true if transforms are different; otherwise false.

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiplies (combines) two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply A then B.

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Point3d)
Multiplies a transformation by a point and gets a new point.
m: A transformation.
p: A point.
Returns: The tranformed point.

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d)
Multiplies a transformation by a vector and gets a new vector.
m: A transformation.
v: A vector.
Returns: The tranformed vector.

Rhino.Geometry.Transform.Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply A then B.

Rhino.Geometry.Transform.TransformBoundingBox(Rhino.Geometry.BoundingBox)
Computes a new boundingbox that is the smallest axis aligned
boundingbox that contains the transformed result of its 8 original corner
points.
Returns: A new bounding box.

Rhino.Geometry.Transform.TransformList(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Given a list, an array or any enumerable set of points, computes a new array of tranformed points.
points: A list, an array or any enumerable set of points to be left untouched and copied.
Returns: A new array.

Rhino.Geometry.Transform.Equals(Rhino.Geometry.Transform)
Determines if another transform equals this transform value.
other: Another transform.
Returns: true if other has the same value as this transform; otherwise, false.

Rhino.Geometry.Transform.TryGetInverse(Rhino.Geometry.Transform@)
Attempts to get the inverse transform of this transform.
inverseTransform: The inverse transform. This out reference will be assigned during this call.
Returns:
true on success.
If false is returned and this Transform is Invalid, inserveTransform will be set to this Transform.
If false is returned and this Transform is Valid, inverseTransform will be set to a pseudo inverse.

Rhino.Geometry.Transform.CompareTo(Rhino.Geometry.Transform)
Compares this transform with another transform.
M33 has highest value, then M32, etc..
other: Another transform.
Returns: -1 if this < other; 0 if both are equal; 1 otherwise.

Rhino.Geometry.Transform.Identity
Gets a new identity transform matrix. An identity matrix defines no transformation.

Rhino.Geometry.Transform.Unset
Gets an XForm filled with RhinoMath.UnsetValue.

Rhino.Geometry.Transform.M00
Gets or sets this[0,0].

Rhino.Geometry.Transform.M01
Gets or sets this[0,1].

Rhino.Geometry.Transform.M02
Gets or sets this[0,2].

Rhino.Geometry.Transform.M03
Gets or sets this[0,3].

Rhino.Geometry.Transform.M10
Gets or sets this[1,0].

Rhino.Geometry.Transform.M11
Gets or sets this[1,1].

Rhino.Geometry.Transform.M12
Gets or sets this[1,2].

Rhino.Geometry.Transform.M13
Gets or sets this[1,3].

Rhino.Geometry.Transform.M20
Gets or sets this[2,0].

Rhino.Geometry.Transform.M21
Gets or sets this[2,1].

Rhino.Geometry.Transform.M22
Gets or sets this[2,2].

Rhino.Geometry.Transform.M23
Gets or sets this[2,3].

Rhino.Geometry.Transform.M30
Gets or sets this[3,0].

Rhino.Geometry.Transform.M31
Gets or sets this[3,1].

Rhino.Geometry.Transform.M32
Gets or sets this[3,2].

Rhino.Geometry.Transform.M33
Gets or sets this[3,3].

Rhino.Geometry.Transform.Item(System.Int32,System.Int32)
Gets or sets the matrix value at the given row and column indixes.
row: Index of row to access, must be 0, 1, 2 or 3.
column: Index of column to access, must be 0, 1, 2 or 3.
Returns: The value at [row, column]
The new value at [row, column]

Rhino.Geometry.Transform.IsValid
Gets a value indicating whether or not this Transform is a valid matrix.
A valid transform matrix is not allowed to have any invalid numbers.

Rhino.Geometry.Transform.SimilarityType
Gets a value indicating whether or not the Transform maintains similarity.
The easiest way to think of Similarity is that any circle, when transformed,
remains a circle. Whereas a non-similarity Transform deforms circles into ellipses.

Rhino.Geometry.Transform.Determinant
The determinant of this 4x4 matrix.