Rhino.DocObjects.Custom.UserData.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.DocObjects.Custom.UserData.Copy(Rhino.Runtime.CommonObject,Rhino.Runtime.CommonObject)
Expert user tool that copies user data that has a positive
CopyCount from the source object to a destination object.
Generally speaking you don't need to use Copy().
Simply rely on things like the copy constructors to do the right thing.
source: A source object for the data.
destination: A destination object for the data.

Rhino.DocObjects.Custom.UserData.MoveUserDataFrom(Rhino.Runtime.CommonObject)
Moves the user data from objectWithUserData to a temporary data storage
identifierd by the return Guid.  When MoveUserDataFrom returns, the
objectWithUserData will not have any user data.
objectWithUserData: Object with user data attached.
Returns:
Guid identifier for storage of UserData that is held in a temporary list
by this class. This function should be used in conjunction with MoveUserDataTo
to transfer the user data to a different object.
Returns Guid.Empty if there was no user data to transfer.

Rhino.DocObjects.Custom.UserData.MoveUserDataTo(Rhino.Runtime.CommonObject,System.Guid,System.Boolean)
Moves the user data.
See Rhino.DocObjects.Custom.UserData.MoveUserDataFrom(Rhino.Runtime.CommonObject) for more information.
objectToGetUserData: Object data source.
id: Target.
append: If the data should be appended or replaced.

Rhino.DocObjects.Custom.UserData.Description
Descriptive name of the user data.

Rhino.DocObjects.Custom.UserData.ShouldWrite
If you want to save this user data in a 3dm file, override
ShouldWrite and return true.  If you do support serialization,
you must also override the Read and Write functions.

Rhino.DocObjects.Custom.UserData.Transform
Updated if user data is attached to a piece of geometry that is
transformed and the virtual OnTransform() is not overridden.  If you
override OnTransform() and want Transform to be updated, then call the
base class OnTransform() in your override.
The default constructor sets Transform to the identity.