Rhino.ApplicationSettings.CursorTooltipSettingsState.TooltipsEnabled
Turns on/off cursor tooltips.

Rhino.ApplicationSettings.CursorTooltipSettingsState.Offset
The x and y distances in pixels from the cursor location to the tooltip.

Rhino.ApplicationSettings.CursorTooltipSettingsState.BackgroundColor
Tooltip background color.

Rhino.ApplicationSettings.CursorTooltipSettingsState.TextColor
Tooltip text color.

Rhino.ApplicationSettings.CursorTooltipSettingsState.OsnapPane
Displays the current object snap selection.

Rhino.ApplicationSettings.CursorTooltipSettingsState.DistancePane
Displays the distance from the last picked point.

Rhino.ApplicationSettings.CursorTooltipSettingsState.PointPane
Displays the current construction plane coordinates.

Rhino.ApplicationSettings.CursorTooltipSettingsState.RelativePointPane
Displays the relative construction plane coordinates and angle from the last picked point.

Rhino.ApplicationSettings.CursorTooltipSettingsState.CommandPromptPane
Displays the current command prompt.

Rhino.ApplicationSettings.CursorTooltipSettingsState.AutoSuppress
Attempts to display only the most useful tooltip.