Rhino.Geometry.TextDot.#ctor(System.String,Rhino.Geometry.Point3d)
Initializes a new textdot based on the text and the location.
text: Text.
location: A position.

Rhino.Geometry.TextDot.Point
Gets or sets the position of the textdot.

Rhino.Geometry.TextDot.Text
Gets or sets the text of the textdot.