Rhino.Geometry.Interval.#ctor(System.Double,System.Double)
Initializes a new instance of the Rhino.Geometry.Interval class.
t0: The first value.
t1: The second value.

Rhino.Geometry.Interval.#ctor(Rhino.Geometry.Interval)
Initializes a new instance copying the other instance values.
other: The Rhino.Geometry.Interval to use as a base.

Rhino.Geometry.Interval.op_Equality(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the two Intervals have equal values.
a: The first interval.
b: The second interval.
Returns: true if the components of the two intervals are exactly equal; otherwise false.

Rhino.Geometry.Interval.op_Inequality(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the two Intervals have different values.
a: The first interval.
b: The second interval.
Returns: true if the two intervals are different in any value; false if they are equal.

Rhino.Geometry.Interval.op_Subtraction(Rhino.Geometry.Interval,System.Double)
Shifts an interval by a specific amount (subtraction).
interval: The base interval (minuend).
number: The shifting value to be subtracted (subtrahend).
Returns: A new interval with [T0-number, T1-number].

Rhino.Geometry.Interval.op_Subtraction(System.Double,Rhino.Geometry.Interval)
Shifts an interval by a specific amount (subtraction).
number: The shifting value to subtract from (minuend).
interval: The interval to be subtracted from (subtrahend).
Returns: A new interval with [number-T0, number-T1].

Rhino.Geometry.Interval.op_LessThan(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the first specified Rhino.Geometry.Interval comes before
(has inferior sorting value than) the second Interval.
The lower bound has first evaluation priority.
a: First interval.
b: Second interval.
Returns: true if a[0] is smaller than b[0], or a[0] == b[0] and a[1] is smaller than b[1]; otherwise, false.

Rhino.Geometry.Interval.op_LessThanOrEqual(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the first specified Rhino.Geometry.Interval comes before
(has inferior sorting value than) the second Interval, or is equal to it.
The lower bound has first evaluation priority.
a: First interval.
b: Second interval.
Returns: true if a[0] is smaller than b[0], or a[0] == b[0] and a[1] is smaller than or equal to b[1]; otherwise, false.

Rhino.Geometry.Interval.op_GreaterThan(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the first specified Rhino.Geometry.Interval comes after
(has superior sorting value than) the second Interval.
The lower bound has first evaluation priority.
a: First interval.
b: Second interval.
Returns: true if a[0] is larger than b[0], or a[0] == b[0] and a[1] is larger than b[1]; otherwise, false.

Rhino.Geometry.Interval.op_GreaterThanOrEqual(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Determines whether the first specified Rhino.Geometry.Interval comes after
(has superior sorting value than) the second Interval, or is equal to it.
The lower bound has first evaluation priority.
a: First interval.
b: Second interval.
Returns: true if a[0] is larger than b[0], or a[0] == b[0] and a[1] is larger than or equal to b[1]; otherwise, false.

Rhino.Geometry.Interval.Equals(Rhino.Geometry.Interval)
Determines whether the specified Rhino.Geometry.Interval is equal to the current Rhino.Geometry.Interval,
comparing by value.
other: The other interval to compare with.
Returns: true if obj is an Rhino.Geometry.Interval and has the same bounds; false otherwise.

Rhino.Geometry.Interval.CompareTo(Rhino.Geometry.Interval)
Compares this Rhino.Geometry.Interval with another interval.
The lower bound has first evaluation priority.
other: The other Rhino.Geometry.Interval to compare with.
Returns:
0: if this is identical to other
-1: if this[0] < other[0]
+1: if this[0] > other[0]
-1: if this[0] == other[0] and this[1] < other[1]
+1: if this[0] == other[0] and this[1] > other[1].

Rhino.Geometry.Interval.Grow(System.Double)
Grows the Rhino.Geometry.Interval to include the given number.
value: Number to include in this interval.

Rhino.Geometry.Interval.MakeIncreasing
Ensures this Rhino.Geometry.Interval is either singleton or increasing.

Rhino.Geometry.Interval.Reverse
Changes interval to [-T1, -T0].

Rhino.Geometry.Interval.Swap
Exchanges T0 and T1.

Rhino.Geometry.Interval.ParameterAt(System.Double)
Converts normalized parameter to interval value, or pair of values.
Returns: Interval parameter min*(1.0-normalizedParameter) + max*normalizedParameter.
NormalizedParameterAt

Rhino.Geometry.Interval.ParameterIntervalAt(Rhino.Geometry.Interval)
Converts normalized parameter to interval value, or pair of values.
Returns: Interval parameter min*(1.0-normalizedParameter) + max*normalized_paramete.
NormalizedParameterAt

Rhino.Geometry.Interval.NormalizedParameterAt(System.Double)
Converts interval value, or pair of values, to normalized parameter.
Returns: Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
ParameterAt

Rhino.Geometry.Interval.NormalizedIntervalAt(Rhino.Geometry.Interval)
Converts interval value, or pair of values, to normalized parameter.
Returns: Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
ParameterAt

Rhino.Geometry.Interval.IncludesParameter(System.Double)
Tests a parameter for Interval inclusion.
t: Parameter to test.
Returns: true if t is contained within or is coincident with the limits of this Interval.

Rhino.Geometry.Interval.IncludesParameter(System.Double,System.Boolean)
Tests a parameter for Interval inclusion.
t: Parameter to test.
strict: If true, the parameter must be fully on the inside of the Interval.
Returns: true if t is contained within the limits of this Interval.

Rhino.Geometry.Interval.IncludesInterval(Rhino.Geometry.Interval)
Tests another interval for Interval inclusion.
interval: Interval to test.
Returns: true if the other interval is contained within or is coincident with the limits of this Interval; otherwise false.

Rhino.Geometry.Interval.IncludesInterval(Rhino.Geometry.Interval,System.Boolean)
Tests another interval for Interval inclusion.
interval: Interval to test.
strict: If true, the other interval must be fully on the inside of the Interval.
Returns: true if the other interval is contained within the limits of this Interval; otherwise false.

Rhino.Geometry.Interval.FromIntersection(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Returns a new Interval that is the Intersection of the two input Intervals.
a: The first input interval.
b: The second input interval.
Returns: If the intersection is not empty, then
intersection = [max(a.Min(),b.Min()), min(a.Max(),b.Max())]
The interval [ON.UnsetValue,ON.UnsetValue] is considered to be
the empty set interval.  The result of any intersection involving an
empty set interval or disjoint intervals is the empty set interval.

Rhino.Geometry.Interval.FromUnion(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Returns a new Interval which contains both inputs.
a: The first input interval.
b: The second input interval.
Returns: The union of an empty set and an increasing interval is the increasing interval.
The union of two empty sets is empty.
The union of an empty set an a non-empty interval is the non-empty interval.
The union of two non-empty intervals is [min(a.Min(),b.Min()), max(a.Max(),b.Max())]

Rhino.Geometry.Interval.Unset
Gets an Interval whose limits are RhinoMath.UnsetValue.

Rhino.Geometry.Interval.T0
Gets or sets the lower bound of the Interval.

Rhino.Geometry.Interval.T1
Gets or sets the upper bound of the Interval.

Rhino.Geometry.Interval.Min
Gets the smaller of T0 and T1.

Rhino.Geometry.Interval.Max
Gets the larger of T0 and T1.

Rhino.Geometry.Interval.Mid
Gets the average of T0 and T1.

Rhino.Geometry.Interval.Length
Gets the signed length of the numeric range.
If the interval is decreasing, a negative length will be returned.

Rhino.Geometry.Interval.IsValid
Gets a value indicating whether or not this Interval is valid.
Valid intervals must contain valid numbers.

Rhino.Geometry.Interval.IsSingleton
Returns true if T0 == T1 != ON.UnsetValue.

Rhino.Geometry.Interval.IsIncreasing
Returns true if T0 < T1.

Rhino.Geometry.Interval.IsDecreasing
Returns true if T[0] > T[1].