Rhino.Geometry.CurveOrientation
Defines enumerated values for closed curve orientations.

Rhino.Geometry.CurveOrientation.Undefined
Orientation is undefined.

Rhino.Geometry.CurveOrientation.Clockwise
The curve's orientation is clockwise in the xy plane.

Rhino.Geometry.CurveOrientation.CounterClockwise
The curve's orientation is counter clockwise in the xy plane.