Rhino.ApplicationSettings.FileSettings.GetDefaultState
Returns the default state.
Returns: A new instance containing the default state.

Rhino.ApplicationSettings.FileSettings.GetCurrentState
Returns the current state.
Returns: A new instance containing the current state.

Rhino.ApplicationSettings.FileSettings.GetDataFolder(System.Boolean)
Gets the data folder for machine or current user.
currentUser: true if the query relates to the current user.
Returns: A directory to user or machine data.

Rhino.ApplicationSettings.FileSettings.RecentlyOpenedFiles
Returns a list of recently opened files. Note that this function does not
check to make sure that these files still exist.
Returns: An array of strings with the paths to the recently opened files.

Rhino.ApplicationSettings.FileSettings.AddSearchPath(System.String,System.Int32)
Adds a new imagePath to Rhino's search imagePath list.
See "Options Files settings" in the Rhino help file for more details.
[in] The valid folder, or imagePath, to add.
[in] A zero-based position index in the search imagePath list to insert the string.
If -1, the imagePath will be appended to the end of the list.
Returns:
The index where the item was inserted if success.
-1 on failure.

Rhino.ApplicationSettings.FileSettings.DeleteSearchPath(System.String)
Removes an existing imagePath from Rhino's search imagePath list.
See "Options Files settings" in the Rhino help file for more details.
[in] The valid folder, or imagePath, to remove.
Returns: true or false indicating success or failure.

Rhino.ApplicationSettings.FileSettings.FindFile(System.String)
Searches for a file using Rhino's search imagePath. Rhino will look for a file in the following locations:
1. The current document's folder.
2. Folder's specified in Options dialog, File tab.
3. Rhino's System folders.
fileName: short file name to search for.
Returns:  full imagePath on success; null on error.

Rhino.ApplicationSettings.FileSettings.GetSearchPaths
Returns all of the imagePath items in Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.

Rhino.ApplicationSettings.FileSettings.AutoSaveBeforeCommands
Input list of commands that force AutoSave prior to running.

Rhino.ApplicationSettings.FileSettings.SetAutoSaveBeforeCommands(System.String[])
Set list of commands that force AutoSave prior to running.

Rhino.ApplicationSettings.FileSettings.SearchPathCount
Gets the amount of search paths that are currently defined.

Rhino.ApplicationSettings.FileSettings.WorkingFolder
Returns or sets Rhino's working directory, or folder.
The working folder is the default folder for all file operations.

Rhino.ApplicationSettings.FileSettings.TemplateFolder
Returns or sets the location of Rhino's template files.

Rhino.ApplicationSettings.FileSettings.TemplateFile
Returns or sets the location of Rhino's template file.

Rhino.ApplicationSettings.FileSettings.AutoSaveFile
the file name used by Rhino's automatic file saving mechanism.

Rhino.ApplicationSettings.FileSettings.AutoSaveInterval
how often the document will be saved when Rhino's automatic file saving mechanism is enabled.

Rhino.ApplicationSettings.FileSettings.AutoSaveEnabled
Enables or disables Rhino's automatic file saving mechanism.

Rhino.ApplicationSettings.FileSettings.AutoSaveMeshes
save render and display meshes in autosave file.

Rhino.ApplicationSettings.FileSettings.SaveViewChanges
true for users who consider view changes a document change.

Rhino.ApplicationSettings.FileSettings.FileLockingEnabled
Ensure that only one person at a time can have a file open for saving.

Rhino.ApplicationSettings.FileSettings.FileLockingOpenWarning
Gets or sets whether to display the information dialog which identifies computer files.

Rhino.ApplicationSettings.FileSettings.CreateBackupFiles
Gets or sets a value that controls the creation of backup files.

Rhino.ApplicationSettings.FileSettings.ClipboardCopyToPreviousRhinoVersion
Gets or sets a value that decides if copies to the clipboard are performed in both the current
and previous Rhino clipboard formats.  This means you will double the size of what is saved in
the clipboard but will be able to copy from the current to the previous version using the
clipboard.

Rhino.ApplicationSettings.FileSettings.ClipboardOnExit
Gets or sets a value that determines what to do with clipboad data on exit.

Rhino.ApplicationSettings.FileSettings.ExecutableFolder
Returns the directory where the main Rhino executable is located.

Rhino.ApplicationSettings.FileSettings.InstallFolder
Returns Rhino's installation folder.

Rhino.ApplicationSettings.FileSettings.HelpFilePath
Gets the Rhino help file path.

Rhino.ApplicationSettings.FileSettings.DefaultRuiFile
Gets the path to the default RUI file.