Rhino.FileIO.File3dmPlugInDataTable.Dump
Prepares a text dump of table.
Returns: A string containing the dump.

Rhino.FileIO.File3dmPlugInDataTable.Clear
Remove all entries from this table

Rhino.FileIO.File3dmPlugInDataTable.GetEnumerator
Gets the enumerator that visits any Rhino.FileIO.File3dmPlugInData in this table.
Returns: The enumerator.

Rhino.FileIO.File3dmPlugInDataTable.Count
Gets the number of File3dmPlugInData in this table.

Rhino.FileIO.File3dmPlugInDataTable.Item(System.Int32)
Gets the File3dmPlugInData at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of File3dmPlugInData to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The File3dmPlugInData at [index].