Rhino.ApplicationSettings.CursorTooltipSettings.GetCurrentState
Gets the current settings.
Returns: A new cursor tooltip state with current settings.

Rhino.ApplicationSettings.CursorTooltipSettings.GetDefaultState
Gets the cursor tooltip factory settings.
Returns: A new cursor tooltip state with factory settings.

Rhino.ApplicationSettings.CursorTooltipSettings.TooltipsEnabled
Turns on/off cursor tooltips.

Rhino.ApplicationSettings.CursorTooltipSettings.Offset
The x and y distances in pixels from the cursor location to the tooltip.

Rhino.ApplicationSettings.CursorTooltipSettings.BackgroundColor
Tooltip background color.

Rhino.ApplicationSettings.CursorTooltipSettings.TextColor
Tooltip text color.

Rhino.ApplicationSettings.CursorTooltipSettings.OsnapPane
Displays the current object snap selection.

Rhino.ApplicationSettings.CursorTooltipSettings.DistancePane
Displays the distance from the last picked point.

Rhino.ApplicationSettings.CursorTooltipSettings.PointPane
Displays the current construction plane coordinates.

Rhino.ApplicationSettings.CursorTooltipSettings.RelativePointPane
Displays the relative construction plane coordinates and angle from the last picked point.

Rhino.ApplicationSettings.CursorTooltipSettings.CommandPromptPane
Displays the current command prompt.

Rhino.ApplicationSettings.CursorTooltipSettings.AutoSuppress
Attempts to display only the most useful tooltip.