Rhino.Geometry.SweepOneRail
Utility class for generating breps by sweeping cross section curves over
a single rail curve.

Rhino.Geometry.SweepOneRail.#ctor


Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})


Rhino.Geometry.SweepOneRail.MiterType
0: don't miter,  1: intersect surfaces and trim sweeps,  2: rotate shapes at kinks and don't trim.

Rhino.Geometry.SweepOneRail.ClosedSweep
If the input rail is closed, ClosedSweep determines if the swept breps will also
be closed.