Rhino.Geometry.Collections.MeshVertexList.Clear
Clear the Vertex list on the mesh.

Rhino.Geometry.Collections.MeshVertexList.Add(System.Single,System.Single,System.Single)
Adds a new vertex to the end of the Vertex list.
x: X component of new vertex coordinate.
y: Y component of new vertex coordinate.
z: Z component of new vertex coordinate.
Returns: The index of the newly added vertex.

Rhino.Geometry.Collections.MeshVertexList.Add(System.Double,System.Double,System.Double)
Adds a new vertex to the end of the Vertex list.
x: X component of new vertex coordinate.
y: Y component of new vertex coordinate.
z: Z component of new vertex coordinate.
Returns: The index of the newly added vertex.

Rhino.Geometry.Collections.MeshVertexList.Add(Rhino.Geometry.Point3f)
Adds a new vertex to the end of the Vertex list.
vertex: Location of new vertex.
Returns: The index of the newly added vertex.

Rhino.Geometry.Collections.MeshVertexList.Add(Rhino.Geometry.Point3d)
Adds a new vertex to the end of the Vertex list.
vertex: Location of new vertex.
Returns: The index of the newly added vertex.

Rhino.Geometry.Collections.MeshVertexList.AddVertices(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
vertices: A list, an array or any enumerable set of Rhino.Geometry.Point3d.

Rhino.Geometry.Collections.MeshVertexList.AddVertices(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
vertices: A list, an array or any enumerable set of Rhino.Geometry.Point3f.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,System.Single,System.Single,System.Single)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
x: X component of vertex location.
y: Y component of vertex location.
z: Z component of vertex location.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,System.Double,System.Double,System.Double)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
x: X component of vertex location.
y: Y component of vertex location.
z: Z component of vertex location.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,Rhino.Geometry.Point3f)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
vertex: Vertex location.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,Rhino.Geometry.Point3d)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
vertex: Vertex location.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.IsHidden(System.Int32)
Gets a value indicating whether or not a vertex is hidden.
vertexIndex: Index of vertex to query.
Returns: true if the vertex is hidden, false if it is not.

Rhino.Geometry.Collections.MeshVertexList.Hide(System.Int32)
Hides the vertex at the given index.
vertexIndex: Index of vertex to hide.

Rhino.Geometry.Collections.MeshVertexList.Show(System.Int32)
Shows the vertex at the given index.
vertexIndex: Index of vertex to show.

Rhino.Geometry.Collections.MeshVertexList.HideAll
Hides all vertices in the mesh.

Rhino.Geometry.Collections.MeshVertexList.ShowAll
Shows all vertices in the mesh.

Rhino.Geometry.Collections.MeshVertexList.CullUnused
Removes all vertices that are currently not used by the Face list.
Returns: The number of unused vertices that were removed.

Rhino.Geometry.Collections.MeshVertexList.CombineIdentical(System.Boolean,System.Boolean)
Merges identical vertices.
ignoreNormals:
If true, vertex normals will not be taken into consideration when comparing vertices.
ignoreAdditional:
If true, texture coordinates, colors, and principal curvatures
will not be taken into consideration when comparing vertices.
Returns:
true if the mesh is changed, in which case the mesh will have fewer vertices than before.

Rhino.Geometry.Collections.MeshVertexList.GetVertexFaces(System.Int32)
Gets a list of all of the faces that share a given vertex.
vertexIndex: The index of a vertex in the mesh.
Returns: An array of indices of faces on success, null on failure.

Rhino.Geometry.Collections.MeshVertexList.GetTopologicalIndenticalVertices(System.Int32)
Gets a list of other vertices which are "topologically" identical
to this vertex.
vertexIndex: A vertex index in the mesh.
Returns:
Array of indices of vertices that are topoligically the same as this vertex. The
array includes vertexIndex. Returns null on failure.

Rhino.Geometry.Collections.MeshVertexList.GetConnectedVertices(System.Int32)
Gets indices of all vertices that form "edges" with a given vertex index.
vertexIndex: The index of a vertex to query.
Returns: An array of vertex indices that are connected with the specified vertex.

Rhino.Geometry.Collections.MeshVertexList.ToPoint3fArray
Copies all vertices to a new array of Rhino.Geometry.Point3f.
Returns: A new array.

Rhino.Geometry.Collections.MeshVertexList.ToPoint3dArray
Copies all vertices to a new array of Rhino.Geometry.Point3d.
Returns: A new array.

Rhino.Geometry.Collections.MeshVertexList.Remove(System.Int32,System.Boolean)
Removes the vertex at the given index and all faces that reference that index.
index: Index of vertex to remove.
shrinkFaces: If true, quads that reference the deleted vertex will be converted to triangles.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.Remove(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Removes the vertices at the given indices and all faces that reference those vertices.
indices: Vertex indices to remove.
shrinkFaces: If true, quads that reference the deleted vertex will be converted to triangles.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.GetEnumerator
Gets an enumerator that yields all mesh vertices (points) in this collection.
Returns: The enumerator.

Rhino.Geometry.Collections.MeshVertexList.Count
Gets or sets the number of mesh vertices.