Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
surfaceB: A second surface.
radius: A radius value.
tolerance: A tolerance value.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.

Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,System.Boolean,Rhino.Geometry.Surface,System.Boolean,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
flipA: A value that indicates whether A should be used in flipped mode.
surfaceB: A second surface.
flipB: A value that indicates whether B should be used in flipped mode.
radius: A radius value.
tolerance: A tolerance value.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.

Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
uvA: A point in the parameter space of FaceA near where the fillet is expected to hit the surface.
surfaceB: A second surface.
uvB: A point in the parameter space of FaceB near where the fillet is expected to hit the surface.
radius: A radius value.
tolerance: A tolerance value used for approximating and intersecting offset surfaces.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.

Rhino.Geometry.Surface.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d)
Constructs a surface by extruding a curve along a vector.
profile: Profile curve to extrude.
direction: Direction and length of extrusion.
Returns: A surface on success or null on failure.

Rhino.Geometry.Surface.CreateExtrusionToPoint(Rhino.Geometry.Curve,Rhino.Geometry.Point3d)
Constructs a surface by extruding a curve to a point.
profile: Profile curve to extrude.
apexPoint: Apex point of extrusion.
Returns: A Surface on success or null on failure.

Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32)
Constructs a periodic surface from a base surface and a direction.
baseSurface: A base surface.
direction: 0 is first parameter, 1 is second parameter.
Returns: A new surface; or null on error.

Rhino.Geometry.Surface.Domain(System.Int32)
Gets the domain in a direction.
direction: 0 gets first parameter, 1 gets second parameter.
Returns: An interval value.

Rhino.Geometry.Surface.SetDomain(System.Int32,Rhino.Geometry.Interval)
Sets the domain in a direction.
direction:
0 sets first parameter's domain, 1 sets second parameter's domain.
domain: A new domain to be assigned.
Returns: true if setting succeeded, otherwise false.

Rhino.Geometry.Surface.Degree(System.Int32)
Returns the maximum algebraic degree of any span
(or a good estimate if curve spans are not algebraic).
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: The maximum degree.

Rhino.Geometry.Surface.GetSurfaceSize(System.Double@,System.Double@)
Gets an estimate of the size of the rectangle that would be created
if the 3d surface where flattened into a rectangle.
width: corresponds to the first surface parameter.
height: corresponds to the second surface parameter.
Returns: true if successful.
Reparameterize a surface to minimize distortion in the map from parameter space to 3d.
Surface surf = ...;
double width, height;
if ( surf.GetSurfaceSize( out width, out height ) )
{
surf.SetDomain( 0, new ON_Interval( 0.0, width ) );
surf.SetDomain( 1, new ON_Interval( 0.0, height ) );
}

Rhino.Geometry.Surface.SpanCount(System.Int32)
Gets number of smooth nonempty spans in the parameter direction.
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: The span count.

Rhino.Geometry.Surface.GetSpanVector(System.Int32)
Gets array of span "knots".
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: An array with span vectors; or null on error.

Rhino.Geometry.Surface.ClosestSide(System.Double,System.Double)
Gets the side that is closest, in terms of 3D-distance, to a U and V parameter.
u: A u parameter.
v: A v parameter.
Returns: A side.

Rhino.Geometry.Surface.Extend(Rhino.Geometry.IsoStatus,System.Double,System.Boolean)
Extends an untrimmed surface along one edge.
edge:
Edge to extend.  Must be North, South, East, or West.
extensionLength: distance to extend.
smooth:
true for smooth (C-infinity) extension.
false for a C1- ruled extension.
Returns: New extended surface on success.

Rhino.Geometry.Surface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32)
Rebuilds an existing surface to a given degree and point count.
uDegree: the output surface u degree.
vDegree: the output surface u degree.
uPointCount:
The number of points in the output surface u direction. Must be bigger
than uDegree (maximum value is 1000)
vPointCount:
The number of points in the output surface v direction. Must be bigger
than vDegree (maximum value is 1000)
Returns: new rebuilt surface on success. null on failure.

Rhino.Geometry.Surface.Reverse(System.Int32)
Reverses parameterization Domain changes from [a,b] to [-b,-a]
direction:
0 for first parameter's domain, 1 for second parameter's domain.
Returns: a new reversed surface on success.

Rhino.Geometry.Surface.Transpose
Transposes surface parameterization (swap U and V)
Returns: New transposed surface on success, null on failure.

Rhino.Geometry.Surface.PointAt(System.Double,System.Double)
Evaluates a point at a given parameter.
u: evaluation parameters.
v: evaluation parameters.
Returns: Point3d.Unset on failure.

Rhino.Geometry.Surface.NormalAt(System.Double,System.Double)
Computes the surface normal at a point.
This is the simple evaluation call - it does not support error handling.
u: A U parameter.
v: A V parameter.
Returns: The normal.

Rhino.Geometry.Surface.FrameAt(System.Double,System.Double,Rhino.Geometry.Plane@)
Computes the orient plane on a surface given a U and V parameter.
This is the simple evaluation call with no error handling.
u: A first parameter.
v: A second parameter.
frame: A frame plane that will be computed during this call.
Returns: true if this operation succeeded; otherwise false.

Rhino.Geometry.Surface.CurvatureAt(System.Double,System.Double)
Computes the curvature at the given UV coordinate.
u: U parameter for evaluation.
v: V parameter for evaluation.
Returns: Surface Curvature data for the point at uv or null on failure.

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.Curve,Rhino.Geometry.Interval)
Determines if a 2D curve is iso-parameteric in the parameter space of this surface.
curve: Curve to test.
curveDomain: Sub domain of the curve.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the curve.

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.Curve)
Determines if a 2d curve is iso-parameteric in the parameter space of this surface.
curve: Curve to test.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the curve.

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.BoundingBox)
Determines if a 2d bounding box is iso-parameteric in the parameter space of this surface.
bbox: Bounding box to test.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the bounding box.

Rhino.Geometry.Surface.IsClosed(System.Int32)
Gets a value indicating if the surface is closed in a direction.
direction: 0 = U, 1 = V.
Returns: The indicating boolean value.

Rhino.Geometry.Surface.IsPeriodic(System.Int32)
Gets a value indicating if thr surface is periodic in a direction (default is false).
direction: 0 = U, 1 = V.
Returns: The indicating boolean value.

Rhino.Geometry.Surface.IsSingular(System.Int32)
true if surface side is collapsed to a point.
side:
side of parameter space to test
0 = south, 1 = east, 2 = north, 3 = west.
Returns: True if this specific side of the surface is singular; otherwise, false.

Rhino.Geometry.Surface.IsAtSingularity(System.Double,System.Double,System.Boolean)
Tests if a surface parameter value is at a singularity.
u: Surface u parameter to test.
v: Surface v parameter to test.
exact:
If true, test if (u,v) is exactly at a singularity.
If false, test if close enough to cause numerical problems.
Returns: true if surface is singular at (s,t)

Rhino.Geometry.Surface.IsAtSeam(System.Double,System.Double)
Tests if a surface parameter value is at a seam.
u: Surface u parameter to test.
v: Surface v parameter to test.
Returns:
0 if not a seam,
1 if u == Domain(0)[i] and srf(u, v) == srf(Domain(0)[1-i], v)
2 if v == Domain(1)[i] and srf(u, v) == srf(u, Domain(1)[1-i])
3 if 1 and 2 are true.

Rhino.Geometry.Surface.IsContinuous(Rhino.Geometry.Continuity,System.Double,System.Double)
Tests continuity at a surface parameter value.
continuityType: The continuity type to sample.
u: Surface u parameter to test.
v: Surface v parameter to test.
Returns: true if the surface has at least the specified continuity at the (u,v) parameter.

Rhino.Geometry.Surface.GetNextDiscontinuity(System.Int32,Rhino.Geometry.Continuity,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
direction:
If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked.
continuityType: The desired continuity.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored.
This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1:
(t0 != t1) If there is a discontinuity at t1 is will be ingored unless c is a locus discontinuity
type and t1 is at the start or end of the curve.
t:
if a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
TRUE if a parametric discontinuity was found strictly between t0 and t1.
Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
TRUE if a locus discontinuity was found strictly between t0 and t1 or at t1 is the
at the end of a curve. Note well that all open curves (IsClosed()=false) are locus
discontinuous at the ends of their domains.  All closed curves (IsClosed()=true) are
at least C0_locus_continuous at the ends of their domains.

Rhino.Geometry.Surface.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Input the parameters of the point on the surface that is closest to testPoint.
testPoint: A point to test against.
u: U parameter of the surface that is closest to testPoint.
v: V parameter of the surface that is closest to testPoint.
Returns: true on success, false on failure.

Rhino.Geometry.Surface.Trim(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Constructs a sub-surface that covers the specified UV trimming domain.
u: Domain of surface along U direction to include in the subsurface.
v: Domain of surface along V direction to include in the subsurface.
Returns: SubSurface on success, null on failure.

Rhino.Geometry.Surface.Offset(System.Double,System.Double)
Constructs a new surface which is offset from the current surface.
distance: Distance (along surface normal) to offset.
tolerance: Offset accuracy.
Returns: The offsetted surface or null on failure.

Rhino.Geometry.Surface.Fit(System.Int32,System.Int32,System.Double)
Fits a new surface through an existing surface.
uDegree: the output surface U degree. Must be bigger than 1.
vDegree: the output surface V degree. Must be bigger than 1.
fitTolerance: The fitting tolerance.
Returns: A surface, or null on error.

Rhino.Geometry.Surface.Evaluate(System.Double,System.Double,System.Int32,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d[]@)
Evaluates a surface mathematically.
u: A U parameter.
v: A V parameter.
numberDerivatives: The number of derivatives.
point: A point. This out parameter will be assigned during this call.
derivatives: A vector array. This out parameter will be assigned during this call. This can be null.
Returns: true if the operation succeeded; false otherwise.

Rhino.Geometry.Surface.IsoCurve(System.Int32,System.Double)
Gets isoparametric curve.
direction:
0 first parameter varies and second parameter is constant
e.g., point on IsoCurve(0,c) at t is srf(t,c)
This is a horizontal line from left to right
1 first parameter is constant and second parameter varies
e.g., point on IsoCurve(1,c) at t is srf(c,t
This is a vertical line from bottom to top.
constantParameter: The parameter that was constant on the original surface.
Returns: An isoparametric curve or null on error.
Remarks:
In this function "direction" indicates which direction the resulting curve runs.
0: horizontal, 1: vertical
In the other Surface functions that take a "direction" argument,
"direction" indicates if "constantParameter" is a "u" or "v" parameter.

Rhino.Geometry.Surface.InterpolatedCurveOnSurfaceUV(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double)
Constructs an interpolated curve on a surface, using 2D surface points.
points: A list, an array or any enumerable set of 2D points.
tolerance: A tolerance value.
Returns: A new nurbs curve, or null on error.

Rhino.Geometry.Surface.InterpolatedCurveOnSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Constructs an interpolated curve on a surface, using 3D points.
points: A list, an array or any enumerable set of points.
tolerance: A tolerance value.
Returns: A new nurbs curve, or null on error.

Rhino.Geometry.Surface.ShortPath(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Double)
Constructs a geodesic between 2 points, used by ShortPath command in Rhino.
start: start point of curve in parameter space. Points must be distinct in the domain of thie surface.
end: end point of curve in parameter space. Points must be distinct in the domain of thie surface.
tolerance: tolerance used in fitting discrete solution.
Returns: a geodesic curve on the surface on success. null on failure.

Rhino.Geometry.Surface.Pushup(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Interval)
Computes a 3d curve that is the composite of a 2d curve and the surface map.
curve2d: a 2d curve whose image is in the surface's domain.
tolerance:
the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface.
curve2dSubdomain: The curve interval (a sub-domain of the original curve) to use.
Returns: 3d curve.

Rhino.Geometry.Surface.Pushup(Rhino.Geometry.Curve,System.Double)
Computes a 3d curve that is the composite of a 2d curve and the surface map.
curve2d: a 2d curve whose image is in the surface's domain.
tolerance:
the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface.
Returns: 3d curve.

Rhino.Geometry.Surface.Pullback(Rhino.Geometry.Curve,System.Double)
Pulls a 3d curve back to the surface's parameter space.
curve3d: The curve to pull.
tolerance:
the maximum acceptable 3d distance between from surface(curve_2d(t))
to the locus of points on the surface that are closest to curve_3d.
Returns: 2d curve.

Rhino.Geometry.Surface.Pullback(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Interval)
Pulls a 3d curve back to the surface's parameter space.
curve3d: A curve.
tolerance:
the maximum acceptable 3d distance between from surface(curve_2d(t))
to the locus of points on the surface that are closest to curve_3d.
curve3dSubdomain: A subdomain of the curve to sample.
Returns: 2d curve.

Rhino.Geometry.Surface.ToBrep
Converts the surface into a Brep.
Returns: A Brep with a similar shape like this surface or null.

Rhino.Geometry.Surface.HasNurbsForm
Is there a NURBS surface representation of this surface.
Returns:
0 unable to create NURBS representation with desired accuracy.
1 success - NURBS parameterization matches the surface's
2 success - NURBS point locus matches the surface's and the
domain of the NURBS surface is correct. However, This surface's
parameterization and the NURBS surface parameterization may not
match.  This situation happens when getting NURBS representations
of surfaces that have a transendental parameterization like spheres,
cylinders, and cones.

Rhino.Geometry.Surface.ToNurbsSurface
Gets a NURBS surface representation of this surface. Default
tolerance of 0.0 is used.
Returns: NurbsSurface on success, null on failure.

Rhino.Geometry.Surface.ToNurbsSurface(System.Double,System.Int32@)
Gets a NURBS surface representation of this surface.
tolerance: tolerance to use when creating NURBS representation.
accuracy:
0 = unable to create NURBS representation with desired accuracy.
1 = success - returned NURBS parameterization matches the surface's
to the desired accuracy.
2 = success - returned NURBS point locus matches the surface's to the
desired accuracy and the domain of the NURBS surface is correct.
However, this surface's parameterization and the NURBS surface
parameterization may not match to the desired accuracy. This
situation happens when getting NURBS representations of surfaces
that have a transendental parameterization like spheres, cylinders,
and cones.
Returns: NurbsSurface on success, null on failure.

Rhino.Geometry.Surface.IsPlanar
Tests a surface to see if it is planar to zero tolerance.
Returns:
true if the surface is planar (flat) to within RhinoMath.ZeroTolerance units (1e-12).

Rhino.Geometry.Surface.IsPlanar(System.Double)
Tests a surface to see if it is planar to a given tolerance.
tolerance: tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from
the surface to the plane is <= tolerance.

Rhino.Geometry.Surface.TryGetPlane(Rhino.Geometry.Plane@)
Tests a surface for planarity and return the plane.
plane: On success, the plane parameters are filled in.
Returns:
true if there is a plane such that the maximum distance from the surface to the plane is <= RhinoMath.ZeroTolerance.

Rhino.Geometry.Surface.TryGetPlane(Rhino.Geometry.Plane@,System.Double)
Tests a surface for planarity and return the plane.
plane: On success, the plane parameters are filled in.
tolerance: tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance.

Rhino.Geometry.Surface.IsSphere
Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a sphere.

Rhino.Geometry.Surface.IsSphere(System.Double)
Determines if the surface is a portion of a sphere within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a sphere.

Rhino.Geometry.Surface.TryGetSphere(Rhino.Geometry.Sphere@)
Test a surface to see if it is a portion of a sphere and return the sphere.
sphere: On success, the sphere parameters are filled in.
Returns: true if the surface is a portion of a sphere.

Rhino.Geometry.Surface.TryGetSphere(Rhino.Geometry.Sphere@,System.Double)
Test a surface to see if it is a portion of a sphere and return the sphere.
sphere: On success, the sphere parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a sphere.

Rhino.Geometry.Surface.IsCylinder
Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a cylinder.

Rhino.Geometry.Surface.IsCylinder(System.Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
cylinder: On success, the cylinder parameters are filled in.
Returns: true if the surface is a portion of a cylinder.

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@,System.Double)
Tests a surface to see if it is a portion of a cylinder and return the cylinder.
cylinder: On success, the cylinder parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.

Rhino.Geometry.Surface.IsCone
Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a cone.

Rhino.Geometry.Surface.IsCone(System.Double)
Determines if the surface is a portion of a cone within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cone.

Rhino.Geometry.Surface.TryGetCone(Rhino.Geometry.Cone@)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
cone: On success, the cone parameters are filled in.
Returns: true if the surface is a portion of a cone.

Rhino.Geometry.Surface.TryGetCone(Rhino.Geometry.Cone@,System.Double)
Tests a surface to see if it is a portion of a cone and returns the cone.
cone: On success, the cone parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cone.

Rhino.Geometry.Surface.IsTorus
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a torus.

Rhino.Geometry.Surface.IsTorus(System.Double)
Determines if the surface is a portion of a torus within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a torus.

Rhino.Geometry.Surface.TryGetTorus(Rhino.Geometry.Torus@)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
torus: On success, the torus parameters are filled in.
Returns: true if the surface is a portion of a torus.

Rhino.Geometry.Surface.TryGetTorus(Rhino.Geometry.Torus@,System.Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
torus: On success, the torus parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a torus.

Rhino.Geometry.Surface.Split(System.Int32,System.Double)
Splits (divides) the surface into two parts at the specified parameter
direction:
0 = The surface is split vertically. The "west" side is returned as the first
surface in the array and the "east" side is returned as the second surface in
the array.
1 = The surface is split horizontally. The "south" side is returned as the first surface in the array and the "north"
side is returned as the second surfae in the array
parameter:
value of constant parameter in interval returned by Domain(direction)
Returns: Array of two surfaces on success

Rhino.Geometry.Surface.IsSolid
Gets a values indicating whether a surface is solid.