Rhino.Runtime.CommonObject.NonConstOperation
For derived classes implementers.
Defines the necessary implementation to free the instance from being const.

Rhino.Runtime.CommonObject.OnSwitchToNonConst
Is called when a non-const operation first occurs.

Rhino.Runtime.CommonObject.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.

Rhino.Runtime.CommonObject.ConstructConstObject(System.Object,System.Int32)
Assigns a parent object and a subobject index to this.
parentObject: The parent object.
subobject_index: The subobject index.

Rhino.Runtime.CommonObject.IsValidWithLog(System.String@)
Determines if an object is valid. Also provides a report on errors if this
object happens not to be valid.
log: A textual log. This out parameter is assigned during this call.
Returns: true if this object is valid; false otherwise.

Rhino.Runtime.CommonObject.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.CommonObject.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
info: The System.Runtime.Serialization.SerializationInfo to populate with data.
context: The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.

Rhino.Runtime.CommonObject.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.

Rhino.Runtime.CommonObject.IsValid
Tests an object to see if it is valid.

Rhino.Runtime.CommonObject.HasUserData
Gets true if this class has any custom information attached to it through UserData.

Rhino.Runtime.CommonObject.UserData
List of custom information that is attached to this class.

Rhino.Runtime.CommonObject.UserDictionary
Dictionary of custom information attached to this class. The dictionary is actually user
data provided as an easy to use sharable set of information.