Rhino.Geometry.BrepLoop.To3dCurve
Create a 3D curve that approximates the loop geometry.
Returns: A 3D curve that approximates the loop or null on failure.

Rhino.Geometry.BrepLoop.Brep
Gets the Brep that owns this loop.

Rhino.Geometry.BrepLoop.LoopIndex
Gets the index of this loop in the Brep.Loops collection.

Rhino.Geometry.BrepLoop.Face
BrepFace this loop belongs to.

Rhino.Geometry.BrepLoop.LoopType
type of loop.