Rhino.DocObjects.InstanceDefinitionLayerStyle
A InstanceDefinitionUpdateType.Static or InstanceDefinitionUpdateType.LinkedAndEmbedded idef
must have LayerStyle = Unset, a InstanceDefinitionUpdateType.Linked InstanceDefnition must
have LayerStyle = Active or Reference