Rhino.Collections.RhinoList`1.System#Collections#IList#IndexOf(System.Object)
Searches for the specified object and returns the zero-based index of the
first occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.IndexOf(`0)
Searches for the specified object and returns the zero-based index of the
first occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.IndexOf(`0,System.Int32)
Searches for the specified object and returns the zero-based index of
the first occurrence within the range of elements in the List that
extends from the specified index to the last element.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
index: The zero-based starting index of the search.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.IndexOf(`0,System.Int32,System.Int32)
Searches for the specified object and returns the zero-based index of the first
occurrence within the range of elements in the List that starts at the specified
index and contains the specified number of elements.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
index: The zero-based starting index of the search.
count: The number of elements in the section to search.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0)
Searches for the specified object and returns the zero-based
index of the last occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0,System.Int32)
Searches for the specified object and returns the zero-based index
of the last occurrence within the range of elements in the List
that extends from the first element to the specified index.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
index: The zero-based starting index of the backward search.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0,System.Int32,System.Int32)
Searches for the specified object and returns the zero-based index of the
last occurrence within the range of elements in the List that contains
the specified number of elements and ends at the specified index.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
index: The zero-based starting index of the backward search.
count: The number of elements in the section to search.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindIndex(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the first
occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindIndex(System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the first
occurrence within the entire List.
startIndex: The zero-based starting index of the search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindIndex(System.Int32,System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the specified predicate,
and returns the zero-based index of the first occurrence within the range of elements
in the List that extends from the specified index to the last element.
startIndex: The zero-based starting index of the search.
count: The number of elements in the section to search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
startIndex: The zero-based starting index of the backward search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, –1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Int32,System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
startIndex: The zero-based starting index of the backward search.
count: The number of elements in the section to search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, –1.