Rhino.Input.Custom.OptionInteger.#ctor(System.Int32,System.Int32,System.Int32)
Initializes a new instance of the Rhino.Input.Custom.OptionInteger class wiht both lower and upper limits.
initialValue: The initial value.
lowerLimit: The minimum value.
upperLimit: The maximum value.

Rhino.Input.Custom.OptionInteger.#ctor(System.Int32,System.Boolean,System.Int32)
Initializes a new instance of the Rhino.Input.Custom.OptionInteger class.
initialValue: The initial value.
setLowerLimit:
If true, limit sets the lower limit and upper limit is undefined
If false, limit sets the upper limit and lower limit is undefined.
limit: If setLowerLimit is true, then limit is the minimum value.
Otherwise, it is the maximum.

Rhino.Input.Custom.OptionInteger.CurrentValue
