Rhino.Geometry.AnnotationBase.NumericValue
Gets the numeric value, depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
Leader or Text: UnsetValue

Rhino.Geometry.AnnotationBase.Text
Gets or sets the text for this annotation.

Rhino.Geometry.AnnotationBase.TextFormula
Gets or sets a formula for this annotation.

Rhino.Geometry.AnnotationBase.TextHeight
Gets or sets the text height in model units.

Rhino.Geometry.AnnotationBase.Plane
Gets or sets the plane containing the annotation.