Rhino.Runtime.InteropWrappers.SimpleArrayGuid.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGuid class.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Count
Gets the amount of elements in this array.