Rhino.FileIO.File3dmObject.Geometry
Gets the geometry that is linked with this document object.

Rhino.FileIO.File3dmObject.Attributes
Gets the attributes that are linked with this document object.

Rhino.FileIO.File3dmObject.Name
Gets or sets the Name of the object. Equivalent to this.Attributes.Name.