Rhino.Runtime.InteropWrappers.SimpleArrayDouble.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayDouble instance.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayDouble instance, with items.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.Count
Gets the amount of elements in this array.