Rhino.DocObjects.Texture.#ctor
Initializes a new texture.

Rhino.DocObjects.Texture.FileName
Gets or sets a file name that is used by this texture.
NOTE: this filename may well not be a path that makes sense
on a user's computer because it was a path initially set on
a different user's computer. If you want to get a workable path
for this user, use the BitmapTable.Find function using this
property.

Rhino.DocObjects.Texture.Id
Gets the globally unique identifier of this texture.

Rhino.DocObjects.Texture.Enabled
If the texture is enabled then it will be visible in the rendered
display otherwise it will not.