Rhino.Geometry.Intersect.CurveIntersections.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.Intersect.CurveIntersections.CopyTo(Rhino.Geometry.Intersect.IntersectionEvent[],System.Int32)
Copies all intersection results into another array, departing at an index in the target array.
array: The target array. This value cannot be null.
arrayIndex: Zero-based index in which to start the copy.
Throws System.ArgumentNullException: If array is null.
Throws System.ArgumentOutOfRangeException: If arrayIndex is less than 0.
Throws System.ArgumentException: If array is multi-dimensional; or if arrayIndex is
larger than or equal to the length of this collection; or this collection contains more
IntersectionEvents than the ones that can be stored in array after and including arrayIndex.

Rhino.Geometry.Intersect.CurveIntersections.GetEnumerator
Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
Returns: The constructed enumerator.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#IEnumerable#GetEnumerator
Returns a non-generic enumerator that is capable of yielding all IntersectionEvents in the collection.
This returns the same enumerator as the generic counterpart.
Returns: The constructed enumerator.

Rhino.Geometry.Intersect.CurveIntersections.Count
Gets the number of recorded intersection events.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#IsReadOnly
This collection is readonly, so this property returns always true.