Rhino.PlugIns.LicenseUtils.GetLicenseClientAssembly
Returns the license client assembly.

Rhino.PlugIns.LicenseUtils.Initialize
Initializes the license manager.

Rhino.PlugIns.LicenseUtils.Echo(System.String)
Tests connectivity with the Zoo.

Rhino.PlugIns.LicenseUtils.ShowLicenseValidationUi(System.String)
ShowLicenseValidationUi

Rhino.PlugIns.LicenseUtils.GetLicense(System.String,System.Guid,System.Int32,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
This (internal) version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino.PlugIns.PlugIn objects.

Rhino.PlugIns.LicenseUtils.GetLicense(System.Int32,Rhino.PlugIns.ValidateProductKeyDelegate)
This version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino C++ plug-ins.

Rhino.PlugIns.LicenseUtils.ReturnLicense(Rhino.PlugIns.ValidateProductKeyDelegate)
This (internal) version of Rhino.PlugIns.LicenseUtils.ReturnLicense is used
is used by Rhino C++ plug-ins.

Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)
OBSOLETE - REMOVE WHEN POSSIBLE.

Rhino.PlugIns.LicenseUtils.CheckOutLicense(System.Guid)
Checks out a license that is on loan from a Zoo server
on a permanent basis.
productId:
The Guid of the product that you want to check out.
Returns:
true if the license was checked out successful.
false if not successful or on error.

Rhino.PlugIns.LicenseUtils.CheckInLicense(System.Guid)
Checks in a previously checked out license to
the Zoo server from which it was checked out.
productId:
The Guid of the product that you want to check in.
Returns:
true if the license was checked in successful.
false if not successful or on error.

Rhino.PlugIns.LicenseUtils.ConvertLicense(System.Guid)
Converts a product license from a standalone node
to a network node.
productId:
The Guid of the product that you want to check in.
Returns:
true if the license was successfully converted.
false if not successful or on error.

Rhino.PlugIns.LicenseUtils.GetLicenseType(System.Guid)
Returns the type of a specified product license

Rhino.PlugIns.LicenseUtils.IsCheckOutEnabled
Returns whether or not license checkout is enabled.

Rhino.PlugIns.LicenseUtils.GetLicenseStatus
Returns the current status of every license for ui purposes.