Rhino.UI.Panels.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
You typically register your panel class in your plug-in's OnLoad function.
This informs Rhino of the existence of your panel class
plugin: Plug-in this panel is associated with
panelType:
Class type to construct when a panel is shown.  Currently only types
that implement the IWin32Window interface are supported. The requirements
for the class are that it has a parameterless constructor and have a
GuidAttribute applied with a unique Guid
caption:
icon: Use a 32bit depth icon in order to get proper transparency