Rhino.PlugIns.LicenseData
Zoo plugin license data.

Rhino.PlugIns.LicenseData.#ctor
Public constructor.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String)
Public constructor.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType)
Public constructor.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32)
Public constructor.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32,System.Nullable{System.DateTime})
Public constructor.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32,System.Nullable{System.DateTime},System.Drawing.Icon)
Public constructor.

Rhino.PlugIns.LicenseData.IsValid
Public validator.

Rhino.PlugIns.LicenseData.IsNotValid(Rhino.PlugIns.LicenseData)
Indicates whether a LicenseData object is either null or invalid.

Rhino.PlugIns.LicenseData.IsValid(Rhino.PlugIns.LicenseData)
Indicates whether a LicenseData object is not null and valid.

Rhino.PlugIns.LicenseData.ProductLicense
The actual product license.
This is provided by the plugin that validated the license.

Rhino.PlugIns.LicenseData.SerialNumber
The "for display only" product license.
This is provided by the plugin that validated the license.

Rhino.PlugIns.LicenseData.LicenseTitle
The title of the license.
This is provided by the plugin that validated the license.
(e.g. "Rhinoceros 5.0 Commercial")

Rhino.PlugIns.LicenseData.BuildType
The build of the product that this license work with.
When your product requests a license from the Zoo, it
will specify one of these build types.

Rhino.PlugIns.LicenseData.LicenseCount
The number of instances supported by this license.
This is provided by the plugin that validated the license.

Rhino.PlugIns.LicenseData.DateToExpire
The date and time the license is set to expire.
This is provided by the plugin that validated the license.
This time value should be in Coordinated Universal Time (UTC).

Rhino.PlugIns.LicenseData.ProductIcon
The product's icon. This will displayed in the "license"
page in the Options dialog. Note, this can be null.
Note, LicenseData creates it's own copy of the icon.