Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.String,System.Boolean)
Finds the instance definition with a given name.
instanceDefinitionName: name of instance definition to search for (ignores case)
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: The specified instance definition, or null if nothing matching was found.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.Guid,System.Boolean)
Finds the instance definition with a given id.
instanceId: Unique id of the instance definition to search for.
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: The specified instance definition, or null if nothing matching was found.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An element.
attributes: An attribute.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idef: The instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.

Rhino.DocObjects.Tables.InstanceDefinitionTable.UndoModify(System.Int32)
Restores the instance definition to its previous state,
if the instance definition has been modified and the modification can be undone.
idefIndex: The index of the instance definition to be restored.
Returns: true if operation succeeded.

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Modifies the instance definition geometry and replaces all references
to the current definition with references to the new definition.
idefIndex: The index of the instance definition to be modified.
newGeometry: The new geometry.
newAttributes: The new attributes.
Returns: true if operation succeeded.

Rhino.DocObjects.Tables.InstanceDefinitionTable.MakeSourcePathRelative(Rhino.DocObjects.InstanceDefinition,System.Boolean,System.Boolean)
Marks the source path for a linked instance definition as relative or absolute.
idef: The instance definition to be marked.
relative:
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
true if the instance defintion could be modified.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Delete(System.Int32,System.Boolean,System.Boolean)
Deletes the instance definition.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
deleteReferences:
true to delete all references to this definition.
false to delete definition only if there are no references.
quiet:
If true, no warning message box appears if an instance definition cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if the instance definition has active references and bDeleteReferences is false.

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetList(System.Boolean)
Gets an array of instance definitions.
ignoreDeleted: If true then deleted idefs are filtered out.
Returns: An array of instance definitions. This can be empty, but not null.

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName
Gets unsed instance definition name used as default when creating
new instance definitions.
Returns: An unused instance definition name string.

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName(System.String)
Gets unsed instance definition name used as default when creating
new instance definitions.
root:
The returned name is 'root nn'  If root is empty, then 'Block' (localized) is used.
Returns: An unused instance definition name string.

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName(System.String,System.UInt32)
Gets unsed instance definition name used as default when creating
new instance definitions.
root:
The returned name is 'root nn'  If root is empty, then 'Block' (localized) is used.
defaultSuffix:
Unique names are created by appending a decimal number to the
localized term for "Block" as in "Block 01", "Block 02",
and so on.  When defaultSuffix is supplied, the search for an unused
name begins at "Block suffix".
Returns: An unused instance definition name string.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Document
Document that owns this table.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Count
Number of items in the instance definitions table.

Rhino.DocObjects.Tables.InstanceDefinitionTable.ActiveCount
Number of items in the instance definitions table, excluding deleted definitions.