Rhino.Geometry.Collections.NurbsCurvePointList
Provides access to the control points of a nurbs curve.

Rhino.Geometry.Collections.NurbsCurvePointList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.

Rhino.Geometry.Collections.NurbsCurvePointList.ControlPolygon
Constructs a polyline through all the control points.
Note that periodic curves generate a closed polyline with fewer
points than control-points.
Returns: A polyline connecting all control points.

Rhino.Geometry.Collections.NurbsCurvePointList.ChangeEndWeights(System.Double,System.Double)
Use a combination of scaling and reparameterization to change the end weights to the specified values.
w0: Weight for first control point.
w1: Weight for last control point.
Returns: true on success, false on failure.
Remarks:
The domain, euclidean locations of the control points, and locus of the curve
do not change, but the weights, homogeneous cv values and internal knot values
may change. If w0 and w1 are 1 and the curve is not rational, the curve is not changed.

Rhino.Geometry.Collections.NurbsCurvePointList.MakeRational
Turns the curve into a Rational nurbs curve.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurvePointList.MakeNonRational
Sets all the control points to 1.0.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,System.Double,System.Double,System.Double,System.Double)
Sets a specific control-point.
index: Index of control-point to set.
x: X coordinate of control-point.
y: Y coordinate of control-point.
z: Z coordinate of control-point.
weight: Weight of control-point.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point3d)
Sets a specific control-point.
index: Index of control-point to set.
point: Coordinate of control-point.

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point4d)
Sets a specific weighted control-point.
index: Index of control-point to set.
point: Coordinate and weight of control-point.

Rhino.Geometry.Collections.NurbsCurvePointList.Count
Gets the number of control points in this curve.

Rhino.Geometry.Collections.NurbsCurvePointList.ControlPolygonLength
Gets the length of the polyline connecting all control points.