Rhino.Geometry.PolylineCurve.#ctor
Initializes a new empty polyline curve.

Rhino.Geometry.PolylineCurve.#ctor(Rhino.Geometry.PolylineCurve)
Initializes a new polyline curve by copying its content from another polyline curve.
other: Another polyline curve.

Rhino.Geometry.PolylineCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new polyline curve by copying its content from another set of points.
points: A list, an array or any enumerable set of points to copy from.
This includes a Rhino.Geometry.Polyline object.

Rhino.Geometry.PolylineCurve.Point(System.Int32)
Gets a point at a specified index in the polyline curve.
index: An index.
Returns: A point.

Rhino.Geometry.PolylineCurve.SetPoint(System.Int32,Rhino.Geometry.Point3d)
Sets a point at a specified index in the polyline curve.
index: An index.
point: A point location to set.

Rhino.Geometry.PolylineCurve.PointCount
Gets the number of points in this polyline.