Rhino.Collections.TransformObjectList
Used by the TransformCommand and GetTransform classes.

Rhino.Collections.TransformObjectList.GetBoundingBox(System.Boolean,System.Boolean)
Gets the bounding box of all of the objects that this list contains.
regularObjects: true if any object except grips should be included; otherwise false.
grips: true if grips should be included; otherwise false.
Returns:
Unset BoundingBox if this list is empty.