Rhino.Geometry.Vector3f.#ctor(System.Single,System.Single,System.Single)
Constructs a new vector from 3 single precision numbers.
x: X component of vector.
y: Y component of vector.
z: Z component of vector.

Rhino.Geometry.Vector3f.Equals(Rhino.Geometry.Vector3f)
Determines whether the specified vector has the same values as the present vector.
vector: The specified vector.
Returns: true if vector has the same components as this; otherwise false.

Rhino.Geometry.Vector3f.CompareTo(Rhino.Geometry.Vector3f)
Compares this Rhino.Geometry.Vector3f with another Rhino.Geometry.Vector3f.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Vector3f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.

Rhino.Geometry.Vector3f.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.

Rhino.Geometry.Vector3f.Transform(Rhino.Geometry.Transform)
Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
transformation: Transformation matrix to apply.

Rhino.Geometry.Vector3f.Rotate(System.Double,Rhino.Geometry.Vector3f)
Rotates this vector around a given axis.
angleRadians: Angle of rotation (in radians).
rotationAxis: Axis of rotation.
Returns: true on success, false on failure.

Rhino.Geometry.Vector3f.Reverse
Reverses (inverts) this vector in place.
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Returns: true on success or false if the vector is invalid.

Rhino.Geometry.Vector3f.PerpendicularTo(Rhino.Geometry.Vector3f)
Sets this vector to be perpendicular to another vector.
Result is not unitized.
other: Vector to use as guide.
Returns: true on success, false if input vector is zero or invalid.

Rhino.Geometry.Vector3f.op_Equality(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if the components of the two vectors are exactly equal; otherwise false.

Rhino.Geometry.Vector3f.op_Inequality(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if the two vectors differ in any component; false otherwise.

Rhino.Geometry.Vector3f.op_LessThan(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.

Rhino.Geometry.Vector3f.op_LessThanOrEqual(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.

Rhino.Geometry.Vector3f.op_GreaterThan(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.

Rhino.Geometry.Vector3f.op_GreaterThanOrEqual(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.

Rhino.Geometry.Vector3f.Add(Rhino.Geometry.Point3f,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Vector3f.op_Multiply(Rhino.Geometry.Vector3f,System.Single)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,System.Single)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3f.op_Multiply(System.Single,Rhino.Geometry.Vector3f)
Multiplies a vector by a number, having the effect of scaling it.
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3f.Multiply(System.Single,Rhino.Geometry.Vector3f)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector3f.CrossProduct(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length and
with a result that is oriented following the right hand rule.

Rhino.Geometry.Vector3f.Zero
Gets the value of the vector with components 0,0,0.

Rhino.Geometry.Vector3f.XAxis
Gets the value of the vector with components 1,0,0.

Rhino.Geometry.Vector3f.YAxis
Gets the value of the vector with components 0,1,0.

Rhino.Geometry.Vector3f.ZAxis
Gets the value of the vector with components 0,0,1.

Rhino.Geometry.Vector3f.Unset
Gets the value of the vector with each component set to RhinoMath.UnsetValue.

Rhino.Geometry.Vector3f.X
Gets or sets the X (first) component of this vector.

Rhino.Geometry.Vector3f.Y
Gets or sets the Y (second) component of this vector.

Rhino.Geometry.Vector3f.Z
Gets or sets the Z (third) component of this vector.

Rhino.Geometry.Vector3f.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
If this vector is invalid, its length is considered 0.