Rhino.Geometry.RadialDimension
Represents a dimension of a circular entity that can be measured with radius or diameter.
This entity refers to the geometric element that is independent from the document.

Rhino.Geometry.RadialDimension.IsDiameterDimension
Gets a value indicating whether the value refers to the diameter, rather than the radius.