Rhino.Input.GetResult
Possible results from GetObject.Input(), GetPoint.Input(), etc...

Rhino.Input.GetResult.Timeout
The getter waited for the amount of time specifed in RhinoGet::SetWaitDuration()
and then gave up.

Rhino.Input.GetResult.ExitRhino
Stop now, do not cleaup, just return ASAP.