Rhino.PlugIns.PlugIn.Find(System.Reflection.Assembly)
Finds the plug-in instance that was loaded from a given assembly.
pluginAssembly: The plug-in assembly.
You can get the assembly instance at runtime with the System.Type.Assembly instance property.
Returns: The assembly plug-in instance if successful. Otherwise, null.

Rhino.PlugIns.PlugIn.GetCommands
All of the commands associated with this plug-in.

Rhino.PlugIns.PlugIn.GetLicense(Rhino.PlugIns.LicenseBuildType,Rhino.PlugIns.ValidateProductKeyDelegate)
Verifies that there is a valid product license for your plug-in, using
the Rhino licensing system. If the plug-in is installed as a standalone
node, the locally installed license will be validated. If the plug-in
is installed as a network node, a loaner license will be requested by
the system's assigned Zoo server. If the Zoo server finds and returns
a license, then this license will be validated. If no license is found,
then the user will be prompted to provide a license key, which will be
validated.
productBuildType:
The product build type required by your plug-in.
validateDelegate:
Since the Rhino licensing system knows nothing about your product license,
you will need to validate the product license provided by the Rhino
licensing system. This is done by supplying a callback function, or delegate,
that can be called to perform the validation.
Returns:
true if a valid license was found. false otherwise.

Rhino.PlugIns.PlugIn.ReturnLicense
Returns, or releases, a product license that was obtained from the Rhino
licensing system. Note, most plug-ins do not need to call this as the
Rhino licensing system will return all licenses when Rhino shuts down.

Rhino.PlugIns.PlugIn.GetInstalledPlugInNames(Rhino.PlugIns.PlugInType,System.Boolean,System.Boolean)
Gets a list of installed plug-in names.  The list can be restricted by some filters.
typeFilter:
The enumeration flags that determine which types of plug-ins are included.
loaded: true if loaded plug-ins are returned.
unloaded: true if unloaded plug-ins are returned.
Returns: An array of installed plug-in names. This can be empty, but not null.

Rhino.PlugIns.PlugIn.NameFromPath(System.String)
Gets a plug-in name for an installed plug-in given the path to that plug-in.
pluginPath: The path of the plug-in.
Returns: The plug-in name.

Rhino.PlugIns.PlugIn.GetEnglishCommandNames(System.Guid)
Gets names of all "non-test" commands for a given plug-in.
pluginId: The plug-in ID.
Returns: An array with all plug-in names. This can be empty, but not null.

Rhino.PlugIns.PlugIn.Assembly
Source assembly for this plug-in.

Rhino.PlugIns.PlugIn.LoadTime
Plug-ins are typically loaded on demand when they are first needed. You can change
this behavior to load the plug-in at during different stages in time by overriding
this property.