Rhino.Geometry.LinearDimension
Represents a linear dimension.
This entity refers to the geometric element that is independent from the document.

Rhino.Geometry.LinearDimension.#ctor
Initializes a new instance of the Rhino.Geometry.LinearDimension class.

Rhino.Geometry.LinearDimension.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)


Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new instance of the Rhino.Geometry.LinearDimension class, based on three points.

Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.

Rhino.Geometry.LinearDimension.DistanceBetweenArrowTips
Gets the distance between arrow tips.

Rhino.Geometry.LinearDimension.DimensionStyleIndex
Index of DimensionStyle in document DimStyle table used by the dimension.

Rhino.Geometry.LinearDimension.ExtensionLine1End
Gets the end of the first extension line.

Rhino.Geometry.LinearDimension.ExtensionLine2End
Gets the end of the second extension line.

Rhino.Geometry.LinearDimension.Arrowhead1End
Gets the arrow head end of the first extension line.

Rhino.Geometry.LinearDimension.Arrowhead2End
Gets the arrow head end of the second extension line.

Rhino.Geometry.LinearDimension.TextPosition
Gets and sets the position of text on the plane.

Rhino.Geometry.LinearDimension.Aligned
Gets or sets a value indicating whether this annotation is aligned.