Rhino.Geometry.BlendContinuity
Used in curve and surface blending functions

Rhino.Geometry.BlendContinuity.Position


Rhino.Geometry.BlendContinuity.Tangency


Rhino.Geometry.BlendContinuity.Curvature
