Rhino.Geometry.Point3dGrid.#ctor
Initializes a rectangular grid of points, with no points in it.

Rhino.Geometry.Point3dGrid.#ctor(System.Int32,System.Int32)
Initializes a rectangular grid of points with a given number of columns and rows.
rows: An amount of rows.
columns: An amount of columns.