Rhino.DocObjects.ObjRef.#ctor(System.Guid)
Initializes a new object reference from a globally unique identifier (System.Guid).
id: The ID.

Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject)
Initializes a new object reference from a Rhino object.
rhinoObject: The Rhino object.

Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject,Rhino.Input.Custom.PickContext)
Initialized a new object reference from a Rhino object and pick context
rhinoObject:
pickContext:

Rhino.DocObjects.ObjRef.Geometry
Gets the geometry linked to the object targeted by this reference.
Returns: The geometry.

Rhino.DocObjects.ObjRef.ClippingPlaneSurface
Gets the clipping plane surface if this reference targeted one.
Returns: A clipping plane surface, or null if this reference targeted something else.

Rhino.DocObjects.ObjRef.Curve
Gets the curve if this reference targeted one.
Returns: A curve, or null if this reference targeted something else.

Rhino.DocObjects.ObjRef.Edge
Gets the edge if this reference geometry is one.
Returns: A boundary representation edge; or null on error.

Rhino.DocObjects.ObjRef.Face
If the referenced geometry is a brep face, a brep with one face, or
a surface, this returns the brep face.
Returns: A boundary representation face; or null on error.

Rhino.DocObjects.ObjRef.Brep
Gets the brep if this reference geometry is one.
Returns: A boundary representation; or null on error.

Rhino.DocObjects.ObjRef.Surface
Gets the surface if the referenced geometry is one.
Returns: A surface; or null if the referenced object is not a surface, or on error.

Rhino.DocObjects.ObjRef.TextDot
Gets the text dot if the referenced geometry is one.
Returns: A text dot; or null if the referenced object is not a text dot, or on error.

Rhino.DocObjects.ObjRef.Mesh
Gets the mesh if the referenced geometry is one.
Returns: A mesh; or null if the referenced object is not a mesh, or on error.

Rhino.DocObjects.ObjRef.Point
Gets the point if the referenced geometry is one.
Returns: A point; or null if the referenced object is not a point, or on error.

Rhino.DocObjects.ObjRef.PointCloud
Gets the point cloud if the referenced geometry is one.
Returns: A point cloud; or null if the referenced object is not a point cloud, or on error.

Rhino.DocObjects.ObjRef.TextEntity
Gets the text entity if the referenced geometry is one.
Returns: A text entity; or null if the referenced object is not a text entity, or on error.

Rhino.DocObjects.ObjRef.Light
Gets the light if the referenced geometry is one.
Returns: A light; or null if the referenced object is not a light, or on error.

Rhino.DocObjects.ObjRef.Hatch
Gets the hatch if the referenced geometry is one.
Returns: A hatch; or null if the referenced object is not a hatch

Rhino.DocObjects.ObjRef.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.DocObjects.ObjRef.Object
Returns the referenced Rhino object.

Rhino.DocObjects.ObjRef.SelectionMethod
Gets the method used to select this object.
Returns: The method used to select this object.

Rhino.DocObjects.ObjRef.SelectionPoint
If the object was selected by picking a point on it, then
SelectionPoint() returns the point where the selection
occured, otherwise it returns Point3d.Unset.
Returns:
The point where the selection occured or Point3d.Unset on failure.

Rhino.DocObjects.ObjRef.CurveParameter(System.Double@)
If the reference geometry is a curve or edge with a selection
point, then this gets the parameter of the selection point.
parameter: The parameter of the selection point.
Returns: If the selection point was on a curve or edge, then the
curve/edge is returned, otherwise null.
Remarks:
If a curve was selected and CurveParameter is called and the
SelectionMethod() is not 1 (point pick on object), the curve will
be returned and parameter will be set to the start parameter of
the picked curve. This can be misleading so it may be necessary
to call SelectionMethod() first, before calling CurveParameter
to get the desired information.

Rhino.DocObjects.ObjRef.SurfaceParameter(System.Double@,System.Double@)
If the reference geometry is a surface, brep with one face,
or surface edge with a selection point, then this gets the
surface paramters of the selection point.
u: The U value is assigned to this out parameter during the call.
v: The V value is assigned to this out parameter during the call.
Returns:
If the selection point was on a surface, then the surface is returned.

Rhino.DocObjects.ObjRef.SetSelectionComponent(Rhino.Geometry.ComponentIndex)
When an object is selected by picking a sub-object, SetSelectionComponent
may be used to identify the sub-object.
componentIndex:

Rhino.DocObjects.ObjRef.ObjectId
Returns the id of the referenced Rhino object.

Rhino.DocObjects.ObjRef.RuntimeSerialNumber
If > 0, then this is the value of a Rhino object's serial number field.
The serial number is used instead of the pointer to prevent crashes in
cases when the RhinoObject is deleted but an ObjRef continues to reference
the Rhino object. The value of RuntimeSerialNumber is not saved in archives
because it generally changes if you save and reload an archive.

Rhino.DocObjects.ObjRef.GeometryComponentIndex
Gets the component index of the referenced (sub) geometry.
Some objects have subobjects that are valid pieces of geometry. For
example, breps have edges and faces that are valid curves and surfaces.
Each subobject has a component index that is > 0. The parent
geometry has a component index = -1.