Rhino.Geometry.Mesh.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32)
Constructs a planar mesh grid.
plane: Plane of mesh.
xInterval: Interval describing size and extends of mesh along plane x-direction.
yInterval: Interval describing size and extends of mesh along plane y-direction.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
Throws System.ArgumentException: Thrown when plane is a null reference.
Throws System.ArgumentException: Thrown when xInterval is a null reference.
Throws System.ArgumentException: Thrown when yInterval is a null reference.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to zero.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to zero.

Rhino.Geometry.Mesh.CreateFromSphere(Rhino.Geometry.Sphere,System.Int32,System.Int32)
Constructs a mesh sphere.
sphere: Base sphere for mesh.
xCount: Number of faces in the around direction.
yCount: Number of faces in the top-to-bottom direction.
Throws System.ArgumentException: Thrown when sphere is invalid.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to two.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to two.
Returns:

Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32)
Constructs a mesh cylinder
cylinder:
vertical: Number of faces in the top-to-bottom direction
around: Number of faces around the cylinder
Throws System.ArgumentException: Thrown when cylinder is invalid.
Returns:

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32)
Constructs a mesh cone
cone:
vertical: Number of faces in the top-to-bottom direction
around: Number of faces around the cone
Throws System.ArgumentException: Thrown when cone is invalid.
Returns:

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters)
Attempts to construct a mesh from a closed planar curve.
boundary: must be a closed planar curve.
parameters: parameters used for creating the mesh.
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.CreateFromClosedPolyline(Rhino.Geometry.Polyline)
Attempts to create a Mesh that is a triangulation of a closed polyline
polyline: must be closed
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep)
Constructs a mesh from a brep.
brep: Brep to approximate.
Returns: An array of meshes.

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep,Rhino.Geometry.MeshingParameters)
Constructs a mesh from a brep.
brep: Brep to approximate.
meshingParameters: Parameters to use during meshing.
Returns: An array of meshes.

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid union of a set of meshes.
meshes: Meshes to union.
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid difference of two sets of Meshes.
firstSet: First set of Meshes (the set to subtract from).
secondSet: Second set of Meshes (the set to subtract).
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid intersection of two sets of meshes.
firstSet: First set of Meshes.
secondSet: Second set of Meshes.
Returns: An array of Mesh results or null on failure.

Rhino.Geometry.Mesh.CreateBooleanSplit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Splits a set of meshes with another set.
meshesToSplit: A list, an array, or any enumerable set of meshes to be split. If this is null, null will be returned.
meshSplitters: A list, an array, or any enumerable set of meshes that cut. If this is null, null will be returned.
Returns: A new mesh array, or null on error.

Rhino.Geometry.Mesh.#ctor
Initializes a new empty mesh.

Rhino.Geometry.Mesh.CopyFrom(Rhino.Geometry.Mesh)
Copies mesh values into this mesh from another mesh.
other: The other mesh to copy from.
Throws System.ArgumentNullException: If other is null.

Rhino.Geometry.Mesh.Duplicate
Constructs a copy of this mesh.
This is the same as Rhino.Geometry.Mesh.DuplicateMesh.
Returns: A mesh.

Rhino.Geometry.Mesh.DuplicateMesh
Constructs a copy of this mesh.
This is the same as Rhino.Geometry.Mesh.Duplicate.

Rhino.Geometry.Mesh.IsManifold(System.Boolean,System.Boolean@,System.Boolean@)
Gets a value indicating whether or not the mesh is manifold.
A manifold mesh does not have any edge that borders more than two faces.
topologicalTest:
If true, the query treats coincident vertices as the same.
isOriented:
isOriented will be set to true if the mesh is a manifold
and adjacent faces have compatible face normals.
hasBoundary:
hasBoundary will be set to true if the mesh is a manifold
and there is at least one "edge" with no more than one adjacent face.
Returns: true if every mesh "edge" has at most two adjacent faces.

Rhino.Geometry.Mesh.ClearTextureData
Remove all texture coordinate information from this mesh.

Rhino.Geometry.Mesh.EvaluateMeshGeometry(Rhino.Geometry.Surface)
If the mesh has SurfaceParameters, the surface is evaluated at
these parameters and the mesh geometry is updated.
surface: An input surface.
Returns: true if the operation succceeded; false otherwise.

Rhino.Geometry.Mesh.Compact
Removes any unreferenced objects from arrays, reindexes as needed
and shrinks arrays to minimum required size.
Returns: true on success, false on failure.

Rhino.Geometry.Mesh.Flip(System.Boolean,System.Boolean,System.Boolean)
Reverses the direction of the mesh.
vertexNormals: If true, vertex normals will be reversed.
faceNormals: If true, face normals will be reversed.
faceOrientation: If true, face orientations will be reversed.

Rhino.Geometry.Mesh.SolidOrientation
Determines orientation of a "solid" mesh.
Returns:
+1 = mesh is solid with outward facing normals.
-1 = mesh is solid with inward facing normals.
0 = mesh is not solid.

Rhino.Geometry.Mesh.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determines if a point is inside a solid mesh.
point: 3d point to test.
tolerance:
(>=0) 3d distance tolerance used for ray-mesh intersection
and determining strict inclusion.
strictlyIn:
If strictlyIn is true, then point must be inside mesh by at least
tolerance in order for this function to return true.
If strictlyIn is false, then this function will return true if
point is inside or the distance from point to a mesh face is <= tolerance.
Returns:
true if point is inside the solid mesh, false if not.
Remarks:
The caller is responsible for making certing the mesh is solid before
calling this function. If the mesh is not solid, the behavior is unpredictable.

Rhino.Geometry.Mesh.UnifyNormals
Attempts to fix inconsistencies in the directions of meshfaces for a mesh. This function
does not modify the vertex normals, but rather rearranges the mesh face winding and face
normals to make them all consistent. You may want to call Mesh.Normals.ComputeNormals()
to recompute vertex normals after calling this functions.
Returns: number of faces that were modified.

Rhino.Geometry.Mesh.SplitDisjointPieces
Splits up the mesh into its unconnected pieces.
Returns: An array containing all the disjoint pieces that make up this Mesh.

Rhino.Geometry.Mesh.Split(Rhino.Geometry.Plane)
Split a mesh by an infinite plane.
plane: The splitting plane.
Returns: A new mesh array with the split result. This can be null if no result was found.

Rhino.Geometry.Mesh.Split(Rhino.Geometry.Mesh)
Split a mesh with another mesh.
mesh: Mesh to split with.
Returns: An array of mesh segments representing the split result.

Rhino.Geometry.Mesh.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Split a mesh with a collection of meshes.
meshes: Meshes to split with.
Returns: An array of mesh segments representing the split result.

Rhino.Geometry.Mesh.GetOutlines(Rhino.Geometry.Plane)
Constructs the outlines of a mesh projected against a plane.
plane: A plane to project against.
Returns: An array of polylines, or null on error.

Rhino.Geometry.Mesh.GetOutlines(Rhino.Display.RhinoViewport)
Constructs the outlines of a mesh. The projection information in the
viewport is used to determine how the outlines are projected.
viewport: A viewport to determine projection direction.
Returns: An array of polylines, or null on error.

Rhino.Geometry.Mesh.GetNakedEdges
Returns all edges of a mesh that are considered "naked" in the
sense that the edge only has one face.
Returns: An array of polylines, or null on error.

Rhino.Geometry.Mesh.ExplodeAtUnweldedEdges
Explode the mesh into submeshes where a submesh is a collection of faces that are contained
within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share
the edge have unique mesh vertexes (not mesh topology vertexes) at both ends of the edge.
Returns:
Array of submeshes on success; null on error. If the count in the returned array is 1, then
nothing happened and the ouput is essentially a copy of the input.

Rhino.Geometry.Mesh.Append(Rhino.Geometry.Mesh)
Appends a copy of another mesh to this one and updates indices of appended mesh parts.
other: Mesh to append to this one.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
Returns: The point on the mesh closest to testPoint, or Point3d.Unset on failure.

Rhino.Geometry.Mesh.ClosestMeshPoint(Rhino.Geometry.Point3d,System.Double)
Gets the point on the mesh that is closest to a given test point. Similar to the
ClosestPoint function except this returns a MeshPoint class which includes
extra information beyond just the location of the closest point.
testPoint: The source of the search.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns: closest point information on success. null on failure.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,System.Double)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
pointOnMesh: Point on the mesh closest to testPoint.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,System.Double)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to seach for.
pointOnMesh: Point on the mesh closest to testPoint.
normalAtPoint: The normal vector of the mesh at the closest point.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.

Rhino.Geometry.Mesh.PointAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh at a set of barycentric coordinates.
meshPoint: MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Returns: A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.

Rhino.Geometry.Mesh.PointAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.

Rhino.Geometry.Mesh.NormalAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh normal at a set of barycentric coordinates.
meshPoint: MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Returns: A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.

Rhino.Geometry.Mesh.NormalAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.

Rhino.Geometry.Mesh.ColorAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh color at a set of barycentric coordinates.
meshPoint: MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Returns: The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid,
if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.

Rhino.Geometry.Mesh.ColorAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid,
if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.

Rhino.Geometry.Mesh.PullPointsToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Pulls a collection of points to a mesh.
points: An array, a list or any enumerable set of points.
Returns: An array of points. This can be empty.

Rhino.Geometry.Mesh.Offset(System.Double)
Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals.
Same as Mesh.Offset(distance, false)
distance: A distance value to use for offsetting.
Returns: A new mesh on success, or null on failure.

Rhino.Geometry.Mesh.Offset(System.Double,System.Boolean)
Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals.
Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges.
If solidify is false it acts exactly as the Offset(distance) function.
distance: A distance value.
solidify: true if the mesh should be solidified.
Returns: A new mesh on success, or null on failure.

Rhino.Geometry.Mesh.GetNakedEdgePointStatus
Returns an array of bool values equal in length to the number of vertices in this
mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is
not completely surrounded by faces.
Returns: An array of true/false flags that, at each index, reveals if the corresponding
vertex is completely surrounded by faces.

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Constructs contour curves for a mesh, sectioned along a linear axis.
meshToContour: A mesh to contour.
contourStart: A start point of the contouring axis.
contourEnd: An end point of the contouring axis.
interval: An interval distance.
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)
Constructs contour curves for a mesh, sectioned at a plane.
meshToContour: A mesh to contour.
sectionPlane: A cutting plane.
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Mesh.DisjointMeshCount
Gets the number of disjoint (topologically unconnected) pieces in this mesh.

Rhino.Geometry.Mesh.IsClosed
Gets a value indicating whether a mesh is considered to be closed (solid).
A mesh is considered solid when every mesh edge borders two or more faces.
Returns: true if the mesh is closed, false if it is not.

Rhino.Geometry.Mesh.Vertices
Gets access to the vertices set of this mesh.

Rhino.Geometry.Mesh.TopologyVertices
Gets the Rhino.Geometry.Collections.MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices
that were unified while computing the edge topology.

Rhino.Geometry.Mesh.TopologyEdges
Gets the Rhino.Geometry.Collections.MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.

Rhino.Geometry.Mesh.Normals
Gets access to the vertex normal collection in this mesh.

Rhino.Geometry.Mesh.Faces
Gets access to the faces collection in this mesh.

Rhino.Geometry.Mesh.FaceNormals
Gets access to the face normal collection in this mesh.

Rhino.Geometry.Mesh.VertexColors
Gets access to the (optional) vertex color collection in this mesh.

Rhino.Geometry.Mesh.TextureCoordinates
Gets access to the vertex texture coordinate collection in this mesh.