Rhino.Geometry.PolyCurve.#ctor
Initializes a new, empty polycurve.

Rhino.Geometry.PolyCurve.Duplicate
Duplicates this polycurve.
When not overridden in a derived class, this calls Rhino.Geometry.PolyCurve.DuplicatePolyCurve.
Returns: An exact duplicate of this curve.

Rhino.Geometry.PolyCurve.DuplicatePolyCurve
Duplicates this polycurve.
This is the same as Rhino.Geometry.PolyCurve.Duplicate.
Returns: An exact duplicate of this curve.

Rhino.Geometry.PolyCurve.SegmentCurve(System.Int32)
Gets the segment curve at the given index.
index: Index of segment to retrieve.
Returns: The segment at the given index or null on failure.

Rhino.Geometry.PolyCurve.RemoveNesting
Explodes nested polycurve segments and reconstructs this curve from the shattered remains.
The result will have not have any PolyCurves as segments but it will have identical
locus and parameterization.
Returns:
true if any nested PolyCurve was found and absorbed, false if no PolyCurve segments could be found.
Rhino.Geometry.PolyCurve.IsNested

Rhino.Geometry.PolyCurve.Explode
Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves.
Call Rhino.Geometry.PolyCurve.RemoveNesting first if you need all individual segments.
Returns: An array of polycurve segments.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Line)
Appends and matches the start of the line to the end of polycurve.
This function will fail if the polycurve is closed.
line: Line segment to append.
Returns: true on success, false on failure.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Arc)
Appends and matches the start of the arc to the end of polycurve.
This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
arc: Arc segment to append.
Returns: true on success, false on failure.

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Curve)
Appends and matches the start of the curve to the end of polycurve.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
curve: Segment to append.
Returns: true on success, false on failure.

Rhino.Geometry.PolyCurve.SegmentCurveParameter(System.Double)
Converts a polycurve parameter to a segment curve parameter.
polycurveParameter: Parameter on PolyCurve to convert.
Returns:
Segment curve evaluation parameter or UnsetValue if the
segment curve parameter could not be computed.

Rhino.Geometry.PolyCurve.PolyCurveParameter(System.Int32,System.Double)
Converts a segment curve parameter to a polycurve parameter.
segmentIndex: Index of segment.
segmentCurveParameter: Parameter on segment.
Returns:
Polycurve evaluation parameter or UnsetValue if the polycurve curve parameter could not be computed.

Rhino.Geometry.PolyCurve.SegmentDomain(System.Int32)
Returns the polycurve subdomain assigned to a segment curve.
segmentIndex: Index of segment.
Returns:
The polycurve subdomain assigned to a segment curve.
Returns Interval.Unset if segment_index < 0 or segment_index >= Count().

Rhino.Geometry.PolyCurve.SegmentIndex(System.Double)
Finds the segment used for evaluation at polycurve_parameter.
polycurveParameter: Parameter on polycurve for segment lookup.
Returns:
Index of the segment used for evaluation at polycurve_parameter.
If polycurve_parameter < Domain.Min(), then 0 is returned.
If polycurve_parameter > Domain.Max(), then Count()-1 is returned.

Rhino.Geometry.PolyCurve.SegmentIndexes(Rhino.Geometry.Interval,System.Int32@,System.Int32@)
Finds the segments that overlap the Polycurve sub domain.
subdomain: Domain on this PolyCurve.
segmentIndex0:
Index of first segment that overlaps the subdomain.
segmentIndex1:
Index of last segment that overlaps the subdomain. Note that segmentIndex0 <= i < segmentIndex1.
Returns: Number of segments that overlap the subdomain.

Rhino.Geometry.PolyCurve.SegmentCount
Gets the number of segments that make up this Polycurve.

Rhino.Geometry.PolyCurve.IsNested
Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
Rhino.Geometry.PolyCurve.RemoveNesting

Rhino.Geometry.PolyCurve.HasGap
This is a quick way to see if the curve has gaps between the sub curve segments.