Rhino.DocObjects.Custom.UserDataList
Represets a regulated collection of user data.

Rhino.DocObjects.Custom.UserDataList.Add(Rhino.DocObjects.Custom.UserData)
If the userdata is already in a different UserDataList, it
will be removed from that list and added to this list.
userdata: Data element.
Returns: Whether this operation succeeded.

Rhino.DocObjects.Custom.UserDataList.Find(System.Type)
Finds a specific data type in this regulated collection.
userdataType: A data type.
Returns: The found data, or null of nothing was found.

Rhino.DocObjects.Custom.UserDataList.Count
Number of UserData objects in this list.