Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
revoluteCurve: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radias for the start.
endAngleRadians: An angle in radias for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix curve and an axis.
revoluteCurve: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.
Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
revoluteLine: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radias for the start.
endAngleRadians: An angle in radias for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Line,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix line and an axis.
If the operation succeeds, results can be (truncated) cones, cylinders and circular hyperboloids.
revoluteLine: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Polyline,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix polyline and an axis.
This overload accepts a slice start and end angles.
revolutePolyline: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radias for the start.
endAngleRadians: An angle in radias for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Polyline,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix polyline and an axis.
revolutePolyline: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.CreateFromCone(Rhino.Geometry.Cone)
Constructs a new surface of revolution from the values of a cone.
cone: A cone.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.CreateFromCylinder(Rhino.Geometry.Cylinder)
Constructs a new surface of revolution from the values of a cylinder.
cylinder: A cylinder.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a new surface of revolution from the values of a sphere.
sphere: A sphere.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.

Rhino.Geometry.RevSurface.CreateFromTorus(Rhino.Geometry.Torus)
Constructs a new surface of revolution from the values of a torus.
torus: A torus.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.