Rhino.RhinoMath.ZeroTolerance
Gets the Zero Tolerance constant (1.0e-12).

Rhino.RhinoMath.UnsetValue
Gets the Rhino standard Unset value. Use this value rather than Double.NaN when
a bogus floating point value is required.

Rhino.RhinoMath.SqrtEpsilon
Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than Rhino.RhinoMath.ZeroTolerance.

Rhino.RhinoMath.DefaultAngleTolerance
Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.

Rhino.RhinoMath.UnsetSingle
Gets the single precision floating point number that is considered 'unset' in Rhino.

Rhino.RhinoMath.ToRadians(System.Double)
Convert an angle from degrees to radians.
degrees: Degrees to convert (180 degrees equals pi radians).

Rhino.RhinoMath.ToDegrees(System.Double)
Convert an angle from radians to degrees.
radians: Radians to convert (180 degrees equals pi radians).

Rhino.RhinoMath.IsValidDouble(System.Double)
Determines whether a System.Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue
System.Double.IsNaN(x) evaluates to false
System.Double.IsInfinity(x) evaluates to false
x: System.Double number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.

Rhino.RhinoMath.IsValidSingle(System.Single)
Determines whether a System.Single value is valid within the RhinoCommon context.
Rhino does not use Single.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue,
System.Single.IsNaN(x) evaluates to false
System.Single.IsInfinity(x) evaluates to false
x: System.Single number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.

Rhino.RhinoMath.UnitScale(Rhino.UnitSystem,Rhino.UnitSystem)
Computes the scale factor for changing the measurements unit systems.
from: The system to convert from.
to: The system to convert measurements into.
Returns: A scale multiplier.

Rhino.RhinoMath.Clamp(System.Int32,System.Int32,System.Int32)
Restricts a System.Int32 to be specified within an interval of two integers.
value: An integer.
bound1: A first bound.
bound2: A second bound. This does not necessarily need to be larger or smaller than bound1.
Returns: The clamped value.

Rhino.RhinoMath.Clamp(System.Double,System.Double,System.Double)
Restricts a System.Double to be specified within an interval of two numbers.
value: A number.
bound1: A first bound.
bound2: A second bound. This does not necessarily need to be larger or smaller than bound1.
Returns: The clamped value.

Rhino.RhinoMath.CRC32(System.UInt32,System.Byte[])
Advances the cyclic redundancy check value remainder given a byte array.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
buffer: The value to add to the current remainder.
Returns: The new current remainder.

Rhino.RhinoMath.CRC32(System.UInt32,System.Double)
Advances the cyclic redundancy check value remainder given a System.Double.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
value: The value to add to the current remainder.
Returns: The new current remainder.

Rhino.RhinoMath.CRC32(System.UInt32,System.Int32)
Advances the cyclic redundancy check value remainder given a System.Int32.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
value: The value to add to the current remainder.
Returns: The new current remainder.