Rhino.Geometry.Collections.MeshFaceList.Clear
Clears the Face list on the mesh.

Rhino.Geometry.Collections.MeshFaceList.AddFace(Rhino.Geometry.MeshFace)
Appends a new mesh face to the end of the mesh face list.
face: Face to add.
Returns: The index of the newly added face.

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32)
Appends a new triangular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
Returns: The index of the newly added triangle.

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32,System.Int32)
Appends a new quadragular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
vertex4: Index of fourth face corner.
Returns: The index of the newly added quad.

Rhino.Geometry.Collections.MeshFaceList.AddFaces(System.Collections.Generic.IEnumerable{Rhino.Geometry.MeshFace})
Appends a list of faces to the end of the mesh face list.
faces: Faces to add.
Returns: Indices of the newly created faces

Rhino.Geometry.Collections.MeshFaceList.Insert(System.Int32,Rhino.Geometry.MeshFace)
Inserts a mesh face at a defined index in this list.
index: An index.
face: A face.
Throws System.ArgumentOutOfRangeException: If index is negative or >= Count.

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,Rhino.Geometry.MeshFace)
Sets a face at a specific index of the mesh.
index: A position in the list.
face: A face.
Returns: true if the operation succeeded, otherwise false.

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,System.Int32,System.Int32,System.Int32)
Sets a triangular face at a specific index of the mesh.
index: A position in the list.
vertex1: The first vertex index.
vertex2: The second vertex index.
vertex3: The third vertex index.
Returns: true if the operation succeeded, otherwise false.

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Sets a quadrangular face at a specific index of the mesh.
index: A position in the list.
vertex1: The first vertex index.
vertex2: The second vertex index.
vertex3: The third vertex index.
vertex4: The fourth vertex index.
Returns: true if the operation succeeded, otherwise false.

Rhino.Geometry.Collections.MeshFaceList.GetFace(System.Int32)
Returns the mesh face at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.
Returns: The mesh face at the given index on success or MeshFace.Unset if the index is out of range.

Rhino.Geometry.Collections.MeshFaceList.GetFaceVertices(System.Int32,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@)
Gets the 3D location of the vertices forming a face.
faceIndex: A face index.
a: A first point. This out argument is assigned during the call.
b: A second point. This out argument is assigned during the call.
c: A third point. This out argument is assigned during the call.
d: A fourth point. This out argument is assigned during the call.
Returns: true if the operation succeeded, otherwise false.

Rhino.Geometry.Collections.MeshFaceList.GetFaceBoundingBox(System.Int32)
Gets the bounding box of a face.
faceIndex: A face index.
Returns: A new bounding box, or Rhino.Geometry.BoundingBox.Empty on error.

Rhino.Geometry.Collections.MeshFaceList.GetFaceCenter(System.Int32)
Gets the center point of a face.
For a triangular face, this is considered the centroid or barycenter.
For a quad, this is considered the bimedians intersection
(the avarage of four points).
faceIndex: A face index.
Returns: The center point.

Rhino.Geometry.Collections.MeshFaceList.AdjacentFaces(System.Int32)
Gets all faces that share a topological edge with a given face.
faceIndex: A face index.
Returns: All indices that share an edge.

Rhino.Geometry.Collections.MeshFaceList.DeleteFaces(System.Collections.Generic.IEnumerable{System.Int32})
Removes a collection of faces from the mesh without affecting the remaining geometry.
faceIndexes: An array containing all the face indices to be removed.
Returns: The number of faces deleted on success.

Rhino.Geometry.Collections.MeshFaceList.RemoveAt(System.Int32)
Removes a face from the mesh.
index: The index of the face that will be removed.
Throws System.ArgumentOutOfRangeException: If index is < 0 or >= Count.

Rhino.Geometry.Collections.MeshFaceList.ConvertQuadsToTriangles
Splits all quads along the short diagonal.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshFaceList.ConvertTrianglesToQuads(System.Double,System.Double)
Joins adjacent triangles into quads if the resulting quad is 'nice'.
angleToleranceRadians:
Used to compare adjacent triangles' face normals. For two triangles
to be considered, the angle between their face normals has to
be <= angleToleranceRadians. When in doubt use RhinoMath.PI/90.0 (2 degrees).
minimumDiagonalLengthRatio:
( <= 1.0) For two triangles to be considered the ratio of the
resulting quad's diagonals
(length of the shortest diagonal)/(length of longest diagonal).
has to be >= minimumDiagonalLengthRatio. When in doubt us .875.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshFaceList.CullDegenerateFaces
Attempts to removes degenerate faces from the mesh.
Degenerate faces are faces that contains such a combination of indices,
that their final shape collapsed in a line or point.
Before returning, this method also attempts to repair faces by juggling
vertex indices.
Returns: The number of degenerate faces that were removed.

Rhino.Geometry.Collections.MeshFaceList.IsHidden(System.Int32)
Gets a value indicating whether a face is hidden.
A face is hidden if, and only if, at least one of its vertices is hidden.
faceIndex: A face index.
Returns: true if hidden, false if fully visible.

Rhino.Geometry.Collections.MeshFaceList.HasNakedEdges(System.Int32)
Returns true if at least one of the face edges are not topologically
connected to any other faces.
faceIndex: A face index.
Returns: true if that face makes the mesh open, otherwise false.

Rhino.Geometry.Collections.MeshFaceList.GetTopologicalVertices(System.Int32)
Gets the topology vertex indices of a face.
faceIndex: A face index.
Returns: An array of integers.

Rhino.Geometry.Collections.MeshFaceList.GetEnumerator
Gets an enumerator that yields all faces in this collection.
Returns: The enumerator.

Rhino.Geometry.Collections.MeshFaceList.Count
Gets or sets the number of mesh faces.

Rhino.Geometry.Collections.MeshFaceList.QuadCount
Gets the number of faces that are quads (4 corners).

Rhino.Geometry.Collections.MeshFaceList.TriangleCount
Gets the number of faces that are triangles (3 corners).