Rhino.DocObjects.InstanceDefinition.Object(System.Int32)
returns an object used as part of this definition.
index: 0 <= index < ObjectCount.
Returns:
Returns an object that is used to define the geometry.
Does NOT return an object that references this definition.count the number of references to this instance.

Rhino.DocObjects.InstanceDefinition.GetObjects
Gets an array with the objects that belong to this instance definition.
Returns: An array of Rhino objects. The returned array can be empty, but not null.

Rhino.DocObjects.InstanceDefinition.GetReferences(System.Int32)
Gets a list of the CRhinoInstanceObjects (inserts) that contains
a reference this instance definition.
wheretoLook:
0 = get top level references in active document.
1 = get top level and nested references in active document.
2 = check for references from other instance definitions.
Returns: An array of instance objects. The returned array can be empty, but not null.

Rhino.DocObjects.InstanceDefinition.GetContainers
Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
Returns: An array of instance definitions. The returned array can be empty, but not null.

Rhino.DocObjects.InstanceDefinition.UsesDefinition(System.Int32)
Determines if this instance definition contains a reference to another instance definition.
otherIdefIndex: index of another instance definition.
Returns:
0      no
1      other_idef_index is the index of this instance definition
>1      This InstanceDefinition uses the instance definition
and the returned value is the nesting depth.

Rhino.DocObjects.InstanceDefinition.InUse(System.Int32)
Determines whether the instance definition is referenced.
wheretoLook:
0 = check for top level references in active document.
1 = check for top level and nested references in active document.
2 = check for references in other instance definitions.
Returns: true if the instance definition is used; otherwise false.

Rhino.DocObjects.InstanceDefinition.ObjectCount
Number of objects this definition uses. This counts the objects that are used to define the geometry.
This does NOT count the number of references to this instance definition.

Rhino.DocObjects.InstanceDefinition.Index
Index of this instance definition in the index definition table.

Rhino.DocObjects.InstanceDefinition.IsReference
An object from a work session reference model is reference a
reference object and cannot be modified.  An object is a reference
object if, and only if, it is on a reference layer.

Rhino.DocObjects.InstanceDefinition.SkipNestedLinkedDefinitions
Controls how much geometry is read when a linked InstanceDefinition is updated.
Returns: If this returns true then nested linked InstanceDefinition objects will be skipped otherwise; read everything, included nested linked InstanceDefinition objects

Rhino.DocObjects.InstanceDefinition.UrlDescription
The URL description displayed as a hyperlink in the Insert and Block UI

Rhino.DocObjects.InstanceDefinition.Url
The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI