Rhino.Geometry.Point4d.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the Rhino.Geometry.Point4d class based on coordinates.
x: The X (first) dimension.
y: The Y (second) dimension.
z: The Z (third) dimension.
w: The W (fourth) dimension, or weight.

Rhino.Geometry.Point4d.#ctor(Rhino.Geometry.Point3d)
Initializes a new instance of the Rhino.Geometry.Point4d class from the coordinates of a point.
point: .

Rhino.Geometry.Point4d.Add(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Sums two Rhino.Geometry.Point4d together.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point1: First point.
point2: Second point.
Returns: A new point that results from the weighted addition of point1 and point2.

Rhino.Geometry.Point4d.op_Subtraction(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Subtracts the second point from the first point.
point1: First point.
point2: Second point.
Returns: A new point that results from the weighted subtraction of point2 from point1.

Rhino.Geometry.Point4d.Subtract(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: First point.
point2: Second point.
Returns: A new point that results from the weighted subtraction of point2 from point1.

Rhino.Geometry.Point4d.op_Multiply(Rhino.Geometry.Point4d,System.Double)
Multiplies a point by a number.
point: A point.
d: A number.
Returns: A new point that results from the coordinatewise multiplication of point with d.

Rhino.Geometry.Point4d.Multiply(Rhino.Geometry.Point4d,System.Double)
Multiplies a point by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
d: A number.
Returns: A new point that results from the coordinatewise multiplication of point with d.

Rhino.Geometry.Point4d.op_Multiply(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Multiplies two Rhino.Geometry.Point4d together, returning the dot (internal) product of the two.
This is not the cross product.
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinatewise multiplication of point1 and point2.

Rhino.Geometry.Point4d.op_Equality(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Determines whether two Point4d have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are equal; otherwise false.

Rhino.Geometry.Point4d.op_Inequality(Rhino.Geometry.Point4d,Rhino.Geometry.Point4d)
Determines whether two Point4d have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.

Rhino.Geometry.Point4d.Equals(Rhino.Geometry.Point4d)
Determines whether the specified point has same value as the present point.
point: The specified point.
Returns: true if point has the same value as this; otherwise false.

Rhino.Geometry.Point4d.GetHashCode
Computes the hash code for the present point.
Returns: A non-unique hash code, which uses all coordiantes of this object.

Rhino.Geometry.Point4d.X
Gets or sets the X (first) coordinate of this point.

Rhino.Geometry.Point4d.Y
Gets or sets the Y (second) coordinate of this point.

Rhino.Geometry.Point4d.Z
Gets or sets the Z (third) coordinate of this point.

Rhino.Geometry.Point4d.W
Gets or sets the W (fourth) coordinate -or weight- of this point.

Rhino.Geometry.Point4d.Unset
Gets the value of a point with all coordinates set as RhinoMath.UnsetValue.