Rhino.Display.RhinoView.ScreenToClient(System.Drawing.Point)
Converts a point in screen coordinates to client coordinates for this view.
screenPoint: The 2D screen point.
Returns: A 2D point in client coordinates.

Rhino.Display.RhinoView.Redraw
Redraws this view.
Remarks:
If you change something in "this" view like the projection, construction plane,
background bitmap, etc., then you need to call RhinoView.Redraw() to redraw
"this" view./ The other views will not be changed. If you change something in
the document (like adding new geometry to the model), then you need to call
RhinoDoc.Views.Redraw() to redraw all the views.

Rhino.Display.RhinoView.CreateWireframePreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
[in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
Returns: true if successful.

Rhino.Display.RhinoView.CreateShadedPreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
[in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
useGhostedShading: true if ghosted shading (partially transparent shading) should be used.
Returns: true if successful.

Rhino.Display.RhinoView.CaptureToBitmap
Capture View contents to a bitmap.
Returns: The bitmap of the complete view.

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size)
Capture View contents to a bitmap.
size: Size of Bitmap to capture to.
Returns: The bitmap of the specified part of the view.

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
size: The width and height of the returned bitmap.
grid: true if the construction plane grid should be visible.
worldAxes: true if the world axis should be visible.
cplaneAxes: true if the construction plane close the the grid should be visible.
Returns: A new bitmap.

Rhino.Display.RhinoView.CaptureToBitmap(System.Boolean,System.Boolean,System.Boolean)
Captures the view contents to a bitmap allowing for visibility of grid and axes.
grid: true if the construction plane grid should be visible.
worldAxes: true if the world axis should be visible.
cplaneAxes: true if the construction plane close the the grid should be visible.
Returns: A new bitmap.

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,Rhino.Display.DisplayModeDescription)
Capture View contents to a bitmap using a display mode description to define
how drawing is performed.
size: The width and height of the returned bitmap.
mode: The display mode.
Returns: A new bitmap.

Rhino.Display.RhinoView.CaptureToBitmap(Rhino.Display.DisplayModeDescription)
Capture View contents to a bitmap using a display mode description to define
how drawing is performed.
mode: The display mode.
Returns: A new bitmap.

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,Rhino.Display.DisplayPipelineAttributes)
Capture View contents to a bitmap using display attributes to define how
drawing is performed.
size: The width and height of the returned bitmap.
attributes: The specific display mode attributes.
Returns: A new bitmap.

Rhino.Display.RhinoView.CaptureToBitmap(Rhino.Display.DisplayPipelineAttributes)
Captures view contents to a bitmap using display attributes to define how
drawing is performed.
attributes: The specific display mode attributes.
Returns: A new bitmap.

Rhino.Display.RhinoView.Close
Remove this View from Rhino. DO NOT attempt to use this instance of this
class after calling Close.
Returns: true on success

Rhino.Display.RhinoView.Handle
Gets the window handle that this view is bound to.

Rhino.Display.RhinoView.Bounds
Gets or sets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.

Rhino.Display.RhinoView.ClientRectangle
Gets the rectangle that represents the client area of the view.

Rhino.Display.RhinoView.ScreenRectangle
Gets the rectangle that represents the client area of the view in screen coordinates.

Rhino.Display.RhinoView.EnableDrawing
Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scipts want to disable drawing for a while.

Rhino.Display.RhinoView.MainViewport
A RhinoView contains a "main viewport" that fills the entire view client window.
RhinoPageViews may also contain nested child RhinoViewports for implementing
detail viewports.
The MainViewport will always return this RhinoView's m_vp.

Rhino.Display.RhinoView.ActiveViewport
The ActiveViewport is the same as the MainViewport for standard RhinoViews. In
a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object.
Most of the time, you will use ActiveViewport unless you explicitly need to work with
the main viewport.

Rhino.Display.RhinoView.ActiveViewportID
Returns viewport ID for the active viewport. Faster than ActiveViewport function when
working with page views.

Rhino.Display.RhinoView.TitleVisible
Visibility of the viewport title window.

Rhino.Display.RhinoView.Floating
Floating state of RhinoView.
if true, then the view will be in a floating frame window. Otherwise
the view will be embeded in the main frame.