Rhino.Collections.Point3dList.#ctor
Initializes a new empty list with default capacity.

Rhino.Collections.Point3dList.#ctor(System.Int32)
Initializes a new point list with a preallocated initial capacity.
initialCapacity: The number of added items before which the underlying array will be resized.

Rhino.Collections.Point3dList.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new point list by copying the values from another set.
collection: The collection to copy from.

Rhino.Collections.Point3dList.#ctor(Rhino.Geometry.Point3d[])
Constructs a new point list from values in a point array.
initialPoints: Points to add to the list.

Rhino.Collections.Point3dList.GetConstPointArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32@)
Anything calling this function should not be modifying the contents of the array.
points: A list, an array or any enumerable set of points.
count: The resulting count of elements.
Returns: An array.

Rhino.Collections.Point3dList.ClosestIndex(Rhino.Geometry.Point3d)
Finds the index of the point that is closest to a test point in this list.
testPoint: point to compare against.
Returns: index of closest point in the list on success. -1 on error.

Rhino.Collections.Point3dList.Add(System.Double,System.Double,System.Double)
Adds a Point3d to the end of the list with given x,y,z coordinates.
x: The X coordinate.
y: The Y coordinate.
z: The Z coordinate.

Rhino.Collections.Point3dList.Transform(Rhino.Geometry.Transform)
Applies a transform to all the points in the list.
xform: Transform to apply.

Rhino.Collections.Point3dList.ClosestIndexInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Finds the index of the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns: Index of closest point in the list on success or -1 on error.

Rhino.Collections.Point3dList.ClosestPointInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Finds the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns: A point.
Throws System.ArgumentException:
List must contain at least one point and testPoint must be valid.

Rhino.Collections.Point3dList.BoundingBox
Even though this is a property, it is not a "fast" calculation. Every point is
evaluated in order to get the bounding box of the list.

Rhino.Collections.Point3dList.X
Returns an indexer with all X coordinates in this list.

Rhino.Collections.Point3dList.Y
Returns an indexer with all Y coordinates in this list.

Rhino.Collections.Point3dList.Z
Returns an indexer with all Z coordinates in this list.