Rhino.DocObjects.InstanceDefinitionUpdateType
The possible relationships between the instance definition geometry
and the archive containing the original defition.

Rhino.DocObjects.InstanceDefinitionUpdateType.Embedded
This instance definition geometry was imported from another archive (m_source_archive)
and is embedded. If m_source_archive changes, the user is asked if they want to update
the instance definition.

Rhino.DocObjects.InstanceDefinitionUpdateType.LinkedAndEmbedded
This instance definition geometry was imported from another archive (m_source_archive)
and is embedded. If m_source_archive changes, the instance definition is automatically
updated. If m_source_archive is not available, the instance definition is still valid.

Rhino.DocObjects.InstanceDefinitionUpdateType.Linked
This instance definition geometry was imported from another archive (m_source_archive)
and is not embedded. If m_source_archive changes, the instance definition is automatically
updated. If m_source_archive is not available, the instance definition is not valid.
This does not save runtime memory.  It may save a little disk space, but it is a  foolish
option requested by people who do not understand all the issues.