Rhino.Geometry.MeshingParameters.#ctor
Initializes a new instance with default values.
Initial values are same as Rhino.Geometry.MeshingParameters.Default.

Rhino.Geometry.MeshingParameters.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.MeshingParameters.DocumentCurrentSetting(Rhino.RhinoDoc)
Gets the MeshingParameters that are currently set for a document.
These are the same settings that are shown in the DocumentProperties
"mesh settings" user interface.
doc: A Rhino document to query.
Returns: Meshing parameters of the document.
Throws System.ArgumentNullException: If doc is null.

Rhino.Geometry.MeshingParameters.Minimal
Gets minimal meshing parameters.

Rhino.Geometry.MeshingParameters.Default
Gets default meshing parameters.

Rhino.Geometry.MeshingParameters.Coarse
Gets meshing parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.

Rhino.Geometry.MeshingParameters.Smooth
Gets meshing parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.

Rhino.Geometry.MeshingParameters.JaggedSeams
Gets or sets whether or not the mesh is allowed to have jagged seams.
When this flag is set to true, meshes on either side of a Brep Edge will not match up.

Rhino.Geometry.MeshingParameters.RefineGrid
Gets or sets a value indicating whether or not the sampling grid can be refined
when certain tolerances are not met.

Rhino.Geometry.MeshingParameters.SimplePlanes
Gets or sets a value indicating whether or not planar areas are allowed
to be meshed in a simplified manner.

Rhino.Geometry.MeshingParameters.ComputeCurvature
Gets or sets a value indicating whether or not surface curvature
data will be embedded in the mesh.

Rhino.Geometry.MeshingParameters.GridMinCount
Gets or sets the minimum number of grid quads in the initial sampling grid.

Rhino.Geometry.MeshingParameters.GridMaxCount
Gets or sets the maximum number of grid quads in the initial sampling grid.

Rhino.Geometry.MeshingParameters.GridAngle
Gets or sets the maximum allowed angle difference (in radians)
for a single sampling quad. The angle pertains to the surface normals.

Rhino.Geometry.MeshingParameters.GridAspectRatio
Gets or sets the maximum allowed aspect ratio of sampling quads.

Rhino.Geometry.MeshingParameters.GridAmplification
Gets or sets the grid amplification factor.
Values lower than 1.0 will decrease the number of initial quads,
values higher than 1.0 will increase the number of initial quads.

Rhino.Geometry.MeshingParameters.Tolerance
Gets or sets the maximum allowed edge deviation.
This tolerance is measured between the center of the mesh edge and the surface.

Rhino.Geometry.MeshingParameters.MinimumTolerance
Gets or sets the minimum tolerance.

Rhino.Geometry.MeshingParameters.RelativeTolerance
Gets or sets the relative tolerance.

Rhino.Geometry.MeshingParameters.MinimumEdgeLength
Gets or sets the minimum allowed mesh edge length.

Rhino.Geometry.MeshingParameters.MaximumEdgeLength
Gets or sets the maximum allowed mesh edge length.

Rhino.Geometry.MeshingParameters.RefineAngle
Gets or sets the mesh parameter refine angle.