Rhino.Runtime.InteropWrappers.SimpleArrayLine.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLine instance.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.Count
Gets the amount of lines in this array.