Rhino.Geometry.Collections.NurbsCurveKnotList
Provides access to the knot vector of a nurbs curve.

Rhino.Geometry.Collections.NurbsCurveKnotList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.

Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double,System.Int32)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
multiplicity: Multiplicity of knot to insert.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.KnotMultiplicity(System.Int32)
Get knot multiplicity.
index: Index of knot to query.
Returns: The multiplicity (valence) of the knot.

Rhino.Geometry.Collections.NurbsCurveKnotList.CreateUniformKnots(System.Double)
Compute a clamped, uniform knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.CreatePeriodicKnots(System.Double)
Compute a clamped, uniform, periodic knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.ClampEnd(Rhino.Geometry.CurveEnd)
Clamp end knots. Does not modify control point locations.
end: Curve end to clamp.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.SuperfluousKnot(System.Boolean)
Computes the knots that are superfluous because they are not used in NURBs evaluation.
These make it appear so that the first and last curve spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
start: true if the query targets the first knot. Otherwise, the last knot.
Returns: A component.

Rhino.Geometry.Collections.NurbsCurveKnotList.Count
Total number of knots in this curve.

Rhino.Geometry.Collections.NurbsCurveKnotList.IsClampedStart
Gets a value indicating whether or not the knot vector is clamped at the start of the curve.
Clamped curves start at the first control-point. This requires fully multiple knots.

Rhino.Geometry.Collections.NurbsCurveKnotList.IsClampedEnd
Gets a value indicating whether or not the knot vector is clamped at the end of the curve.
Clamped curves are coincident with the first and last control-point. This requires fully multiple knots.