Rhino.Display.VisualAnalysisMode.Register(System.Type)
Registers a custom visual analysis mode for use in Rhino.  It is OK to call
register multiple times for a single custom analysis mode type, since subsequent
register calls will notice that the type has already been registered.
customAnalysisModeType:
Must be a type that is a subclass of VisualAnalysisMode.
Returns:
An instance of registered analysis mode on success.

Rhino.Display.VisualAnalysisMode.Find(System.Guid)
Finds a visual analysis mode by guid.
id: The globally unique identifier to search for.
Returns: The found visual analysis mode, or null if it was not found, or on error.

Rhino.Display.VisualAnalysisMode.Find(System.Type)
Finds a visual analysis mode by type.
t: A visual analysis mode type.
Returns: A visual analysis mode on success, or null on error.

Rhino.Display.VisualAnalysisMode.EnableUserInterface(System.Boolean)
Turns the analysis mode's user interface on and off. For Rhino's built
in modes this opens or closes the modeless dialog that controls the
analysis mode's display settings.
on: true if the inferface should be shown; false if it should be concealed.

Rhino.Display.VisualAnalysisMode.ObjectSupportsAnalysisMode(Rhino.DocObjects.RhinoObject)
Gets a value indicating if this visual analysis mode can be used on a given Rhino object.
obj: The object to be tested.
Returns: true if this mode can indeed be used on the object; otherwise false.

Rhino.Display.VisualAnalysisMode.SetUpDisplayAttributes(Rhino.DocObjects.RhinoObject,Rhino.Display.DisplayPipelineAttributes)
If an analysis mode needs to modify display attributes, this is the place
to do it.  In particular, Style==Texture, then this function must be
overridden.
Remarks:
Shaded analysis modes that use texture mapping, like zebra and emap,
override this function set the tex, diffuse_color, and EnableLighting
parameter.
obj: The object for which to set up attributes.
attributes: The linked attributes.

Rhino.Display.VisualAnalysisMode.RhinoEdgeAnalysisModeId
Id for Rhino's built-in edge analysis mode. Brep and mesh edges are
shown in a selected color.

Rhino.Display.VisualAnalysisMode.RhinoCurvatureGraphAnalysisModeId
Id for Rhino's built-in curvature graphs analysis mode. Curvature hair
is shown on curves and surfaces.

Rhino.Display.VisualAnalysisMode.RhinoZebraStripeAnalysisModeId
Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are
shown on surfaces and meshes.

Rhino.Display.VisualAnalysisMode.RhinoEmapAnalysisModeId
Id for Rhino's built-in emap analysis mode.  An environment map is
shown on sufaces and meshes.

Rhino.Display.VisualAnalysisMode.RhinoCurvatureColorAnalyisModeId
Id for Rhino's built-in curvature color analysis mode.  Surface curvature
is shown using false color mapping.

Rhino.Display.VisualAnalysisMode.RhinoDraftAngleAnalysisModeId
Id for Rhino's built-in draft angle analysis mode.  Draft angle is
displayed using false colors.

Rhino.Display.VisualAnalysisMode.RhinoThicknessAnalysisModeId
Id for Rhino's built-in thickness analysis mode.

Rhino.Display.VisualAnalysisMode.Name
Gets the name of the analysis mode. It is used by the _What command and the object
properties details window to describe the object.

Rhino.Display.VisualAnalysisMode.Style
Gets the visual analysis mode style.

Rhino.Display.VisualAnalysisMode.Id
Gets the visual analysis mode GUID.
The Guid is specified with the GuidAttribute
applied to the class.

Rhino.Display.VisualAnalysisMode.ShowIsoCurves
Gets true if this visual analysis mode will show isocuves on shaded surface
objects.  Often a mode's user interface will provide a way to change this
setting.
The default is false.