Rhino.Geometry.NurbsSurface.Create(System.Int32,System.Boolean,System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a new NURBS surface with internal uninitialized arrays.
dimension: The number of dimensions.>= 1. This value is usually 3.
isRational: true to make a rational NURBS.
order0: The order in U direction.>= 2.
order1: The order in V direction.>= 2.
controlPointCount0: Control point count in U direction.>= order0.
controlPointCount1: Control point count in V direction.>= order1.
Returns: A new NURBS surface, or null on error.

Rhino.Geometry.NurbsSurface.CreateFromCone(Rhino.Geometry.Cone)
Constructs a new NURBS surfaces from cone data.
cone: A cone value.
Returns: A new NURBS surface, or null on error.

Rhino.Geometry.NurbsSurface.CreateFromCylinder(Rhino.Geometry.Cylinder)
Constructs a new NURBS surfaces from cylinder data.
cylinder: A cylinder value.
Returns: A new NURBS surface, or null on error.

Rhino.Geometry.NurbsSurface.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a new NURBS surfaces from sphere data.
sphere: A sphere value.
Returns: A new NURBS surface, or null on error.

Rhino.Geometry.NurbsSurface.CreateFromTorus(Rhino.Geometry.Torus)
Constructs a new NURBS surfaces from torus data.
torus: A torus value.
Returns: A new NURBS surface, or null on error.

Rhino.Geometry.NurbsSurface.CreateRuledSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a ruled surface between two curves. Curves must share the same knot-vector.
curveA: First curve.
curveB: Second curve.
Returns: A ruled surface on success or null on failure.

Rhino.Geometry.NurbsSurface.CreateFromPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a surface from control-points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateThroughPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a surface from control-points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
uClosed: true if the surface should be closed in the U direction.
vClosed: true if the surface should be closed in the V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Makes a surface from 4 corner points.
This is the same as calling Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double) with tolerance 0.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
corner4: The fourth corner.
Returns: the resulting surface or null on error.

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Makes a surface from 4 corner points.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
corner4: The fourth corner.
tolerance: Minimum edge length without collapsing to a singularity.
Returns: The resulting surface or null on error.

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Makes a surface from 3 corner points.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
Returns: The resulting surface or null on error.

Rhino.Geometry.NurbsSurface.CreateRailRevolvedSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Boolean)
Constructs a railed Surface-of-Revolution.
profile: Profile curve for revolution.
rail: Rail curve for revolution.
axis: Axis of revolution.
scaleHeight: If true, surface will be locally scaled.
Returns: A NurbsSurface or null on failure.

Rhino.Geometry.NurbsSurface.#ctor(Rhino.Geometry.NurbsSurface)
Initializes a new NURBS surface by copying the values from another surface.
other: Another surface.

Rhino.Geometry.NurbsSurface.MakeRational
Makes this surface rational.
Returns: true if the operation succeeded; otherwise, false.

Rhino.Geometry.NurbsSurface.MakeNonRational
Makes this surface non-rational.
Returns: true if the operation succeeded; otherwise, false.

Rhino.Geometry.NurbsSurface.CopyFrom(Rhino.Geometry.NurbsSurface)
Copies this NURBS surface from another NURBS surface.
other: The other NURBS surface to use as source.

Rhino.Geometry.NurbsSurface.KnotsU
The U direction knot vector.

Rhino.Geometry.NurbsSurface.KnotsV
The V direction knot vector.

Rhino.Geometry.NurbsSurface.Points
Gets a collection of surface control points that form this surface.

Rhino.Geometry.NurbsSurface.IsRational
Gets a value indicating whether or not the nurbs surface is rational.

Rhino.Geometry.NurbsSurface.OrderU
Gets the order in the U direction.

Rhino.Geometry.NurbsSurface.OrderV
Gets the order in the V direction.