Rhino.Geometry.ControlPoint
Represents control-point geometry with three-dimensional position and weight.

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double)
Constructs a new unweighted control point.
x: X coordinate of Control Point.
y: Y coordinate of Control Point.
z: Z coordinate of Control Point.

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new weighted control point.
x: X coordinate of Control Point.
y: Y coordinate of Control Point.
z: Z coordinate of Control Point.
weight: Weight factor of Control Point.
You should not use weights equal to or less than zero.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d)
Constructs a new unweighted control point.
pt: Coordinate of Control Point.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d,System.Double)
Constructs a new weighted control point.
pt: Coordinate of Control Point.
weight: Weight factor of Control Point.
You should not use weights equal to or less than zero.

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point4d)
Constructs a new weighted control point.
pt: Control point values.

Rhino.Geometry.ControlPoint.Unset
Gets the predefined unset control point.

Rhino.Geometry.ControlPoint.Location
Gets or sets the location of the control point.
Internally, Rhino stores the location of a weighted control-point
as a pre-multiplied coordinate, but RhinoCommon always provides
Euclidean coordinates for control-points, regardless of weight.

Rhino.Geometry.ControlPoint.Weight
Gets or sets the weight of this control point.