Rhino.ApplicationSettings.AppearanceSettings.GetDefaultState
Gets the factory settings of the application.
Returns: An instance of a class that represents all the default settings joined together.

Rhino.ApplicationSettings.AppearanceSettings.GetCurrentState
Gets the current settings of the application.
Returns: An instance of a class that represents all the settings as they appear in the Rhino _Options dialog,
joined in a single class.

Rhino.ApplicationSettings.AppearanceSettings.RestoreDefaults
Commits the default settings as the current settings.

Rhino.ApplicationSettings.AppearanceSettings.UpdateFromState(Rhino.ApplicationSettings.AppearanceSettingsState)
Sets all settings to a particular defined joined state.
state: A joined settings object.

Rhino.ApplicationSettings.AppearanceSettings.InitialMainWindowState(System.Drawing.Rectangle@,System.Windows.Forms.FormWindowState@)
Location where the Main Rhino window attempts to show when the application is first
started.
bounds: The rectangle in which the main window attempts to shows is assigned to this out parameter during the call.
state: The form state is assigned to this out parameter during the call.
Returns: false if the information could not be retrieved.

Rhino.ApplicationSettings.AppearanceSettings.DefaultFontFaceName
Gets or sets the default font face name used in Rhino.

Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
Gets or sets the default layer color.

Rhino.ApplicationSettings.AppearanceSettings.SelectedObjectColor
The color used to draw selected objects.
The default is yellow, but this can be customized by the user.

Rhino.ApplicationSettings.AppearanceSettings.LockedObjectColor
color used to draw locked objects.

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconXAxisColor
Gets or sets the color of the world coordinate X axis.

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconYAxisColor
Gets or sets the color of the world coordinate Y axis.

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconZAxisColor
Gets or sets the color of the world coordinate Z axis.

Rhino.ApplicationSettings.AppearanceSettings.TrackingColor
Gets or sets the tracking color.

Rhino.ApplicationSettings.AppearanceSettings.FeedbackColor
Gets or sets the feedback color.

Rhino.ApplicationSettings.AppearanceSettings.DefaultObjectColor
Gets or sets the default color for new objects.

Rhino.ApplicationSettings.AppearanceSettings.ViewportBackgroundColor
Gets or sets the viewport background color.

Rhino.ApplicationSettings.AppearanceSettings.FrameBackgroundColor
Gets or sets the background color of the frame.

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptTextColor
Gets or sets the color of the command prompt text.

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptHypertextColor
Gets or sets the color of the command prompt hypertext.

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptBackgroundColor
Gets or sets the color of the command prompt background.

Rhino.ApplicationSettings.AppearanceSettings.CrosshairColor
Gets or sets the color of the crosshair icon.

Rhino.ApplicationSettings.AppearanceSettings.PageviewPaperColor
Gets or sets the paper background. A rectangle is drawn into the background
of page views to represent the printed area. The alpha portion of the color
is used to draw the paper blended into the background

Rhino.ApplicationSettings.AppearanceSettings.CurrentLayerBackgroundColor
Gets or sets the color used by the layer manager dialog as the background color for the current layer.

Rhino.ApplicationSettings.AppearanceSettings.GridThinLineColor
Gets or sets the color of the thin line of the grid.

Rhino.ApplicationSettings.AppearanceSettings.GridThickLineColor
Gets or sets the color of the thick line of the grid.

Rhino.ApplicationSettings.AppearanceSettings.GridXAxisLineColor
Gets or sets the color of the X axis of the grid.

Rhino.ApplicationSettings.AppearanceSettings.GridYAxisLineColor
Gets or sets the color of the Y axis of the grid.

Rhino.ApplicationSettings.AppearanceSettings.GridZAxisLineColor
Gets or sets the color of the Z axis of the grid.

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptPosition
Gets or sets the command prompt position.

Rhino.ApplicationSettings.AppearanceSettings.EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.

Rhino.ApplicationSettings.AppearanceSettings.EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.

Rhino.ApplicationSettings.AppearanceSettings.ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.

Rhino.ApplicationSettings.AppearanceSettings.ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.

Rhino.ApplicationSettings.AppearanceSettings.MenuVisible
Gets or sets a value that determines if the File menu is visible.

Rhino.ApplicationSettings.AppearanceSettings.LanguageIdentifier
Gets or sets the language identifier.

Rhino.ApplicationSettings.AppearanceSettings.PreviousLanguageIdentifier
Gets or sets the previous language identifier.