Rhino.DocObjects.Tables.GroupTable.Find(System.String,System.Boolean)
Finds a group with a given name.
groupName:
Name of group to search for. Ignores case.
ignoreDeletedGroups:
true means don't search deleted groups.
Returns:
>=0 index of the group with the given name.
-1 no group found with the given name.

Rhino.DocObjects.Tables.GroupTable.Add(System.String)
Adds a new empty group to the group table.
groupName: name of new group.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add
Adds a new empty group to the group table.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Adds a new group to the group table with a set of objects.
groupName: Name of new group.
objectIds: An array, a list or any enumerable set of object IDs.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.Add(System.Collections.Generic.IEnumerable{System.Guid})
Adds a new group to the group table with a set of objects.
objectIds: An array, a list or any enumerable set of object IDs.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Guid)
Adds an object to an existing group.
groupIndex: The group index value.
objectId: An ID of an object.
Returns: true if the operation was successful.

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})
Adds a list of objects to an existing group.
groupIndex: The group index value.
objectIds: An array, a list or any enumerable set of IDs to objects.
Returns: true if at least an operation was successful.

Rhino.DocObjects.Tables.GroupTable.Delete(System.Int32)
Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo
will work with groups.  Call IsDeleted() to determine if a group is deleted.
groupIndex: An group index to be deleted.
Returns: true if the operation was successful.

Rhino.DocObjects.Tables.GroupTable.GroupMembers(System.Int32)
Gets an array of all of the objects in a group.
groupIndex: The index of the group in this table.
Returns: An array with all the objects in the specified group.

Rhino.DocObjects.Tables.GroupTable.Document
Document that owns this group table.

Rhino.DocObjects.Tables.GroupTable.Count
Number of groups in the group table.