Rhino.Input.Custom.GetBaseClass.SetCommandPrompt(System.String)
Sets prompt message that appears in the command prompt window.
prompt: command prompt message.

Rhino.Input.Custom.GetBaseClass.SetCommandPromptDefault(System.String)
Sets message that describes what default value will be used if the user presses enter.
This description appears in angle brackets <> in the command prompt window. You do
not need to provide a default value description unless you explicity enable AcceptNothing.
defaultValue: description of default value.
ON_3dPoint default_center = new ON_3dPoint(2,3,4);
GetPoint gp = new GetPoint();
gp.SetCommandPrompt( "Center point" );
gp.SetCommandPromptDefault( "(2,3,4)" );
gp.AcceptNothing(true);
gp.GetPoint();
if ( gp.Result() == GetResult.Nothing )
point = default_center;
Remarks:
If you have a simple default point, number, or string, it is easier to use SetDefaultPoint,
SetDefaultNumber, or SetDefaultString. SetCommandPromptDefault and AcceptNothing can be used
for providing more advanced UI behavior.

Rhino.Input.Custom.GetBaseClass.SetDefaultPoint(Rhino.Geometry.Point3d)
Sets a point as default value that will be returned if the user presses the ENTER key during the get.
point: value for default point.
Remarks:
Calling SetDefaultPoint will automatically handle setting the command prompt default and reacting to
the user pressing ENTER.  If the user presses enter to accept the default point, GetResult.Point is
returned and RhinoGet.GotDefault() will return true. Calling SetDefaultPoint will clear any previous
calls to SetDefaultString or SetDefaultNumber.

Rhino.Input.Custom.GetBaseClass.SetDefaultNumber(System.Double)
Sets a number as default value that will be returned if the user presses ENTER key during the get.
defaultNumber: value for default number.
Remarks:
Calling SetDefaultNumber will automatically handle setting the command prompt default and
reacting to the user pressing ENTER. If the user presses ENTER to accept the default number,
GetResult.Number is returned and RhinoGet.GotDefault() will return true. Calling
SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultInteger(System.Int32)
Sets a number as default value that will be returned if the user presses ENTER key during the get.
defaultValue: value for default number.
Remarks:
Calling SetDefaultInteger will automatically handle setting the command prompt default and
reacting to the user pressing ENTER. If the user presses ENTER to accept the default integer,
GetResult.Number is returned and CRhinoGet.GotDefault() will return true. Calling
SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultString(System.String)
Sets a string as default value that will be returned
if the user presses ENTER key during the get.
defaultValue: value for default string.
Remarks:
Calling SetDefaultString will automatically handle setting the command prompt
default and reacting to the user pressing ENTER. If the user presses ENTER to
accept the default string, GetResult.String is returned and RhinoGet.GotDefault()
will return true. Calling SetDefaultString will clear any previous calls to
SetDefaultNumber or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetDefaultColor(System.Drawing.Color)
Sets a color as default value that will be returned if the user presses ENTER key during the get.
defaultColor: value for default color.
Remarks:
Calling SetDefaultColor will automatically handle setting the command prompt default and
reacting to the user pressing ENTER.  If the user presses ENTER to accept the default color,
GetResult.Color is returned and RhinoGet.GotDefault() will return true. Calling
SetDefaultColor will clear any previous calls to SetDefaultString or SetDefaultPoint.

Rhino.Input.Custom.GetBaseClass.SetWaitDuration(System.Int32)
Sets the wait duration (in milliseconds) of the getter. If the duration passes without
the user making a decision, the GetResult.Timeout code is returned.
milliseconds: Number of milliseconds to wait.

Rhino.Input.Custom.GetBaseClass.ClearDefault
Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.

Rhino.Input.Custom.GetBaseClass.GotDefault
Returns true if user pressed Enter to accept a default point, number,
or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
Returns: true if the result if the default point, number or string set. Otherwise, false.

Rhino.Input.Custom.GetBaseClass.AddOption(System.String)
Adds a command line option.
englishOption:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(System.String,System.String)
Adds a command line option.
englishOption:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
englishOptionValue: The option value in English, visualized after an equality sign.
Returns:
Option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(Rhino.UI.LocalizeStringPair)
Adds a command line option.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)
Adds a command line option.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
optionValue: The localized value visualized after an equality sign.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(System.String,Rhino.Input.Custom.OptionDouble@,System.String)
Adds a command line option to get numbers and automatically save the value.
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue: Current value.
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionDouble@,System.String)
Adds a command line option to get numbers and automatically saves the value.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue: The current number value.
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(System.String,Rhino.Input.Custom.OptionDouble@)
Adds a command line option to get numbers and automatically save the value.
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue: The current number value.
Returns:
Option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionDouble(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionDouble@)
Adds a command line option to get numbers and automatically save the value.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
numberValue: The current number value.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(System.String,Rhino.Input.Custom.OptionInteger@,System.String)
Adds a command line option to get integers and automatically save the value.
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue: The current integer value.
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionInteger@,System.String)
Adds a command line option to get integers and automatically save the value.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue: The current integer value.
prompt:
option prompt shown if the user selects this option.  If null or empty, then the
option name is used as the get number prompt.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(System.String,Rhino.Input.Custom.OptionInteger@)
Adds a command line option to get integers and automatically save the value.
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue: The current integer value.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionInteger(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionInteger@)
Adds a command line option to get integers and automatically save the value.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
intValue: The current integer value.
Returns:
option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionColor(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionColor@,System.String)
Add a command line option to get colors and automatically save the value.
optionName: option description.
colorValue: The current color value.
prompt: option prompt shown if the user selects this option
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionColor(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionColor@)
Add a command line option to get colors and automatically save the value.
optionName: option description
colorValue: The current color value.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionColor(System.String,Rhino.Input.Custom.OptionColor@,System.String)
Add a command line option to get colors and automatically save the value.
englishName: option description
colorValue: The current color value.
prompt: The command prompt will show this during picking.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionColor(System.String,Rhino.Input.Custom.OptionColor@)
Add a command line option to get colors and automatically save the value.
englishName: option description
colorValue: The current color value.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionToggle(System.String,Rhino.Input.Custom.OptionToggle@)
Adds a command line option to toggle a setting.
englishName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
toggleValue: The current toggle value.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionToggle(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionToggle@)
Adds a command line option to toggle a setting.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
toggleValue: The current toggle value.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionList(System.String,System.Collections.Generic.IEnumerable{System.String},System.Int32)
Adds a command line list option.
englishOptionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
listValues: The string values.
listCurrentIndex: Zero based index of current option.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOptionList(Rhino.UI.LocalizeStringPair,System.Collections.Generic.IEnumerable{Rhino.UI.LocalizeStringPair},System.Int32)
Adds a command line list option.
optionName:
Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
listValues: The string values.
listCurrentIndex: Zero based index of current option.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.ClearCommandOptions
Clear all command options.

Rhino.Input.Custom.GetBaseClass.EnableTransparentCommands(System.Boolean)
Control the availability of transparent commands during the get.
enable:
If true, then transparent commands can be run during the get.
If false, then transparent commands cannot be run during the get.
Remarks:
Some Rhino commands are "transparent" and can be run inside of other
commands.  Examples of transparent commands include the view
manipulation commands like ZoomExtents, Top, etc., and the selection
commands like SelAll, SelPoint, etc.
By default transparent commands can be run during any get. If you
want to disable this feature, then call EnableTransparentCommands(false)
before calling GetString, GetPoint, GetObject, etc.

Rhino.Input.Custom.GetBaseClass.AcceptNothing(System.Boolean)
If you want to allow the user to be able to press enter in order to
skip selecting a something in GetPoint.Get(), GetObject::GetObjects(),
etc., then call AcceptNothing( true ) beforehand.
enable: true if user is able to press enter in order to skip selecting.

Rhino.Input.Custom.GetBaseClass.AcceptUndo(System.Boolean)
If you want to allow the user to have an 'undo' option in GetPoint.Get(),
GetObject.GetObjects(), etc., then call AcceptUndo(true) beforehand.
enable: true if user is able to choose the 'Undo' option.

Rhino.Input.Custom.GetBaseClass.AcceptNumber(System.Boolean,System.Boolean)
If you want to allow the user to be able to type in a number during GetPoint.Get(),
GetObject::GetObjects(), etc., then call AcceptNumber() beforehand.
If the user chooses to type in a number, then the result code GetResult.Number is
returned and you can use RhinoGet.Number() to get the value of the number. If you
are using GetPoint and you want "0" to return (0,0,0) instead of the number zero,
then set acceptZero = false.
enable: true if user is able to type a number.
acceptZero:
If you are using GetPoint and you want "0" to return (0,0,0) instead of the number zero,
then set acceptZero = false.

Rhino.Input.Custom.GetBaseClass.AcceptPoint(System.Boolean)
If you want to allow the user to be able to type in a point then call AcceptPoint(true)
before calling GetPoint()/GetObject(). If the user chooses to type in a number, then
the result code GetResult.Point is returned and you can use RhinoGet.Point()
to get the value of the point.
enable: true if user is able to type in a point.

Rhino.Input.Custom.GetBaseClass.AcceptColor(System.Boolean)
If you want to allow the user to be able to type in a color r,g,b or name
during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptColor(true)
before calling GetPoint()/GetObject(). If the user chooses to type in a color,
then the result code GetResult.Color is returned and you can use RhinoGet.Color()
to get the value of the color.  If the get accepts points, then the user will not
be able to type in r,g,b colors but will be able to type color names.
enable: true if user is able to type a color.

Rhino.Input.Custom.GetBaseClass.AcceptString(System.Boolean)
If you want to allow the user to be able to type in a string during GetPoint.Get(),
GetObject::GetObjects(), etc., then call AcceptString(true) before calling
GetPoint()/GetObject(). If the user chooses to type in a string, then the result code
GetResult.String is returned and you can use RhinoGet.String() to get the value of the string.
enable: true if user is able to type a string.

Rhino.Input.Custom.GetBaseClass.Result
Returns result of the Get*() call.
Returns: The result of the last Get*() call.

Rhino.Input.Custom.GetBaseClass.CommandResult
Helper method for getting command result value from getter results.
Returns: The converted command result.

Rhino.Input.Custom.GetBaseClass.Number
Gets a number if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.Number.
Returns: The number chosen by the user.

Rhino.Input.Custom.GetBaseClass.StringResult
Gets a string if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.String.
Returns: The string chosen by the user.

Rhino.Input.Custom.GetBaseClass.Point
Gets a point if Get*() returns GetResult.Point.
Returns: The point chosen by the user.

Rhino.Input.Custom.GetBaseClass.Vector
Gets a direction if Get*() returns GetResult.Point (Set by some digitizers, but in general it's (0,0,0).
Returns: The vector chosen by the user.

Rhino.Input.Custom.GetBaseClass.Color
Gets a color if Get*() returns GetResult.Color.
Returns: The color chosen by the user.

Rhino.Input.Custom.GetBaseClass.View
Gets a view the user clicked in during GetPoint.Get(), GetObject.GetObjects(), etc.
Returns: The view chosen by the user.

Rhino.Input.Custom.GetBaseClass.PickRectangle
If the get was a GetObjects() and the mouse was used to select the objects,
then the returned rect has left < right and top < bottom. This rect
is the Windows GDI screen coordinates of the picking rectangle.
RhinoViewport.GetPickXform( pick_rect, pick_xform )
will calculate the picking transformation that was used.
In all other cases, left=right=top=bottom=0;
Returns: The picking rectangle; or 0 in the specified cases.

Rhino.Input.Custom.GetBaseClass.Point2d
Returns location in view of point in selected in GetPoint::Get() or GetPoint::Get2dPoint().
(0,0) = upper left corner of window.
Returns: The location.

Rhino.Input.Custom.GetBaseClass.Rectangle2d
Returns the location in the view of the 2d rectangle selected in GetPoint::Get2dRectangle().
rect.left < rect.right and rect.top < rect.bottom
(0,0) = upper left corner of window.
Returns: The rectangle.

Rhino.Input.Custom.GetBaseClass.Line2d
Returns two points defining the location in the view window of the 2d line selected
in GetPoint::Get2dLine().
(0,0) = upper left corner of window.
Returns: An array with two 2D points.