Rhino.Geometry.Point3f.#ctor(System.Single,System.Single,System.Single)
Initializes a new two-dimensional vector from two components.
x: X component of vector.
y: Y component of vector.
z: Z component of vector.

Rhino.Geometry.Point3f.Equals(Rhino.Geometry.Point3f)
Determines whether the specified Point3f has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.

Rhino.Geometry.Point3f.CompareTo(Rhino.Geometry.Point3f)
Compares this Rhino.Geometry.Point3f with another Rhino.Geometry.Point3f.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Point3d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.

Rhino.Geometry.Point3f.DistanceTo(Rhino.Geometry.Point3f)
Computes the distance between two points.
other: Other point for distance measurement.
Returns: The length of the line between this and the other point; or 0 if any of the points is not valid.

Rhino.Geometry.Point3f.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.

Rhino.Geometry.Point3f.op_Equality(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether two points have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.

Rhino.Geometry.Point3f.op_Inequality(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether two points have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.

Rhino.Geometry.Point3f.op_LessThan(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.

Rhino.Geometry.Point3f.op_LessThanOrEqual(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether the first specified point comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.

Rhino.Geometry.Point3f.op_GreaterThan(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.

Rhino.Geometry.Point3f.op_GreaterThanOrEqual(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Determines whether the first specified point comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.

Rhino.Geometry.Point3f.op_Subtraction(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Subtracts a point from another point.
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.

Rhino.Geometry.Point3f.Subtract(Rhino.Geometry.Point3f,Rhino.Geometry.Point3f)
Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.

Rhino.Geometry.Point3f.Origin
Gets the value of a point at location 0,0,0.

Rhino.Geometry.Point3f.Unset
Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.

Rhino.Geometry.Point3f.X
Gets or sets the X (first) component of the vector.

Rhino.Geometry.Point3f.Y
Gets or sets the Y (second) component of the vector.

Rhino.Geometry.Point3f.Z
Gets or sets the Z (third) component of the vector.

Rhino.Geometry.Point3f.IsValid
Each coordinate of the point must pass the Rhino.RhinoMath.IsValidSingle(System.Single) test.