Rhino.DocObjects.Custom.CustomObjectGrips.Dragging
Determines if grips are currently being dragged.
Returns: true if grips are dragged.

Rhino.DocObjects.Custom.CustomObjectGrips.NeighborGrip(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Get neighbors.
gripIndex: index of grip where the search begins.
dr:
1 = next grip in the first parameter direction.
-1 = prev grip in the first parameter direction.
ds:
1 = next grip in the second parameter direction.
-1 = prev grip in the second parameter direction.
dt:
1 = next grip in the third parameter direction.
-1 = prev grip in the third parameter direction.
wrap: If true and object is "closed", the search will wrap.
Returns: Pointer to the desired neighbor or NULL if there is no neighbor.

Rhino.DocObjects.Custom.CustomObjectGrips.NurbsSurfaceGrip(System.Int32,System.Int32)
If the grips are control points of a NURBS surface, then this gets the
index of the grip that controls the (i,j)-th cv.
i: The index in the first dimension.
j: The index in the second dimension.
Returns: A grip controling a NURBS surface CV or null.

Rhino.DocObjects.Custom.CustomObjectGrips.NewLocation
true if some of the grips have been moved. GripObject.NewLocation() sets
NewLocation=true.  Derived classes can set NewLocation to false after
updating temporary display information.

Rhino.DocObjects.Custom.CustomObjectGrips.GripsMoved
If GripsMoved is true if some of the grips have ever been moved
GripObject.NewLocation() sets GripsMoved=true.

Rhino.DocObjects.Custom.CustomObjectGrips.OwnerObject
Owner of the grips.