Rhino.DocObjects.DisplayMode
Defines enumerated values for display modes, such as wireframe or shaded.

Rhino.DocObjects.DisplayMode.Shaded
The shaded display mode.
Objects are generally displayed with their corresponding isocurves and edges,
and are filled with their diplay colors.