Rhino.Geometry.VolumeMassProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Mesh)
Compute the VolumeMassProperties for a single Mesh.
mesh: Mesh to measure.
Returns: The VolumeMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
Returns: The VolumeMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Surface)
Compute the VolumeMassProperties for a single Surface.
surface: Surface to measure.
Returns: The VolumeMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.

Rhino.Geometry.VolumeMassProperties.Volume
Gets the volume solution.

Rhino.Geometry.VolumeMassProperties.VolumeError
Gets the uncertainty in the volume calculation.

Rhino.Geometry.VolumeMassProperties.Centroid
Gets the volume centroid in the world coordinate system.

Rhino.Geometry.VolumeMassProperties.CentroidError
Gets the uncertainty in the Centroid calculation.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the volume
Y is integral of "y dm" over the volume
Z is integral of "z dm" over the volume.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "xx dm" over the area
Y is integral of "yy dm" over the area
Z is integral of "zz dm" over the area.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the area
Y is integral of "yz dm" over the area
Z is integral of "zx dm" over the area.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm.
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation.

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesRadiiOfGyration
Radii of gyration with respect to world coordinate system.
X = sqrt(integral of (y^2 + z^2) dm/M)
Y = sqrt(integral of (z^2 + x^2) dm/M)
Z = sqrt(integral of (z^2 + y^2) dm/M)
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesSecondMoments
Second moments with respect to centroid coordinate system.
X = integral of (x-x0)^2 dm
Y = integral of (y-y0)^2 dm
Z = integral of (z-z0)^2 dm
where (x0,y0,z0) = centroid.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesMomentsOfInertia
Moments of inertia with respect to centroid coordinate system.
X = integral of ((y-y0)^2 + (z-z0)^2) dm
Y = integral of ((z-z0)^2 + (x-x0)^2) dm
Z = integral of ((z-z0)^2 + (y-y0)^2) dm
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "moments of intertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesRadiiOfGyration
Radii of gyration with respect to centroid coordinate system.
X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M)
Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M)
Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M)
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.