Rhino.FileIO.File3dm.Read(System.String)
Reads a 3dm file from a specified location.
path: The file to read.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.

Rhino.FileIO.File3dm.ReadWithLog(System.String,System.String@)
Read a 3dm file from a specified location and log any archive
reading errors.
path: The file to read.
errorLog: Any archive reading errors are logged here.
Returns: New File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.

Rhino.FileIO.File3dm.ReadNotes(System.String)
Reads only the notes from an existing 3dm file.
path: The file from which to read the notes.
Returns: The 3dm file notes.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.

Rhino.FileIO.File3dm.ReadApplicationData(System.String,System.String@,System.String@,System.String@)
Reads only the application information from an existing 3dm file.
path: A location on disk or network.
applicationName: The application name. This out parameter is assigned during this call.
applicationUrl: The application URL. This out parameter is assigned during this call.
applicationDetails: The application details. This out parameter is assigned during this call.

Rhino.FileIO.File3dm.ReadPreviewImage(System.String)
Attempts to read the preview image out of a 3dm file.
path: The location of the file.
Returns: A bitmap, or null on failure.
Throws System.IO.FileNotFoundException: If the provided path is null, does not exist or cannot be accessed.

Rhino.FileIO.File3dm.Write(System.String,System.Int32)
Writes contents of this model to an openNURBS archive. I STRONGLY
suggested that you call Polish() before calling Write so that your
file has all the "fluff" that makes it complete.  If the model is
not valid, then Write will refuse to write it.
path: The file name to use for writing.
version:
Version of the openNURBS archive to write.  Must be 2, 3, 4, or 5.
Rhino 2.x can read version 2 files.
Rhino 3.x can read version 2 and 3 files.
Rhino 4.x can read version 2, 3 and 4 files.
Rhino 5.x can read version 2, 3, 4, and 5 files.
Use version 5 when possible.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.WriteWithLog(System.String,System.Int32,System.String@)
Writes contents of this model to an openNURBS archive. I STRONGLY
suggested that you call Polish() before calling Write so that your
file has all the "fluff" that makes it complete.  If the model is
not valid, then Write will refuse to write it.
path:
Version of the openNURBS archive to write.  Must be 2, 3, 4, or 5.
Rhino 2.x can read version 2 files.
Rhino 3.x can read version 2 and 3 files.
Rhino 4.x can read version 2, 3 and 4 files.
Rhino 5.x can read version 2, 3, 4, and 5 files.
Use version 5 when possible.
version: A version number.
errorLog: . This argument will be filled by out reference.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.IsValid(System.String@)
Checks a model to make sure it is valid.
errors:
if errors are found, a description of the problem is put in this variable.
Returns: true if the model is valid.

Rhino.FileIO.File3dm.Polish
Quickly fills in the little details, like making sure there is at least
one layer and table indices make sense.  For a full blown check and repair,
call Audit(true).

Rhino.FileIO.File3dm.Audit(System.Boolean,System.Int32@,System.String@,System.Int32[]@)
Check a model to make sure it is valid and, if possible
and requested, attempt to repair.
attemptRepair:
if true and a problem is found, the problem is repaired.
repairCount: number of successful repairs.
errors:
if errors are found, a description of the problem is put in this.
warnings:
If problems were found, warning ids are appended to this list.
1 (MaterialTable flaws), 2 (LayerTable is not perfect),
3 (some ObjectTable.Attributes.Id was nil or not unique),
4 (ObjectTable.IsValid() is false),
5 (some IDefTable entry has an invalid or duplicate name),
6 (some IDefTable.ObjectId is not valid),
7 (some ObjectTable.Geometry is null),
8 (some ObjectTable.Geometry.IsValid is false),
9 (some ObjectTable.Attributes is not valid),
10 (LinetypeTable is not perfect), 11 (LinetypeTable is not perfect),
12 (some IDefTable.Id was Empty or not unique),
13 (some TextureMappingTable.MappingId was Empty or not unique),
14 (some MaterialTable.Id was Empty or not unique),
15 (some LightTable.LightId was Empty or not unique)
Returns:
<0 (model has serious errors),
0 (model is ok),
>0 (number of problems that were found)

Rhino.FileIO.File3dm.Dump
Prepares a text dump of the entire model.
Returns: The text dump.

Rhino.FileIO.File3dm.DumpSummary
Prepares a text dump of model properties and settings.
Returns: The text dump.

Rhino.FileIO.File3dm.#ctor
Initializes a new instance of a 3dm file.

Rhino.FileIO.File3dm.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.FileIO.File3dm.StartSectionComments
Gets or sets the start section comments, which are the comments with which the 3dm file begins.

Rhino.FileIO.File3dm.Notes
Gets or sets the model notes.

Rhino.FileIO.File3dm.ApplicationName
Gets or sets the name of the application that wrote this file.

Rhino.FileIO.File3dm.ApplicationUrl
Gets or sets a URL for the application that wrote this file.

Rhino.FileIO.File3dm.ApplicationDetails
Gets or sets details for the application that wrote this file.

Rhino.FileIO.File3dm.CreatedBy
Gets a string that names the user who created the file.

Rhino.FileIO.File3dm.LastEditedBy
Gets a string that names the user who last edited the file.

Rhino.FileIO.File3dm.Revision
Gets or sets the revision number.

Rhino.FileIO.File3dm.Settings
Settings include tolerance, and unit system, and defaults used
for creating views and objects.

Rhino.FileIO.File3dm.Objects
Gets access to the Rhino.FileIO.File3dmObjectTable class associated with this file,
which contains all objects.

Rhino.FileIO.File3dm.Materials
Materials in this file.

Rhino.FileIO.File3dm.Linetypes
Linetypes in this file.

Rhino.FileIO.File3dm.Layers
Layers in this file.

Rhino.FileIO.File3dm.DimStyles
Dimension Styles in this file

Rhino.FileIO.File3dm.HatchPatterns
Hatch patterns in this file

Rhino.FileIO.File3dm.Views
Views that represent the RhinoViews which are displayed when Rhino loads this file

Rhino.FileIO.File3dm.NamedViews
Named view list

Rhino.FileIO.File3dm.PlugInData
Custom plug-in data in this file.  This data is not attached to any geometry or attributes