Rhino.Geometry.LoftType
Specifies enumerated constants for all supported loft types.

Rhino.Geometry.LoftType.Developable
Constructs a separate developable surface or polysurface from each pair of curves.