Rhino.DocObjects.ReplayHistoryData.GetRhinoObjRef(System.Int32)
In ReplayHistory, use GetRhinoObjRef to convert the information
in a history record into the ObjRef that has up to date
RhinoObject pointers
id: HistoryRecord value id
Returns: ObjRef on success, null if not successful

Rhino.DocObjects.ReplayHistoryData.Document
The document this record belongs to

Rhino.DocObjects.ReplayHistoryData.HistoryVersion
ReplayHistory overrides check the version number to insure the information
saved in the history record is compatible with the current implementation
of ReplayHistory

Rhino.DocObjects.ReplayHistoryData.RecordId
Each history record has a unique id that Rhino assigns when it adds the
history record to the history record table