Rhino.Input.Custom.GetOption.Get
Call to get an option. A return value of "option" means the user selected
a valid option. Use Option() the determine which option.
Returns: If the user chose an option, then Rhino.Input.GetResult.Option; another enumeration value otherwise.