Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Find(System.String)
Finds a named construction plane.
name:
Name of construction plane to search for.
Returns:
>=0 index of the construction plane with the given name.
-1 no construction plane found with the given name.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Add(System.String,Rhino.Geometry.Plane)
Adds named construction plane to document.
name:
If name is empty, a unique name is automatically created.
If there is already a named onstruction plane with the same name, that
construction plane is replaced.
plane: The plane value.
Returns:
0 based index of named construction plane.
-1 on failure.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Delete(System.Int32)
Remove named construction plane from the document.
index: zero based array index.
Returns: true if successful.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Delete(System.String)
Remove named construction plane from the document.
name: name of the construction plane.
Returns: true if successful.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Document
Gets the document that owns this table.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Count
Number of construction planes in the table.