Rhino.Geometry.Intersect.Intersection.LineLine(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double@,System.Double@,System.Double,System.Boolean)
Intersects two lines.
lineA: First line for intersection.
lineB: Second line for intersection.
a:
Parameter on lineA that is closest to LineB.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
b:
Parameter on lineB that is closest to LineA.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
tolerance:
If tolerance > 0.0, then an intersection is reported only if the distance between the points is <= tolerance.
If tolerance <= 0.0, then the closest point between the lines is reported.
finiteSegments:
If true, the input lines are treated as finite segments.
If false, the input lines are treated as infinite lines.
Returns:
true if a closest point can be calculated and the result passes the tolerance parameter test; otherwise false.
Remarks:
If the lines are exactly parallel, meaning the system of equations used to find a and b
has no numerical solution, then false is returned. If the lines are nearly parallel, which
is often numerically true even if you think the lines look exactly parallel, then the
closest points are found and true is returned. So, if you care about weeding out "parallel"
lines, then you need to do something like the following:
bool rc = Intersect.LineLine(lineA, lineB, out a, out b, tolerance, segments);
if (rc)
{
double angle_tol = RhinoMath.ToRadians(1.0); // or whatever
double parallel_tol = Math.Cos(angle_tol);
if ( Math.Abs(lineA.UnitTangent * lineB.UnitTangent) >= parallel_tol )
{
... do whatever you think is appropriate
}
}
Dim rc As Boolean = Intersect.LineLine(lineA, lineB, a, b, tolerance, segments)
If (rc) Then
Dim angle_tol As Double = RhinoMath.ToRadians(1.0) 'or whatever
Dim parallel_tolerance As Double = Math.Cos(angle_tol)
If (Math.Abs(lineA.UnitTangent * lineB.UnitTangent) >= parallel_tolerance) Then
... do whatever you think is appropriate
End If
End If

Rhino.Geometry.Intersect.Intersection.LineLine(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double@,System.Double@)
Finds the closest point between two infinite lines.
lineA: First line.
lineB: Second line.
a:
Parameter on lineA that is closest to lineB.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
b:
Parameter on lineB that is closest to lineA.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
Returns:
true if points are found and false if the lines are numerically parallel.
Numerically parallel means the 2x2 matrix:
+AoA  -AoB
-AoB  +BoB
is numerically singular, where A = (lineA.To - lineA.From) and B = (lineB.To-lineB.From)

Rhino.Geometry.Intersect.Intersection.LinePlane(Rhino.Geometry.Line,Rhino.Geometry.Plane,System.Double@)
Intersects a line and a plane. This function only returns true if the
intersection result is a single point (i.e. if the line is coincident with
the plane then no intersection is assumed).
line: Line for intersection.
plane: Plane to intersect.
lineParameter: Parameter on line where intersection occurs.
If the parameter is not within the {0, 1} Interval then the finite segment
does not intersect the plane.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.PlanePlane(Rhino.Geometry.Plane,Rhino.Geometry.Plane,Rhino.Geometry.Line@)
Intersects two planes and return the intersection line. If the planes are
parallel or coincident, no intersection is assumed.
planeA: First plane for intersection.
planeB: Second plane for intersection.
intersectionLine: If this function returns true,
the intersectionLine parameter will return the line where the planes intersect.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.PlanePlanePlane(Rhino.Geometry.Plane,Rhino.Geometry.Plane,Rhino.Geometry.Plane,Rhino.Geometry.Point3d@)
Intersects three planes to find the single point they all share.
planeA: First plane for intersection.
planeB: Second plane for intersection.
planeC: Third plane for intersection.
intersectionPoint: Point where all three planes converge.
Returns: true on success, false on failure. If at least two out of the three planes
are parallel or coincident, failure is assumed.

Rhino.Geometry.Intersect.Intersection.PlaneCircle(Rhino.Geometry.Plane,Rhino.Geometry.Circle,System.Double@,System.Double@)
Intersects a plane with a circle using exact calculations.
plane: Plane to intersect.
circle: Circe to intersect.
firstCircleParameter: First intersection parameter on circle if successful or RhinoMath.UnsetValue if not.
secondCircleParameter: Second intersection parameter on circle if successful or RhinoMath.UnsetValue if not.
Returns: The type of intersection that occured.

Rhino.Geometry.Intersect.Intersection.PlaneSphere(Rhino.Geometry.Plane,Rhino.Geometry.Sphere,Rhino.Geometry.Circle@)
Intersects a plane with a sphere using exact calculations.
plane: Plane to intersect.
sphere: Sphere to intersect.
intersectionCircle: Intersection result.
Returns: If Rhino.Geometry.Intersect.PlaneSphereIntersection.None is returned, the intersectionCircle has a radius of zero and the center point
is the point on the plane closest to the sphere.

Rhino.Geometry.Intersect.Intersection.LineCircle(Rhino.Geometry.Line,Rhino.Geometry.Circle,System.Double@,Rhino.Geometry.Point3d@,System.Double@,Rhino.Geometry.Point3d@)
Intersects a line with a circle using exact calculations.
line: Line for intersection.
circle: Circle for intersection.
t1: Parameter on line for first intersection.
point1: Point on circle closest to first intersection.
t2: Parameter on line for second intersection.
point2: Point on circle closest to second intersection.
Returns:
If Rhino.Geometry.Intersect.LineCircleIntersection.Single is returned, only t1 and point1 will have valid values.
If Rhino.Geometry.Intersect.LineCircleIntersection.Multiple is returned, t2 and point2 will also be filled out.

Rhino.Geometry.Intersect.Intersection.LineSphere(Rhino.Geometry.Line,Rhino.Geometry.Sphere,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Intersects a line with a sphere using exact calculations.
line: Line for intersection.
sphere: Sphere for intersection.
intersectionPoint1: First intersection point.
intersectionPoint2: Second intersection point.
Returns: If Rhino.Geometry.Intersect.LineSphereIntersection.None is returned, the first point is the point on the line closest to the sphere and
the second point is the point on the sphere closest to the line.
If Rhino.Geometry.Intersect.LineSphereIntersection.Single is returned, the first point is the point on the line and the second point is the
same point on the sphere.

Rhino.Geometry.Intersect.Intersection.LineCylinder(Rhino.Geometry.Line,Rhino.Geometry.Cylinder,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Intersects a line with a cylinder using exact calculations.
line: Line for intersection.
cylinder: Cylinder for intersection.
intersectionPoint1: First intersection point.
intersectionPoint2: Second intersection point.
Returns: If None is returned, the first point is the point on the line closest
to the cylinder and the second point is the point on the cylinder closest to
the line.
If Rhino.Geometry.Intersect.LineCylinderIntersection.Single is returned, the first point
is the point on the line and the second point is the  same point on the
cylinder.

Rhino.Geometry.Intersect.Intersection.SphereSphere(Rhino.Geometry.Sphere,Rhino.Geometry.Sphere,Rhino.Geometry.Circle@)
Intersects two spheres using exact calculations.
sphereA: First sphere to intersect.
sphereB: Second sphere to intersect.
intersectionCircle:
If intersection is a point, then that point will be the center, radius 0.
Returns:
The intersection type.

Rhino.Geometry.Intersect.Intersection.LineBox(Rhino.Geometry.Line,Rhino.Geometry.BoundingBox,System.Double,Rhino.Geometry.Interval@)
Intersects an infinite line and an axis aligned bounding box.
box: BoundingBox to intersect.
line: Line for intersection.
tolerance:
If tolerance > 0.0, then the intersection is performed against a box
that has each side moved out by tolerance.
lineParameters:
The chord from line.PointAt(lineParameters.T0) to line.PointAt(lineParameters.T1) is the intersection.
Returns: true if the line intersects the box, false if no intersection occurs.

Rhino.Geometry.Intersect.Intersection.LineBox(Rhino.Geometry.Line,Rhino.Geometry.Box,System.Double,Rhino.Geometry.Interval@)
Intersects an infinite line with a box volume.
box: Box to intersect.
line: Line for intersection.
tolerance:
If tolerance > 0.0, then the intersection is performed against a box
that has each side moved out by tolerance.
lineParameters:
The chord from line.PointAt(lineParameters.T0) to line.PointAt(lineParameters.T1) is the intersection.
Returns: true if the line intersects the box, false if no intersection occurs.

Rhino.Geometry.Intersect.Intersection.CurvePlane(Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Intersects a curve with an (infinite) plane.
curve: Curve to intersect.
plane: Plane to intersect with.
tolerance: Tolerance to use during intersection.
Returns: A list of intersection events or null if no intersections were recorded.

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)
Intersects a mesh with an (infinite) plane.
mesh: Mesh to intersect.
plane: Plane to intersect with.
Returns: An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane})
Intersects a mesh with a collection of (infinite) planes.
mesh: Mesh to intersect.
planes: Planes to intersect with.
Returns: An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.
Throws System.ArgumentNullException: If planes is null.

Rhino.Geometry.Intersect.Intersection.BrepPlane(Rhino.Geometry.Brep,Rhino.Geometry.Plane,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a Brep with an (infinite) plane.
brep: Brep to intersect.
plane: Plane to intersect with.
tolerance: Tolerance to use for intersections.
intersectionCurves: The intersection curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.CurveSelf(Rhino.Geometry.Curve,System.Double)
Finds the places where a curve intersects itself.
curve: Curve for self-intersections.
tolerance: Intersection tolerance. If the curve approaches itself to within tolerance,
an intersection is assumed.
Returns: A collection of intersection events.

Rhino.Geometry.Intersect.Intersection.CurveCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)
Finds the intersections between two curves.
curveA: First curve for intersection.
curveB: Second curve for intersection.
tolerance: Intersection tolerance. If the curves approach each other to within tolerance,
an intersection is assumed.
overlapTolerance: The tolerance with which the curves are tested.
Returns: A collection of intersection events.

Rhino.Geometry.Intersect.Intersection.CurveSurface(Rhino.Geometry.Curve,Rhino.Geometry.Surface,System.Double,System.Double)
Intersects a curve and a surface.
curve: Curve for intersection.
surface: Surface for intersection.
tolerance: Intersection tolerance. If the curve approaches the surface to within tolerance,
an intersection is assumed.
overlapTolerance: The tolerance with which the curves are tested.
Returns: A collection of intersection events.

Rhino.Geometry.Intersect.Intersection.CurveSurface(Rhino.Geometry.Curve,Rhino.Geometry.Interval,Rhino.Geometry.Surface,System.Double,System.Double)
Intersects a (sub)curve and a surface.
curve: Curve for intersection.
curveDomain: Domain of surbcurve to take into consideration for Intersections.
surface: Surface for intersection.
tolerance: Intersection tolerance. If the curve approaches the surface to within tolerance,
an intersection is assumed.
overlapTolerance: The tolerance with which the curves are tested.
Returns: A collection of intersection events.

Rhino.Geometry.Intersect.Intersection.CurveBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a curve with a Brep. This function returns the 3D points of intersection
and 3D overlap curves. If an error occurs while processing overlap curves, this function
will return false, but it will still provide partial results.
curve: Curve for intersection.
brep: Brep for intersection.
tolerance: Fitting and near miss tolerance.
overlapCurves: The overlap curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.CurveBrepFace(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a curve with a Brep face.
curve: A curve.
face: A brep face.
tolerance: Fitting and near miss tolerance.
overlapCurves: A overlap curves array argument. This out reference is assigned during the call.
intersectionPoints: A points array argument. This out reference is assigned during the call.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.SurfaceSurface(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects two Surfaces.
surfaceA: First Surface for intersection.
surfaceB: Second Surface for intersection.
tolerance: Intersection tolerance.
intersectionCurves: The intersection curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success, false on failure.

Rhino.Geometry.Intersect.Intersection.BrepBrep(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects two Breps.
brepA: First Brep for intersection.
brepB: Second Brep for intersection.
tolerance: Intersection tolerance.
intersectionCurves: The intersection curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success; false on failure.

Rhino.Geometry.Intersect.Intersection.BrepSurface(Rhino.Geometry.Brep,Rhino.Geometry.Surface,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a Brep and a Surface.
brep: A brep to be intersected.
surface: A surface to be intersected.
tolerance: A tolerance value.
intersectionCurves: The intersection curves array argument. This out reference is assigned during the call.
intersectionPoints: The intersection points array argument. This out reference is assigned during the call.
Returns: true on success; false on failure.

Rhino.Geometry.Intersect.Intersection.MeshMeshFast(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh)
Quickly intersects two meshes. Overlaps and near misses are ignored.
meshA: First mesh for intersection.
meshB: Second mesh for intersection.
Returns: An array of intersection line segments.

Rhino.Geometry.Intersect.Intersection.MeshMeshAccurate(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh,System.Double)
Intersects two meshes. Overlaps and near misses are handled.
meshA: First mesh for intersection.
meshB: Second mesh for intersection.
tolerance: Intersection tolerance.
Returns: An array of intersection polylines.

Rhino.Geometry.Intersect.Intersection.MeshRay(Rhino.Geometry.Mesh,Rhino.Geometry.Ray3d)
Finds the first intersection of a ray with a mesh.
mesh: A mesh to intersect.
ray: A ray to be casted.
Returns:
>= 0.0 parameter along ray if successful.
< 0.0 if no intersection found.

Rhino.Geometry.Intersect.Intersection.MeshRay(Rhino.Geometry.Mesh,Rhino.Geometry.Ray3d,System.Int32[]@)
Finds the first intersection of a ray with a mesh.
mesh: A mesh to intersect.
ray: A ray to be casted.
meshFaceIndices: faces on mesh that ray intersects.
Returns:
>= 0.0 parameter along ray if successful.
< 0.0 if no intersection found.
Remarks:
The ray may intersect more than one face in cases where the ray hits
the edge between two faces or the vertex corner shared by multiple faces.

Rhino.Geometry.Intersect.Intersection.MeshPolyline(Rhino.Geometry.Mesh,Rhino.Geometry.PolylineCurve,System.Int32[]@)
Finds the intersection of a mesh and a polyline.
mesh: A mesh to intersect.
curve: A polyline curves to intersect.
faceIds: The indices of the intersecting faces. This out reference is assigned during the call.
Returns: An array of points: one for each face that was passed by the faceIds out reference.

Rhino.Geometry.Intersect.Intersection.MeshLine(Rhino.Geometry.Mesh,Rhino.Geometry.Line,System.Int32[]@)
Finds the intersection of a mesh and a line
mesh: A mesh to intersect
line: The line to intersect with the mesh
faceIds: The indices of the intersecting faces. This out reference is assigned during the call.
Returns: An array of points: one for each face that was passed by the faceIds out reference.

Rhino.Geometry.Intersect.Intersection.RayShoot(Rhino.Geometry.Ray3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Int32)
Computes point intersections that occur when shooting a ray to a collection of surfaces.
ray: A ray used in intersection.
geometry: Only Surface and Brep objects are currently supported. Trims are ignored on Breps.
maxReflections: The maximum number of reflections. This value should be any value between 1 and 1000, inclusive.
Returns: An array of points: one for each face that was passed by the faceIds out reference.
Throws System.ArgumentNullException: geometry is null.
Throws System.ArgumentOutOfRangeException: maxReflections is strictly outside the [1-1000] range.

Rhino.Geometry.Intersect.Intersection.ProjectPointsToMeshes(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Vector3d,System.Double)
Projects points onto meshes.
meshes: the meshes to project on to.
points: the points to project.
direction: the direction to project.
tolerance:
Projection tolerances used for culling close points and for line-mesh intersection.
Returns:
Array of projected points, or null in case of any error or invalid input.

Rhino.Geometry.Intersect.Intersection.ProjectPointsToBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Vector3d,System.Double)
Projects points onto breps.
breps: The breps projection targets.
points: The points to project.
direction: The direction to project.
tolerance: The tolerance used for intersections.
Returns:
Array of projected points, or null in case of any error or invalid input.