Rhino.UI.Dialogs.KillSplash
Destroy the splash screen if it is being displayed.

Rhino.UI.Dialogs.PushPickButton(System.Windows.Forms.Form,System.EventHandler{System.EventArgs})
Hides a form, calls a provided function, and then shows the form. This works for
modal forms. Useful for selecting objects or getting points while a modal dialog
is running.
form: A form window.
pickFunction: A picking delegate.

Rhino.UI.Dialogs.ShowSemiModal(System.Windows.Forms.Form)
Show a windows form that is modal in the sense that this function does not return until
the form is closed, but also allows for interaction with other elements of the Rhino
user interface.
form:
The form must have buttons that are assigned to the "AcceptButton" and "CancelButton".
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowTextDialog(System.String,System.String)
Display a text dialog similar to the dialog used for the "What" command.
message: Text to display as the message content.
title: Test to display as the form title.
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String)
Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)
Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
buttons: One of the System.Windows.Forms.MessageBoxButtons values that specifies which buttons to display in the message box.
icon: One of the System.Windows.Forms.MessageBoxIcon values that specifies which icon to display in the message box.
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon,System.Windows.Forms.MessageBoxDefaultButton)
Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
buttons: One of the System.Windows.Forms.MessageBoxButtons values that specifies which buttons to display in the message box.
icon: One of the System.Windows.Forms.MessageBoxIcon values that specifies which icon to display in the message box.
defaultButton: One of the System.Windows.Forms.MessageBoxDefaultButton values that specifies the default button for the message box.
Returns: One of the System.Windows.Forms.DialogResult values.

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
Returns: true if the color changed. false if the color has not changed or the user pressed cancel.

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@,System.Boolean,System.String)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors:
Display button face and text options at top of named color list.
dialogTitle: The title of the dialog.
Returns: true if the color changed. false if the color has not changed or the user pressed cancel.

Rhino.UI.Dialogs.ShowSelectLayerDialog(System.Int32@,System.String,System.Boolean,System.Boolean,System.Boolean@)
Displays Rhino's single layer selection dialog.
layerIndex:
Initial layer for the dialog, and will receive selected
layer if function returns DialogResult.OK.
dialogTitle: The dialog title.
showNewLayerButton: true if the new layer button will be visible.
showSetCurrentButton: true if the set current button will be visible.
initialSetCurrentState: true if the current state will be initially set.
Returns: A dialog result based on user choice.

Rhino.UI.Dialogs.ShowComboListBox(System.String,System.String,System.Collections.IList)
Displays Rhino's combo list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
Returns:
selected item.
null if the user canceled.

Rhino.UI.Dialogs.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})
Displays Rhino's check list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
checkState: A list of true/false boolean values.
Returns: An array or boolean values determining if the user checked the corresponding box. On error, null.

Rhino.UI.Dialogs.StringBoxRects
FOR INTERNAL TESTING
Ignore - this is for internal testing and will be removed.
Returns:
On Windows (.NET)
{X=0,Y=0,Width=300,Height=126}
{X=0,Y=0,Width=284,Height=88}
{X=0,Y=0,Width=284,Height=88}
{X=10,Y=9,Width=49,Height=13}
{X=0,Y=0,Width=49,Height=13}
{X=0,Y=0,Width=49,Height=13}
{X=197,Y=55,Width=75,Height=23}
{X=0,Y=0,Width=75,Height=23}
{X=0,Y=0,Width=75,Height=23}
{X=116,Y=55,Width=75,Height=23}
{X=0,Y=0,Width=75,Height=23}
{X=0,Y=0,Width=75,Height=23}
{X=13,Y=29,Width=259,Height=20}
{X=0,Y=0,Width=255,Height=16}
{X=0,Y=0,Width=255,Height=16}