Rhino.Geometry.Collections.BrepEdgeList.SplitKinkyEdge(System.Int32,System.Double)
Splits the edge into G1 pieces.
edgeIndex: Index of edge to test and split.
kinkToleranceRadians: The split tolerance in radians.
Returns: true if successful.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.

Rhino.Geometry.Collections.BrepEdgeList.SplitEdgeAtParameters(System.Int32,System.Collections.Generic.IEnumerable{System.Double})
Splits an edge at the specified parameters.
edgeIndex: The index of the edge to be addressed.
edgeParameters: The parameter along that edge.
Returns:
Number of splits applied to the edge.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.

Rhino.Geometry.Collections.BrepEdgeList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepEdgeList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepEdgeList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepEdgeList.Count
Gets the number of brep edges.