Rhino.Display.DisplayBitmap
A bitmap resource that can be used by the display pipeline (currently only
in OpenGL display).  Current limitation is that the bitmap should always
have a witdh and height which are a power of 2 in value.  Reuse DisplayBitmaps
for drawing if possible;  it is much more expensive to construct new DisplayBitmaps
than it is to reuse existing DisplayBitmaps.

Rhino.Display.DisplayBitmap.#ctor(System.Drawing.Bitmap)
Constructs a DisplayBitmap from an existing bitmap.
bitmap: The original bitmap.

Rhino.Display.DisplayBitmap.Load(System.String)
Load a DisplayBitmap from and image file on disk.
path: A location from which to load the file.
Returns: The new display bitmap, or null on error.

Rhino.Display.DisplayBitmap.SetBlendFunction(Rhino.Display.BlendMode,Rhino.Display.BlendMode)
Sets blending function used to determine how this bitmap is blended
with the current framebuffer color.  The default setting is SourceAlpha
for source and OneMinusSourceAlpha for destination.  See OpenGL's
glBlendFunc for details.
http://www.opengl.org/sdk/docs/man/xhtml/glBlendFunc.xml
source: The source blend mode.
destination: The destination blend mode.

Rhino.Display.DisplayBitmap.GetBlendModes(Rhino.Display.BlendMode@,Rhino.Display.BlendMode@)
Gets the source and destination blend modes.
source: The source blend mode is assigned to this out parameter.
destination: The destination blend mode is assigned to this out parameter.

Rhino.Display.DisplayBitmap.Dispose
Actively reclaims unmanaged resources that this instance uses.