Rhino.Geometry.Box.#ctor(Rhino.Geometry.BoundingBox)
Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the
World XY plane.
bbox: BoundingBox to mimic.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Initializes a new box from a base Plane and three Intervals.
basePlane: Orientation plane of the box.
xSize: Dimensions along the base plane X-Axis.
ySize: Dimensions along the base plane Y-Axis.
zSize: Dimensions along the base plane Z-Axis.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes the smallest box that contains a set of points.
basePlane: Orientation of the box.
points: Points to include, Invalid points will be ignored.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.GeometryBase)
Initializes a box that contains a generic piece of geometry.
This box will be aligned with an arbitrary plane.
basePlane: Base plane for aligned bounding box.
geometry: Geometry to box.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Initializes a world aligned box from a base plane and a boundingbox.
basePlane: Base plane of bounging box.
boundingbox: Bounding Box in plane coordinates.

Rhino.Geometry.Box.PointAt(System.Double,System.Double,System.Double)
Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
x: Unitized parameter (between 0 and 1 is inside the box) along box X direction.
y: Unitized parameter (between 0 and 1 is inside the box) along box Y direction.
z: Unitized parameter (between 0 and 1 is inside the box) along box Z direction.
Returns: The point at (x,y,z).

Rhino.Geometry.Box.ClosestPoint(Rhino.Geometry.Point3d)
Finds the closest point on or in the Box. The box should be Valid for this to work.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.

Rhino.Geometry.Box.FurthestPoint(Rhino.Geometry.Point3d)
Finds the furthest point on the Box. The Box should be Valid for this to work properly.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.

Rhino.Geometry.Box.Inflate(System.Double)
Inflates the box by a given offset in each direction.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes cannot be inflated.
amount: Amount (in model units) to inflate this box in all directions.

Rhino.Geometry.Box.Inflate(System.Double,System.Double,System.Double)
Inflates the box by a given offset in each direction.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes cannot be inflated.
xAmount: Amount (in model units) to inflate this box in the x direction.
yAmount: Amount (in model units) to inflate this box in the y direction.
zAmount: Amount (in model units) to inflate this box in the z direction.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d)
Determines whether a point is included in this box. This is the same as calling Contains(point,false)
point: Point to test.
Returns: true if the point is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d,System.Boolean)
Determines whether a point is included in this box.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the Box.
I.e. coincident points will be considered 'outside'.
Returns: true if the point is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox)
Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: true if the box is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Test a boundingbox for Box inclusion.
box: Box to test.
strict: If true, the boundingbox needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box)
Test a box for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: true if the box is on the inside of or coincident with this Box.

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box,System.Boolean)
Test a box for Box inclusion.
box: Box to test.
strict: If true, the box needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this Box.

Rhino.Geometry.Box.Union(Rhino.Geometry.Point3d)
Constructs a union between this Box and the given point.
This grows the box in directions so it contains the point.
point: Point to include.

Rhino.Geometry.Box.MakeValid
Attempts to make the Box valid. This is not always possible.
Returns: true if the box was made valid, or if it was valid to begin with.
false if the box remains in a differently abled state.

Rhino.Geometry.Box.GetCorners
Gets an array of the 8 corner points of this box.
Returns: An array of 8 corners.

Rhino.Geometry.Box.Transform(Rhino.Geometry.Transform)
Transforms this Box using a Transformation matrix. If the Transform does not preserve
Similarity, the dimensions of the resulting box cannot be trusted.
xform: Transformation matrix to apply to this Box.
Returns: true if the Box was successfully transformed, false if otherwise.

Rhino.Geometry.Box.RepositionBasePlane(Rhino.Geometry.Point3d)
Repositions the origin of the Base plane for this box without affecting
the physical dimensions.
origin: The new base plane origin.

Rhino.Geometry.Box.ToBrep
Constructs a brep representation of this box.
Returns: A Brep representation of this box or null.

Rhino.Geometry.Box.Empty
Empty Box. Empty boxes are considered to be invalid.

Rhino.Geometry.Box.Unset
Gets a Box whose base plane and axis dimensions are all Unset.

Rhino.Geometry.Box.IsValid
Gets the validity of this Box. Boxes are invalid when the base plane or any of
the dimension intervals are invalid or decreasing.

Rhino.Geometry.Box.Plane
Gets or sets the orientation plane for this Box.

Rhino.Geometry.Box.X
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane X-Axis. Otherwise known as the Width of the Box.

Rhino.Geometry.Box.Y
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.

Rhino.Geometry.Box.Z
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.

Rhino.Geometry.Box.Center
Gets the point that is in the center of the box.

Rhino.Geometry.Box.BoundingBox
Gets the world axis aligned Bounding box for this oriented box.

Rhino.Geometry.Box.Area
Gets the total surface area of this box.

Rhino.Geometry.Box.Volume
Gets the total volume of this box.