Rhino.Geometry.CurveSimplifyOptions
Enumerates the options to use when simplifying a curve.

Rhino.Geometry.CurveSimplifyOptions.SplitAtFullyMultipleKnots
Split NurbsCurves at fully multiple knots.
Effectively turning single nurbs segments with kinks into multiple segments.

Rhino.Geometry.CurveSimplifyOptions.RebuildRationals
Replace rational nurbscurves with constant weights
with an equivalent non-rational NurbsCurve.