Rhino.Runtime.InteropWrappers.SimpleArrayInt.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.Count
Gets the amount of elements in this array.