Rhino.Collections.ArchivableDictionary.#ctor
Initializes an instance of a dictionary for writing to a 3dm archive.

Rhino.Collections.ArchivableDictionary.#ctor(Rhino.DocObjects.Custom.UserData)
Initializes an instance of a dictionary for writing to a 3dm archive
parentUserData:
parent user data if this dictionary is associated with user data

Rhino.Collections.ArchivableDictionary.#ctor(System.Int32)
Initializes an instance of a dictionary for writing to a 3dm archive.
version:
Custom version used to help the plug-in developer determine which version of
a dictionary is being written. One good way to write version information is to
use a date style integer (YYYYMMDD)

Rhino.Collections.ArchivableDictionary.#ctor(System.Int32,System.String)
Initializes an instance of a dictionary for writing to a 3dm archive.
version:
custom version used to help the plug-in developer determine which version of
a dictionary is being written. One good way to write version information is to
use a date style integer (YYYYMMDD)
name:
Optional name to associate with this dictionary.
NOTE: if this dictionary is set as a subdictionary, the name will be changed to
the subdictionary key entry

Rhino.Collections.ArchivableDictionary.Read(Rhino.FileIO.BinaryArchiveReader)
Reads a dictionary from an archive.
The archive to read from. The archive position should be at the beginning of
the dictionary
Returns: new filled dictionary on success. null on failure.

Rhino.Collections.ArchivableDictionary.ContainsKey(System.String)
Determines whether the dictionary contains the specified key.
key: The key to locate.
Returns: true if the dictionary contains an element with the specified key; otherwise, false.
Throws System.ArgumentNullException: key is null.

Rhino.Collections.ArchivableDictionary.Clear
Removes all keys and values from the dictionary.

Rhino.Collections.ArchivableDictionary.Remove(System.String)
Removes the value with the specified key from the dictionary.
key: The key of the element to remove.
Throws System.ArgumentNullException: Key is null.
Returns: true if the element is successfully found and removed; otherwise, false.
This method returns false if key is not found.

Rhino.Collections.ArchivableDictionary.TryGetValue(System.String,System.Object@)
Gets the value associated with the specified key.
key: The key of the value to get.
value: When this method returns and if the key is found,
contains the value associated with the specified key;
otherwise, null. This parameter is passed uninitialized.
Returns: true if the dictionary contains an element with the specified key; otherwise, false.
Throws System.ArgumentNullException: Key is null.

Rhino.Collections.ArchivableDictionary.TryGetString(System.String,System.String@)
Get value as string, will only succeed if value was created using Set(string key, string value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetString(System.String)
Get value as string, will only succeed if value was created using Set(string key, string value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetString(System.String,System.String)
Get value as string, will return defaultValue unless value was created using Set(string key, string value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetBool(System.String,System.Boolean@)
Get value as bool, will only succeed if value was created using Set(string key, bool value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetBool(System.String)
Get value as bool, will only succeed if value was created using Set(string key, bool value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetBool(System.String,System.Boolean)
Get value as bool, will return defaultValue unless value was created using Set(string key, bool value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetFloat(System.String,System.Single@)
Get value as float, will only succeed if value was created using Set(string key, float value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetFloat(System.String)
Get value as float, will only succeed if value was created using Set(string key, float value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetFloat(System.String,System.Single)
Get value as float, will return defaultValue unless value was created using Set(string key, float value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetDouble(System.String,System.Double@)
Get value as double, will only succeed if value was created using Set(string key, double value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetDouble(System.String)
Get value as double, will only succeed if value was created using Set(string key, double value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetInteger(System.String,System.Int32)
Get value as int, will return defaultValue unless value was created using Set(string key, int value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetInteger(System.String,System.Int32@)
Get value as int, will only succeed if value was created using Set(string key, int value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetInteger(System.String)
Get value as int, will only succeed if value was created using Set(string key, int value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.Getint(System.String,System.Int32)
Get value as int, will return defaultValue unless value was created using Set(string key, int value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetPoint3f(System.String,Rhino.Geometry.Point3f@)
Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String)
Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String,Rhino.Geometry.Point3f)
Get value as Point3f, will return defaultValue unless value was created using Set(string key, Point3f value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)
Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String)
Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String,Rhino.Geometry.Point3d)
Get value as Point3d, will return defaultValue unless value was created using Set(string key, Point3d value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetVector3d(System.String,Rhino.Geometry.Vector3d@)
Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetVector3d(System.String)
Get value as Vector3d, will only succeed if value was created using Set(string key, Vector3d value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetVector3d(System.String,Rhino.Geometry.Vector3d)
Get value as Vector3d, will return defaultValue unless value was created using Set(string key, Vector3d value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetGuid(System.String,System.Guid@)
Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetGuid(System.String)
Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetGuid(System.String,System.Guid)
Get value as Guid, will return defaultValue unless value was created using Set(string key, Guid value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Boolean)
Sets a System.Boolean.
key: The text key.
val: A System.Boolean value.
Because System.Boolean has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Byte)
Sets a System.Byte.
key: The text key.
val: A System.Byte.
Because System.Byte has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.SByte)
Sets a System.SByte.
key: The text key.
val: A System.SByte.
Because System.SByte has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Int16)
Sets a System.Int16.
key: The text key.
val: A System.Int16.
Because System.Int16 has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.UInt16)
Sets a System.UInt16.
key: The text key.
val: A System.UInt16.
Because System.UInt16 has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Int32)
Sets a System.Int32.
key: The text key.
val: A System.Int32.
Because System.Int32 has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.UInt32)
Sets a System.UInt32.
key: The text key.
val: A System.UInt32.
Because System.UInt32 has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Int64)
Sets a System.Int64.
key: The text key.
val: A System.Int64.
Because System.Int64 has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Single)
Sets a System.Single.
key: The text key.
val: A System.Single.
Because System.Single has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Double)
Sets a System.Double.
key: The text key.
val: A System.Double.
Because System.Double has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Guid)
Sets a System.Guid.
key: The text key.
val: A System.Guid.
Because System.Guid has value semantics, changes to the assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.String)
Sets a System.String.
key: The text key.
val: A System.String.
Because System.String is immutable, it is not possible to modify the object while it is in this dictionary.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Boolean})
Sets a list, an array or any enumerable of System.Boolean.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Byte})
Sets a list, an array or any enumerable of System.Byte.
key: A text key.
val: A value for that key
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.SByte})
Sets a list, an array or any enumerable of System.SByte.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Int16})
Sets a list, an array or any enumerable of System.Int16.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Int32})
Sets a list, an array or any enumerable of System.Int32.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Single})
Sets a list, an array or any enumerable of System.Single.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Double})
Sets a list, an array or any enumerable of System.Double.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Sets a list, an array or any enumerable of System.Guid.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.String})
Sets a list, an array or any enumerable of System.String.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.
It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Color)
Sets a System.Drawing.Color.
key: A text key.
val: A value for that key.
Because System.Drawing.Color has value semantics, changes to the
assigning value will leave this entry unchanged.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Point)
Sets a System.Drawing.Point.
key: A text key.
val: A value for that key.
Because System.Drawing.Point has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.PointF)
Sets a System.Drawing.PointF.
key: A text key.
val: A value for that key.
Because System.Drawing.PointF has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Rectangle)
Sets a System.Drawing.Rectangle.
key: A text key.
val: A value for that key.
Because System.Drawing.Rectangle has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.RectangleF)
Sets a System.Drawing.RectangleF.
key: A text key.
val: A value for that key.
Because System.Drawing.RectangleF has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Size)
Sets a System.Drawing.Size.
key: A text key.
val: A value for that key.
Because System.Drawing.Size has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.SizeF)
Sets a System.Drawing.SizeF.
key: A text key.
val: A value for that key.
Because System.Drawing.SizeF has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Drawing.Font)
Sets a System.Drawing.Font.
key: A text key.
val: A value for that key.
Because System.Drawing.Font is immutable, it is not possible to modify the object while it is in this dictionary.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Interval)
Sets an Rhino.Geometry.Interval.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Interval has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point2d)
Sets a Rhino.Geometry.Point2d.
key: A text key.
val: A point for that key.
Because Rhino.Geometry.Point2d has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point3d)
Sets a Rhino.Geometry.Point3d.
key: A text key.
val: A point for that key.
Because Rhino.Geometry.Point3d has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point4d)
Sets a Rhino.Geometry.Point4d.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Point4d has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Vector2d)
Sets a Rhino.Geometry.Vector2d.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Vector2d has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Vector3d)
Sets a Rhino.Geometry.Vector3d.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Vector3d has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.BoundingBox)
Sets a Rhino.Geometry.BoundingBox.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.BoundingBox has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Ray3d)
Sets a Rhino.Geometry.Ray3d.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Ray3d has value semantics and is immutable, no changes to this object are possible.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Transform)
Sets a Rhino.Geometry.Transform.
key: A text key.
val: A transform for that key.
Because Rhino.Geometry.Transform has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Plane)
Sets a Rhino.Geometry.Plane.
key: A text key.
val: A plane for that key.
Because Rhino.Geometry.Plane has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Line)
Sets a Rhino.Geometry.Line.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Line has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point3f)
Sets a Rhino.Geometry.Point3f.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Point3f has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Vector3f)
Sets a Rhino.Geometry.Vector3f.
key: A text key.
val: A value for that key.
Because Rhino.Geometry.Vector3f has value semantics, changes to the assigning value will leave this entry unchanged.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Collections.ArchivableDictionary)
Sets another Rhino.Collections.ArchivableDictionary as entry in this dictionary.
key: A text key.
val: An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.MeshingParameters)
Sets a Rhino.Geometry.MeshingParameters.
key: A text key.
val: An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.GeometryBase)
Sets any class deriving from the Rhino.Geometry.GeometryBase base class.
key: A text key.
val: A geometry object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate. You can use Rhino.Geometry.GeometryBase.Duplicate for this.

Rhino.Collections.ArchivableDictionary.Clone
Constructs a deep copy of this object.
Returns: The copy of this object.

Rhino.Collections.ArchivableDictionary.System#Collections#Generic#IDictionary{System#String@System#Object}#Add(System.String,System.Object)
This is not supported and always throws System.NotSupportedException at the moment.
key: Unused.
value: Unused.

Rhino.Collections.ArchivableDictionary.GetEnumerator
Gets the enumerator of this dictionary.
Returns: A System.Collections.Generic.IEnumerator`1, where T is an instance of System.Collections.Generic.KeyValuePair`2, with T0 set as string, and T1 as Syste.Object.

Rhino.Collections.ArchivableDictionary.System#Collections#IEnumerable#GetEnumerator
Gets the enumerator of this dictionary.
Returns: A System.Collections.Generic.IEnumerator`1, where T is an instance of System.Collections.Generic.KeyValuePair`2, with T0 set as string, and T1 as Syste.Object.

Rhino.Collections.ArchivableDictionary.Version
Gets or sets the version of this Rhino.Collections.ArchivableDictionary.

Rhino.Collections.ArchivableDictionary.Name
Gets or sets the name string of this Rhino.Collections.ArchivableDictionary.

Rhino.Collections.ArchivableDictionary.ParentUserData
If this dictionary is part of userdata (or is a UserDictionary), then
this is the parent user data. null if this dictionary is not part of
userdata

Rhino.Collections.ArchivableDictionary.Keys
Gets all entry names or keys.

Rhino.Collections.ArchivableDictionary.Values
Gets all values in this dictionary.

Rhino.Collections.ArchivableDictionary.Count
Gets the number of key/value pairs contained in the dictionary.