Rhino.Geometry.PointCloud.#ctor
Initializes a new instance of the Rhino.Geometry.PointCloud class
that is empty.

Rhino.Geometry.PointCloud.#ctor(Rhino.Geometry.PointCloud)
Initializes a new instance of the Rhino.Geometry.PointCloud class,
copying (Merge) the content of another pointcloud.

Rhino.Geometry.PointCloud.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new instance of the Rhino.Geometry.PointCloud class,
copying the content from a set of points.
points: A list or an array of Point3d, or any object that implements System.Collections.Generic.IEnumerable`1.

Rhino.Geometry.PointCloud.ClearColors
Destroys the color information in this point cloud.

Rhino.Geometry.PointCloud.ClearNormals
Destroys the normal vector information in this point cloud.

Rhino.Geometry.PointCloud.ClearHiddenFlags
Destroys the hidden flag information in this point cloud.

Rhino.Geometry.PointCloud.AppendNew
Appends a new PointCloudItem to the end of this point cloud.
Returns: The newly appended item.

Rhino.Geometry.PointCloud.InsertNew(System.Int32)
Inserts a new Rhino.Geometry.PointCloudItem at a specific position of the point cloud.
index: Index of new item.
Returns: The newly inserted item.

Rhino.Geometry.PointCloud.Merge(Rhino.Geometry.PointCloud)
Copies the point values of another pointcloud into this one.
other: PointCloud to merge with this one.

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d)
Append a new point to the end of the list.
point: Point to append.

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Append a new point to the end of the list.
point: Point to append.
normal: Normal vector of new point.

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,System.Drawing.Color)
Append a new point to the end of the list.
point: Point to append.
color: Color of new point.

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Append a new point to the end of the list.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Append a collection of points to this point cloud.
points: Points to append.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,System.Drawing.Color)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
color: Color of new point.

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.

Rhino.Geometry.PointCloud.InsertRange(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Append a collection of points to this point cloud.
index: Index at which to insert the new collection.
points: Points to append.

Rhino.Geometry.PointCloud.RemoveAt(System.Int32)
Remove the point at the given index.
index: Index of point to remove.

Rhino.Geometry.PointCloud.GetPoints
Copy all the point coordinates in this point cloud to an array.
Returns: An array containing all the points in this point cloud.

Rhino.Geometry.PointCloud.GetNormals
Copy all the normal vectors in this point cloud to an array.
Returns: An array containing all the normals in this point cloud.

Rhino.Geometry.PointCloud.GetColors
Copy all the point colors in this point cloud to an array.
Returns: An array containing all the colors in this point cloud.

Rhino.Geometry.PointCloud.ClosestPoint(Rhino.Geometry.Point3d)
Returns index of the closest point in the point cloud to a given test point.
testPoint: .
Returns: Index of point in the point cloud on success. -1 on failure.

Rhino.Geometry.PointCloud.GetEnumerator
Gets an enumerator that allows to modify each pointcloud point.
Returns: A instance of System.Collections.Generic.IEnumerator`1.

Rhino.Geometry.PointCloud.Count
Gets the number of points in this pointcloud.

Rhino.Geometry.PointCloud.HiddenPointCount
Gets the number of points that have their Hidden flag set.

Rhino.Geometry.PointCloud.ContainsColors
Gets a value indicating whether or not the points in this
pointcloud have colors assigned to them.

Rhino.Geometry.PointCloud.ContainsNormals
Gets a value indicating whether or not the points in this
pointcloud have normals assigned to them.

Rhino.Geometry.PointCloud.ContainsHiddenFlags
Gets a value indicating whether or not the points in this
pointcloud have hidden flags assigned to them.