Rhino.DocObjects.Material.Default
Set material to default settings.

Rhino.DocObjects.Material.GetBumpTexture
Gets the bump texture of this material.
Returns: A texture; or null if no bump texture has been added to this material.

Rhino.DocObjects.Material.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.DocObjects.Material.GetUserString(System.String)
Gets a user string.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.DocObjects.Material.GetUserStrings
Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
Returns: A collection of key strings and values strings. This

Rhino.DocObjects.Material.IsDeleted
Deleted materials are kept in the runtime material table so that undo
will work with materials.  Call IsDeleted to determine to determine if
a material is deleted.

Rhino.DocObjects.Material.Id
Gets or sets the ID of this material.

Rhino.DocObjects.Material.RenderPlugInId
The Id of the RenderPlugIn that is associated with this material.

Rhino.DocObjects.Material.IsReference
Rhino allows multiple files to be viewed simultaneously. Materials in the
document are "normal" or "reference". Reference materials are not saved.

Rhino.DocObjects.Material.IsDefaultMaterial
By default Rhino layers and objects are assigned the default rendering material.

Rhino.DocObjects.Material.UseCount
Number of objects and layers that use this material.

Rhino.DocObjects.Material.Shine
Gets or sets the shine factor of the material.

Rhino.DocObjects.Material.Transparency
Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)