Rhino.DocObjects.Tables.ObjectTable.Find(System.Guid)
Uses the object guid to find a rhino object. Deleted objects cannot be found by id.
The guid is the value that is stored on RhinoObject.Id
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits it's guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/openning operations. This function will not find grip objects.
objectId: ID of object to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.

Rhino.DocObjects.Tables.ObjectTable.Find(System.UInt32)
Use the object runtime serial number to find a rhino object in the document. This is the value stored on
RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every
instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application.
If an object is replaced with a new object, then the new object will have a different runtime serial number.
Deleted objects stored in the undo list maintain their runtime serial numbers and this funtion will return
pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is
active or deleted.  The runtime serial number is not saved in files.
runtimeSerialNumber: Runtime serial number to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByGroup(System.Int32)
Finds all RhinoObjects that are in a given group.
groupIndex: Index of group to search for.
Returns: An array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(Rhino.DocObjects.Layer)
Finds all RhinoObjects that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(System.String)
Finds all RhinoObjects that are in a given layer.
layerName: Name of layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByFilter(Rhino.DocObjects.ObjectEnumeratorSettings)
Same as GetObjectList but converts the result to an array.
filter: The object enumerator filter to customize inclusion requirements.
Returns: A Rhino object array. This array can be emptry but not null.

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectType)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
searchGeometry: If true, UserStrings attached to the geometry of an object will be searched.
searchAttributes: If true, UserStrings attached to the attributes of an object will be searched.
filter: Object type filter.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectEnumeratorSettings)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
searchGeometry: If true, UserStrings attached to the geometry of an object will be searched.
searchAttributes: If true, UserStrings attached to the attributes of an object will be searched.
filter: Filter used to restrict the number of objects searched.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByDrawColor(System.Drawing.Color,System.Boolean)
Finds all objects whose draw color matches a given color.
drawColor: The alpha value of this color is ignored.
includeLights: true if lights should be included.
Returns: An array of Rhino document objects. This array can be empty.

Rhino.DocObjects.Tables.ObjectTable.FindClippingPlanesForViewport(Rhino.Display.RhinoViewport)
Finds all of the clipping plane objects that actively clip a viewport.
viewport: The viewport in which clipping planes are searched.
Returns: An array of clipping plane objects. The array can be emptry but not null.

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
attributes: The object attributes. This can be null.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(System.Double,System.Double,System.Double)
Adds a point object to the document.
x: X component of point coordinate.
y: Y component of point coordinate.
z: Z component of point coordinate.
Returns: A unique identifier for the object..

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point. null is acceptible
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point object to the document
point: location of point
attributes: attributes to apply to point. null is acceptible
history: history associated with this point. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud)
Adds a point cloud object to the document.
cloud: PointCloud to add.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this pointcloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points.
attributes: attributes to apply to point cloud.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this pointcloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid)
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportId: Viewport ID that the new clipping plane will clip.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid})
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportIds: A list, an array or any enumerable set of viewport IDs
that the new clipping plane will clip.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportIds: A list, an array or any enumerable set of viewport IDs
that the new clipping plane will clip.
attributes: Document attributes for the plane.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension)


Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Adds a line object to Rhino.
from: The line origin.
to: The line end.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
from: The line origin.
to: The line end.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line)
Adds a line object to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
line: The line value.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a polyline object to Rhino.
points: A Rhino.Geometry.Polyline; a list, an array, or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a polyline object to Rhino.
points: A Rhino.Geometry.Polyline; a list, an array, or any enumerable set of Rhino.Geometry.Point3d.
attributes: attributes to apply to line.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc)
Adds a curve object to the document representing an arc.
arc: An arc value.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an arc.
arc: An arc value.
attributes: Attributes to apply to arc.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle)
Adds a curve object to the document representing a circle.
circle: A circle value.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing a circle.
circle: A circle value.
attributes: Attributes to apply to circle.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse value.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse value.
attributes: Attributes to apply to ellipse.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere)


Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve)
Adds a curve object to Rhino.
curve: A curve. A duplicate of this curve is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to Rhino.
curve: A curve. A duplicate of this curve is added to Rhino.
attributes: Attributes to apply to curve.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d)
Adds a text dot object to Rhino.
text: A text string.
location: A point position.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
text: A text string.
location: A point position.
attributes: Attributes to apply to curve.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Adds a text dot object to Rhino.
dot: A text dot that will be copied.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
dot: A text dot that will be copied.
attributes: Attributes to apply to text dot.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d)
Adds an annotation text object to the document.
text3d: The text object to add.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text3d: The text object to add.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
attributes: Attributes that will be linked with the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
attributes: Attributes that will be linked with the surface object.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
attributes: Attributes that will be linked with the mesh object.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
attributes: attributes to apply to brep.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddHatch(Rhino.Geometry.Hatch)


Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.ObjRef,System.Boolean)
Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
objref: objref.Object() will be deleted.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
obj: The object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Delete(System.Guid,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
objectId: Id of the object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Delete(System.Collections.Generic.IEnumerable{System.Guid},System.Boolean)
Deletes a collection of objects from the document.
objectIds: Ids of all objects to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: The number of successfully deleted objects.

Rhino.DocObjects.Tables.ObjectTable.Purge(System.UInt32)
Removes object from document and deletes the pointer. Typically you will
want to call Delete instead in order to keep the object on the undo list.
runtimeSerialNumber: A runtime serial number of the object that will be deleted.
Returns: true if the object was purged; otherwise false.

Rhino.DocObjects.Tables.ObjectTable.Purge(Rhino.DocObjects.RhinoObject)
Removes object from document and deletes the pointer. Typically you will
want to call Delete instead in order to keep the object on the undo list.
rhinoObject: A Rhino object that will be deleted.
Returns: true if the object was purged; otherwise false.

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef)
Select a single object.
objref: Object represented by this ObjRef is selected.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Selects a collection of objects.
objRefs: References to objects to select.
Returns: Number of objects successfully selected.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},System.Boolean)
Selects or deselects a collection of objects.
objRefs: References to objects to select or deselect.
select:
If true, objects will be selected.
If false, objects will be deselected.
Returns: Number of objects successfully selected or deselected.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid)
Select a single object.
objectId: Id of object to select.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{System.Guid})
Selects a collection of objects.
objectIds: Ids of objects to select.
Returns: Number of objects successfully selected.

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{System.Guid},System.Boolean)
Selects or deselects a collection of objects.
objectIds: Ids of objects to select or deselect.
select:
If true, objects will be selected.
If false, objects will be deselected.
Returns: Number of objects successfully selected or deselected.

Rhino.DocObjects.Tables.ObjectTable.UnselectAll(System.Boolean)
Unselect objects.
ignorePersistentSelections:
if true, then objects that are persistently selected will not be unselected.
Returns: Number of object that were unselected.

Rhino.DocObjects.Tables.ObjectTable.UnselectAll
Unselect objects.
Returns: Number of object that were unselected.

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.ObjRef,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
objref: reference to object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
obj: object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(System.Guid,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
objectId: Id of object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.DocObjects.RhinoObject)
Replaces one object with another. Conceptually, this function is the same as calling
Setting new_object attributes = old_object attributes
DeleteObject(old_object);
AddObject(old_object);
objref: reference to old object to be replaced. The objref.Object() will be deleted.
newObject: new replacement object - must not be in document.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Point3d)
Replaces one object with new point object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
point: new point to be added.  The point is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Point3d)
Replaces one object with new point object.
objectId: Id of object to be replaced.
point: new point to be added.  The point is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextDot)
Replaces one object with new textdot object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
dot: new textdot to be added.  The textdot is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.TextDot)
Replaces one object with new textdot object.
objectId: Id of object to be replaced.
dot: new textdot to be added.  The textdot is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Line)
Replaces one object with new line curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
line: new line to be added.  The line is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Line)
Replaces one object with new line curve object.
objectId: Id of object to be replaced.
line: new line to be added.  The line is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Circle)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
circle: new circle to be added.  The circle is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Circle)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
circle: new circle to be added.  The circle is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Arc)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
arc: new arc to be added.  The arc is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Arc)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
arc: new arc to be added.  The arc is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Polyline)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
polyline: new polyline to be added.  The polyline is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Polyline)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
polyline: new polyline to be added.  The polyline is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Curve)
Replaces one object with new curve object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
curve:
New curve to be added. A duplicate of the curve is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Curve)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
curve:
New curve to be added. A duplicate of the curve is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Surface)
Replaces one object with new surface object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
surface:
new surface to be added
A duplicate of the surface is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Surface)
Replaces one object with new surface object.
objectId: Id of object to be replaced.
surface:
new surface to be added
A duplicate of the surface is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep)
Replaces one object with new brep object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
brep:
new brep to be added
A duplicate of the brep is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep)
Replaces one object with new brep object.
objectId: Id of object to be replaced.
brep:
new surface to be added
A duplicate of the brep is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Mesh)
Replaces one object with new mesh object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
mesh:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Mesh)
Replaces one object with new mesh object.
objectId: Id of object to be replaced.
mesh:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
text:
new text to be added
A duplicate of the text is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objectId: Id of object to be replaced.
text:
new text to be added
A duplicate of the text is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.PointCloud)
Replaces one object with new pointcloud object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
pointcloud:
new pointcloud to be added
A duplicate of the pointcloud is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.PointCloud)
Replaces one object with new pointcloud object.
objectId: Id of object to be replaced.
pointcloud:
new pointcloud to be added
A duplicate of the pointcloud is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.MostRecentObject
Gets the most recently added object that is still in the Document.
Returns: The most recent (non-deleted) object in the document, or null if no such object exists.

Rhino.DocObjects.Tables.ObjectTable.AllObjectsSince(System.UInt32)
Gets all the objects that have been added to the document since a given runtime serial number.
runtimeSerialNumber: Runtime serial number of the last object not to include in the list.
Returns: An array of objects or null if no objects were added since the given runtime serial number.

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be hidden.
objref: reference to object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be hidden.
obj: object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.

Rhino.DocObjects.Tables.ObjectTable.Hide(System.Guid,System.Boolean)
If Object().IsNormal() is true, then the object will be hidden.
objectId: Id of object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objref: reference to normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
obj: the normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.

Rhino.DocObjects.Tables.ObjectTable.Show(System.Guid,System.Boolean)
If Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objectId: Id of the normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objref: reference to normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be locked.
obj: normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.

Rhino.DocObjects.Tables.ObjectTable.Lock(System.Guid,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objectId: Id of normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
objref: reference to locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
obj: locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.

Rhino.DocObjects.Tables.ObjectTable.Unlock(System.Guid,System.Boolean)
If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
objectId: Id of locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objref:
reference to object to transform. The objref.Object() will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
obj:
Rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.Transform(System.Guid,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objectId:
Id of rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objref, xform, false)
objref:
reference to object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(obj, xform, false)
obj:
Rhino object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(System.Guid,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objectId, xform, false)
objectId:
Id of rhino object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.ObjRef)
Duplicates the object that is referenced by objref.
Same as Transform(objref, Transform.Identity, false)
objref: A Rhino object reference to follow for object duplication.
Returns: The new object ID.

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.RhinoObject)
Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
obj: A Rhino object to duplicate.
Returns: The new object ID.

Rhino.DocObjects.Tables.ObjectTable.Duplicate(System.Guid)
Same as TransformObject(objref, ON_Xform.Identity, false)
objectId: An ID to an object in the document that needs to be duplicated.
Returns: The new object ID.

Rhino.DocObjects.Tables.ObjectTable.GripUpdate(Rhino.DocObjects.RhinoObject,System.Boolean)
Altered grip positions on a RhinoObject are used to calculate an updated object
that is added to the document.
obj: object with modified grips to update.
deleteOriginal: if true, obj is deleted from the document.
Returns: new RhinoObject on success; otherwise null.

Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectEnumeratorSettings)


Rhino.DocObjects.Tables.ObjectTable.Document
Gets the document that owns this object table.

Rhino.DocObjects.Tables.ObjectTable.BoundingBox
Gets the boundingbox for all objects (normal, locked and hidden) in this
document that exist in "model" space. This bounding box does not include
objects that exist in layout space.

Rhino.DocObjects.Tables.ObjectTable.BoundingBoxVisible
Gets the boundingbox for all visible objects (normal and locked) in this
document that exist in "model" space. This bounding box does not include
hidden objects or any objects that exist in layout space.