Rhino.Geometry.Torus.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new Torus from base pane and two radii.
basePlane: Base plane for major radius circle.
majorRadius: Radius of circle that lies at the heart of the torus.
minorRadius: Radius of torus section.

Rhino.Geometry.Torus.ToNurbsSurface
Converts this torus to its nurbs surface representation.
This is synonymous with calling NurbsSurface.CreateFromTorus().
Returns: A nurbs surface representation of this torus, or null on error.

Rhino.Geometry.Torus.ToRevSurface
Convert this torus to a surface of revolution representation.
This is synonymous with calling RevSurface.CreateFromTorus().
Returns: A surface of revolution representation of this torus, or null on error.

Rhino.Geometry.Torus.Unset
Gets an invalid Torus.

Rhino.Geometry.Torus.IsValid
Gets a value indicating whether this torus is valid.

Rhino.Geometry.Torus.Plane
Gets or sets the plane for the torus large circle.

Rhino.Geometry.Torus.MajorRadius
Gets or sets the radius of the circle that lies at the heart of the torus.

Rhino.Geometry.Torus.MinorRadius
Gets or sets the radius of the torus section.