Rhino.Geometry.Point2f.#ctor(System.Single,System.Single)
Initializes a new two-dimensional point from two components.
x: X component of vector.
y: Y component of vector.

Rhino.Geometry.Point2f.#ctor(System.Double,System.Double)
Initializes a new two-dimensional point from two double-precision floating point numbers as coordinates.
Coordinates will be internally converted to floating point numbers. This might cause precision loss.
x: X component of vector.
y: Y component of vector.

Rhino.Geometry.Point2f.Equals(Rhino.Geometry.Point2f)
Determines whether the specified Rhino.Geometry.Point2f has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.

Rhino.Geometry.Point2f.CompareTo(Rhino.Geometry.Point2f)
Compares this Rhino.Geometry.Point2f with another Rhino.Geometry.Point2f.
Coordinates evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Point2f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.

Rhino.Geometry.Point2f.op_Equality(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether two Rhino.Geometry.Point2f have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.

Rhino.Geometry.Point2f.op_Inequality(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether two Rhino.Geometry.Point2f have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.

Rhino.Geometry.Point2f.op_LessThan(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes before
(has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.

Rhino.Geometry.Point2f.op_LessThanOrEqual(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.

Rhino.Geometry.Point2f.op_GreaterThan(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes after
(has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.

Rhino.Geometry.Point2f.op_GreaterThanOrEqual(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.

Rhino.Geometry.Point2f.Unset
Gets the standard unset point.

Rhino.Geometry.Point2f.IsValid
Gets a value indicating whether this point is considered valid.

Rhino.Geometry.Point2f.X
Gets or sets the X (first) component of the vector.

Rhino.Geometry.Point2f.Y
Gets or sets the Y (second) component of the vector.