Rhino.Runtime.InteropWrappers.SimpleArrayInterval
Wrapper for ON_SimpleArray<ON_Imterval>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInterval class.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Count
Gets the amount of elements in this array.