Rhino.ApplicationSettings.MiddleMouseMode
Defines enumerated constant values to define what happens when
either the middle mouse button on a three-button mouse is clicked or after pressing the wheel on a wheeled mouse.