Rhino.Runtime.Skin.ActiveSkin
Any time Rhino is running there is at most one skin being used (and
possibly no skin).  If a RhinoCommon based Skin class is being used, use
ActiveSkin to get at the instance of this Skin class. May return null
if no Skin is being used or if the skin is not a RhinoCommon based skin.

Rhino.Runtime.Skin.Settings
Gets access to the skin persistent settings.