Rhino.Runtime.InteropWrappers.StringWrapper.#ctor
Initializes a new empty unmanaged string.

Rhino.Runtime.InteropWrappers.StringWrapper.#ctor(System.String)
Initializes a new unmanaged string with an initial value.
s: The initial value.

Rhino.Runtime.InteropWrappers.StringWrapper.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.StringWrapper.SetString(System.String)
Set contents of this string.
s: The new string.

Rhino.Runtime.InteropWrappers.StringWrapper.SetStringOnPointer(System.IntPtr,System.String)
Set contents of an ON_wString*
pON_wString:
s:

Rhino.Runtime.InteropWrappers.StringWrapper.GetStringFromPointer(System.IntPtr)
Get string from an ON_wString*
pConstON_wString:
Returns:

Rhino.Runtime.InteropWrappers.StringWrapper.ConstPointer
Gets the const pointer (const ON_wString*).
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.StringWrapper.NonConstPointer
Gets the non-const pointer (ON_wString*).
Returns: The non-const pointer.