Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer
Represents a wrapper to an unmanaged array of mesh pointers.
Wrapper for a C++ ON_SimpleArray of ON_Mesh* or const ON_Mesh*. If you are not
writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Add(Rhino.Geometry.Mesh,System.Boolean)
Adds a mesh to the list.
mesh: A mesh to add.
asConst: Whether this mesh should be treated as non-modifiable.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Count
Gets the amount of meshes in this array.