Rhino.Geometry.Vector2f.Equals(Rhino.Geometry.Vector2f)
Determines whether the specified vector has the same values as the present vector.
vector: The specified vector.
Returns: true if obj is Vector2f and has the same coordinates as this; otherwise false.

Rhino.Geometry.Vector2f.CompareTo(Rhino.Geometry.Vector2f)
Compares this Rhino.Geometry.Vector2f with another Rhino.Geometry.Vector2f.
Components evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Vector2f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.

Rhino.Geometry.Vector2f.op_Equality(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if the components of the two vectors are exactly equal; otherwise false.

Rhino.Geometry.Vector2f.op_Inequality(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if the two vectors differ in any component; false otherwise.

Rhino.Geometry.Vector2f.op_LessThan(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.

Rhino.Geometry.Vector2f.op_LessThanOrEqual(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.

Rhino.Geometry.Vector2f.op_GreaterThan(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.

Rhino.Geometry.Vector2f.op_GreaterThanOrEqual(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.

Rhino.Geometry.Vector2f.X
Gets or sets the X (first) component of this vector.

Rhino.Geometry.Vector2f.Y
Gets or sets the Y (second) component of this vector.