Rhino.SettingValue.#ctor(System.String,System.String)
Constructor.
value: Current value string.
default_value: Default value string.

Rhino.SettingValue.SetValue(System.Boolean,System.String)
Set either the current or default value string.
bDefault: If true then the current value string is set otherwise the default value string is.
s: New value string.

Rhino.SettingValue.GetValue(System.Boolean)
Gets the current or default value as requested.
bDefault: If true then the default value string is returned otherwise the current value string is returned.
Returns: If bDefault is true then the default value string is returned otherwise the current value string is returned.