Rhino.UI.ObjectPropertiesPage.OnActivate(System.Boolean)
Called when this page is activated/deactivated.
active: If true then this page is on top otherwise it is about to be hidden.
Returns:
If true then the page is hidden and the requested page is not
activated otherwise will not allow you to change the current page.
Default returns true

Rhino.UI.ObjectPropertiesPage.PageControl
Return the control that represents this page. This will typically be a custom user control.