Rhino.RhinoDoc.FindFile(System.String)
Search for a file using Rhino's search path.  Rhino will look in the
following places:
1. Current model folder
2. Path specified in options dialog/File tab
3. Rhino system folders
4. Rhino executable folder
filename:
Returns:
Path to existing file if found, an empty string if no file was found

Rhino.RhinoDoc.ReadFileVersion
Returns the file version of the current document.
Use this function to determine which version of RhinoCommon last saved the document.
Returns:
The file version (e.g. 1, 2, 3, 4, etc.) or -1 if the document has not been read from disk.

Rhino.RhinoDoc.CreateDefaultAttributes
Gets the default object attributes for this document.
The attributes will be linked to the currently active layer
and they will inherit the Document WireDensity setting.

Rhino.RhinoDoc.BeginUndoRecord(System.String)
Instructs Rhino to begin recording undo information when the document
is changed outside of a command. We use this, e.g., to save changes
caused by the modeless layer or object properties dialogs
when commands are not running.
description: A text describing the record.
Returns:
Serial number of record.  Returns 0 if record is not started
because undo information is already being recorded or
undo is disabled.

Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs},System.Object)
Add a custom undo event so you can undo private plug-in data
when the user performs an undo or redo
description:
handler:
tag:
Returns:

Rhino.RhinoDoc.ExtractPreviewImage(System.String)
Extracts the bitmap preview image from the specified model (3DM).
The model (3DM) from which to extract the preview image.
If null, the currently loaded model is used.
Returns: true on success.

Rhino.RhinoDoc.ActiveDoc
WARNING!! Do not use the ActiveDoc if you don't have to. Under Mac Rhino the ActiveDoc
can change while a command is running. Use the doc that is passed to you in your RunCommand
function or continue to use the same doc after the first call to ActiveDoc.

Rhino.RhinoDoc.Name
Returns the name of the currently loaded RhinoCommon document (3DM file).

Rhino.RhinoDoc.Path
Returns the path of the currently loaded RhinoCommon document (3DM file).

Rhino.RhinoDoc.Notes
Returns or sets the document's notes.

Rhino.RhinoDoc.ModelAbsoluteTolerance
Model space absolute tolerance.

Rhino.RhinoDoc.ModelAngleToleranceRadians
Model space angle tolerance.

Rhino.RhinoDoc.ModelAngleToleranceDegrees
Model space angle tolerance.

Rhino.RhinoDoc.ModelRelativeTolerance
Model space relative tolerance.

Rhino.RhinoDoc.PageAbsoluteTolerance
Page space absolute tolerance.

Rhino.RhinoDoc.PageAngleToleranceRadians
Page space angle tolerance.

Rhino.RhinoDoc.PageAngleToleranceDegrees
Page space angle tolerance.

Rhino.RhinoDoc.PageRelativeTolerance
Page space relative tolerance.

Rhino.RhinoDoc.Modified
Returns or sets the document's modified flag.

Rhino.RhinoDoc.PageUnitSystem


Rhino.RhinoDoc.IsReadOnly
Current read-only mode for this document.
true if the document is can be viewed but NOT saved.
false if document can be viewed and saved.

Rhino.RhinoDoc.IsLocked
Check to see if the file associated with this document is locked.  If it is
locked then this is the only document that will be able to write the file.  Other
instances of Rhino will fail to write this document.

Rhino.RhinoDoc.DocumentId
Gets the Document Id.

Rhino.RhinoDoc.Bitmaps
bitmaps used in textures, backgrounds, wallpapers, ...

Rhino.RhinoDoc.Materials
Materials in the document.

Rhino.RhinoDoc.Linetypes
Linetypes in the document.

Rhino.RhinoDoc.Layers
Layers in the document.

Rhino.RhinoDoc.Groups


Rhino.RhinoDoc.HatchPatterns


Rhino.RhinoDoc.NamedViews


Rhino.RhinoDoc.IsSendingMail
true if Rhino is in the process of sending this document as an email attachment.

Rhino.RhinoDoc.TemplateFileUsed
name of the template file used to create this document. This is a runtime value
only present if the document was newly created.

Rhino.RhinoDoc.UndoRecordingIsActive
true if undo recording is actually happening now.

Rhino.RhinoDoc.AddRhinoObject
Called if a new object is added to the document.

Rhino.RhinoDoc.DeleteRhinoObject
Called if an object is deleted. At some later point the object can be un-deleted.

Rhino.RhinoDoc.ReplaceRhinoObject
Called if an object is about to be replaced.
If either RhinoDoc::UndoActive() or RhinoDoc::RedoActive() is true,
then immediatedly after ReplaceObject is called there will be a call
to DeleteObject and then a call to AddObject.
If both RhinoDoc::UndoActive() and RhinoDoc::RedoActive() are false,
then immediatedly after ReplaceObject is called there will be a call
to DeleteObject and then a call to UndeleteObject.

Rhino.RhinoDoc.UndeleteRhinoObject
Called if an object is un-deleted.

Rhino.RhinoDoc.PurgeRhinoObject
Called if an object is being purged from a document. The object will cease to exist forever.

Rhino.RhinoDoc.SelectObjects
Called when object(s) are selected.

Rhino.RhinoDoc.DeselectObjects
Called when object(s) are deselected.

Rhino.RhinoDoc.DeselectAllObjects
Called when all objects are deselected.

Rhino.RhinoDoc.ModifyObjectAttributes
Called when all objects are deselected.

Rhino.RhinoDoc.LayerTableEvent
Called when any modification happens to a document's layer table.

Rhino.RhinoDoc.MaterialTableEvent
Called when any modification happens to a document's material table.

Rhino.RhinoDoc.GroupTableEvent
Called when any modification happens to a document's group table.