Rhino.Commands.CommandStyleAttribute.#ctor(Rhino.Commands.Style)
Initializes a new command style attribute class.
styles:
Set of values combined using a bitwise OR operation to get the desired combination
of command styles.

Rhino.Commands.CommandStyleAttribute.Styles
Gets the associated style.