Rhino.Geometry.Collections.BrepLoopList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepLoopList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepLoopList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepLoopList.Count
Gets the number of brep loops.