Rhino.ApplicationSettings.FileSettingsState.AutoSaveInterval
How often the document will be saved when Rhino's automatic file saving mechanism is enabled.

Rhino.ApplicationSettings.FileSettingsState.AutoSaveEnabled
Enables or disables Rhino's automatic file saving mechanism.

Rhino.ApplicationSettings.FileSettingsState.AutoSaveMeshes
Saves render and display meshes in autosave file.

Rhino.ApplicationSettings.FileSettingsState.SaveViewChanges
true for users who consider view changes a document change.

Rhino.ApplicationSettings.FileSettingsState.FileLockingEnabled
Ensures that only one person at a time can have a file open for saving.

Rhino.ApplicationSettings.FileSettingsState.FileLockingOpenWarning
Displays an information dialog which identifies computer file is open on.

Rhino.ApplicationSettings.FileSettingsState.ClipboardCopyToPreviousRhinoVersion
Gets or sets a value that decides if copies to the clipboard are performed in both the current
and previous Rhino clipboard formats.  This means you will double the size of what is saved in
the clipboard but will be able to copy from the current to the previous version using the
clipboard.

Rhino.ApplicationSettings.FileSettingsState.ClipboardOnExit
Gets or sets a value that determines what to do with clipboad data on exit.

Rhino.ApplicationSettings.FileSettingsState.CreateBackupFiles
Gets or sets a value indicating whether to create backup files.