Rhino.DocObjects.Tables.BitmapTable.Find(System.String,System.Boolean,System.String@)
Use Document.FindFile to search for the specified file name, if the
file is found on the Rhino search path then fileName will contain the
full path to the requested file otherwise.  If the file was not found
then search this BitmapTable for a BitmapEntry that contains the
specified name and return it.  If the file was not found, the
createFile flag is set and a BitmapEntry is found then the BitmapEntry
will get saved to the Rhino bitmap file cache and fileName will contain
the full path to the cached file.
name:
Name of the file to search for including file extension.
createFile:
If this is true, the file is not found on the disk but is found in
the BitmapTable then the BitmapEntry will get saved to the Rhino bitmap
file cache and fileName will contain the full path to the cached file.
fileName:
The full path to the current location of this file or an empty string
if the file was not found and/or not extracted successfully.
Returns:
Returns the BitmapEntry with the specified name if found otherwise;
returns null.

Rhino.DocObjects.Tables.BitmapTable.AddBitmap(System.String,System.Boolean)
Adds a new bitmap with specified name to the bitmap table.
bitmapFilename:
If NULL or empty, then a unique name of the form "Bitmap 01" will be automatically created.
replaceExisting:
If true and the there is alread a bitmap using the specified name, then that bitmap is replaced.
If false and there is already a bitmap using the specified name, then -1 is returned.
Returns:
index of new bitmap in table on success. -1 on error.

Rhino.DocObjects.Tables.BitmapTable.DeleteBitmap(System.String)
Deletes a bitmap.
bitmapFilename: The bitmap file name.
Returns:
true if successful. false if the bitmap cannot be deleted because it
is the current bitmap or because it bitmap contains active geometry.

Rhino.DocObjects.Tables.BitmapTable.ExportToFiles(System.String,System.Int32)
Exports all the bitmaps in the table to files.
directoryPath:
full path to the directory where the bitmaps should be saved.
If NULL, a dialog is used to interactively get the directory name.
overwrite: 0 = no, 1 = yes, 2 = ask.
Returns: Number of bitmaps written.

Rhino.DocObjects.Tables.BitmapTable.ExportToFile(System.Int32,System.String)
Writes a bitmap to a file.
index: The index of the bitmap to be written.
path:
The full path, including file name and extension, name of the file to write.
Returns: true if successful.

Rhino.DocObjects.Tables.BitmapTable.GetEnumerator
BitmapTable enumerator
Returns:

Rhino.DocObjects.Tables.BitmapTable.Document
Gets the document that owns this bitmap table.

Rhino.DocObjects.Tables.BitmapTable.Count
Gets the number of bitmaps in the table.