Rhino.Geometry.AngularDimension
Represents a dimension of an entity that can be measured with an angle.
This entity refers to the geometric element that is independent from the document.

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Arc,System.Double)
Create an angular dimension from a give arc
arc: The start and end points of the arc are the start and endpoints of the dimension
offset: How far to offset the dimension location from the arc