Rhino.Commands.CommandEventArgs.CommandId
Gets the ID of the command that raised this event.

Rhino.Commands.CommandEventArgs.CommandEnglishName
Gets the English name of the command that raised this event.

Rhino.Commands.CommandEventArgs.CommandLocalName
Gets the name of the command that raised this event in the local language.

Rhino.Commands.CommandEventArgs.CommandPluginName
Gets the name of the plug-in that this command belongs to.  If the command is internal
to Rhino, then this propert is an empty string.

Rhino.Commands.CommandEventArgs.CommandResult
Gets the result of the command that raised this event.
This value is only meaningful during EndCommand events.