Rhino.ApplicationSettings.ModelAidSettingsState.GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.

Rhino.ApplicationSettings.ModelAidSettingsState.ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.

Rhino.ApplicationSettings.ModelAidSettingsState.AltPlusArrow
true mean Alt+arrow is used for nudging.

Rhino.ApplicationSettings.ModelAidSettingsState.DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.

Rhino.ApplicationSettings.ModelAidSettingsState.HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.Osnap
Gets or sets the enabled state of Rhino's object snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.SnapToLocked
Gets or sets the locked state of the snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.OrthoAngle
Gets or sets the base orthogonal angle.

Rhino.ApplicationSettings.ModelAidSettingsState.NudgeKeyStep
Enables or disables Rhino's object snap projection.

Rhino.ApplicationSettings.ModelAidSettingsState.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nurge step amount.

Rhino.ApplicationSettings.ModelAidSettingsState.ShiftNudgeKeyStep
Gets or sets the Shift-key based nurge step amount.

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.

Rhino.ApplicationSettings.ModelAidSettingsState.NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set.

Rhino.ApplicationSettings.ModelAidSettingsState.ControlPolygonDisplayDensity
Gets or sets the control polygon display density.

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapCursorMode
Gets or sets the OSnap cursor mode.

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapModes
Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.

Rhino.ApplicationSettings.ModelAidSettingsState.MousePickboxRadius
Gets or sets the radius of the mouse pick box in pixels.

Rhino.ApplicationSettings.ModelAidSettingsState.PointDisplay
Gets or sets the point display mode.