Rhino.Geometry.Arc
Represents the value of a plane, two angles and a radius in
a subcurve of a three-dimensional circle.
The curve is parameterized by an angle expressed in radians. For an IsValid arc
the total subtended angle AngleRadians() = Domain()(1) - Domain()(0) must satisfy
0 < AngleRadians() < 2*Pi
The parameterization of the Arc is inherited from the Circle it is derived from.
In particular
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
where xaxis and yaxis, (part of Circle.Plane) form an othonormal frame of the plane
containing the circle.

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Circle,System.Double)
Initializes a new instance of an arc from a base circle and an angle.
circle: Circle to base arc upon.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Circle,Rhino.Geometry.Interval)
Initializes a new instance of an arc from a base circle and an interval of angles.
circle: Circle to base arc upon.
angleIntervalRadians:
Increasing angle interval in radians with angleIntervalRadians.Length() <= 2.0*Math.PI.

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new arc from a base plane, a radius value and an angle.
plane: The plane of the arc (arc center will be located at plane origin)
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,System.Double,System.Double)
Initializes a new horizontal arc at the given center point, with a custom radius and angle.
center: Center point of arc.
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double,System.Double)
Initializes a new aligned arc at the given center point, with a custom radius and angle.
plane: Alignment plane for arc. The arc will be parallel to this plane.
center: Center point for arc.
radius: Radius of arc.
angleRadians: Sweep angle of arc (in radians)

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new arc through three points. If the points are coincident
or colinear, this will result in an Invalid arc.
startPoint: Start point of arc.
pointOnInterior: Point on arc interior.
endPoint: End point of arc.

Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Initializes a new arc from end points and a tangent vector.
If the tangent is parallel with the endpoints this will result in an Invalid arc.
pointA: Start point of arc.
tangentA: Tangent at start of arc.
pointB: End point of arc.

Rhino.Geometry.Arc.Trim(Rhino.Geometry.Interval)
Sets arc's angle domain (in radians) as a subdomain of the circle.
domain:
0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi.
Returns: true on success, false on failure.

Rhino.Geometry.Arc.Equals(Rhino.Geometry.Arc)
Determines whether another arc has the same value as this arc.
other: An arc.
Returns: true if obj is equal to this arc; otherwise false.

Rhino.Geometry.Arc.op_Equality(Rhino.Geometry.Arc,Rhino.Geometry.Arc)
Determines whether two arcs have equal values.
a: The first arc.
b: The second arc.
Returns: true if all values of the two arcs are exactly equal; otherwise false.

Rhino.Geometry.Arc.op_Inequality(Rhino.Geometry.Arc,Rhino.Geometry.Arc)
Determines whether two arcs have different values.
a: The first arc.
b: The second arc.
Returns: true if any value of the two arcs differ; otherwise false.

Rhino.Geometry.Arc.BoundingBox
Computes the 3D axis aligned bounding box for this arc.
Returns: Bounding box of arc.

Rhino.Geometry.Arc.PointAt(System.Double)
Gets the point at the given arc parameter.
t: Arc parameter to evaluate.
Returns: The point at the given parameter.

Rhino.Geometry.Arc.TangentAt(System.Double)
Gets the tangent at the given parameter.
t: Parameter of tangent to evaluate.
Returns: The tangent at the arc at the given parameter.

Rhino.Geometry.Arc.ClosestParameter(Rhino.Geometry.Point3d)
Gets parameter on the arc closest to a test point.
testPoint: Point to get close to.
Returns: Parameter (in radians) of the point on the arc that
is closest to the test point. If testPoint is the center
of the arc, then the starting point of the arc is
(arc.Domain()[0]) returned. If no parameter could be found,
RhinoMath.UnsetValue is returned.

Rhino.Geometry.Arc.ClosestPoint(Rhino.Geometry.Point3d)
Computes the point on an arc that is closest to a test point.
testPoint: Point to get close to.
Returns:
The point on the arc that is closest to testPoint. If testPoint is
the center of the arc, then the starting point of the arc is returned.
UnsetPoint on failure.

Rhino.Geometry.Arc.Reverse
Reverses the orientation of the arc. Changes the domain from [a,b]
to [-b,-a].

Rhino.Geometry.Arc.Transform(Rhino.Geometry.Transform)
Transforms the arc using a Transformation matrix.
xform: Transformations to apply.
Note that arcs cannot handle non-euclidian transformations.
Returns: true on success, false on failure.

Rhino.Geometry.Arc.ToNurbsCurve
Initializes a nurbs curve representation of this arc.
This amounts to the same as calling NurbsCurve.CreateFromArc().
Returns: A nurbs curve representation of this arc or null if no such representation could be made.

Rhino.Geometry.Arc.Unset
Gets an Arc with Unset components.

Rhino.Geometry.Arc.IsValid
Gets a value indicating whether or not this arc is valid.
Detail:
Radius>0 and 0<AngleRadians()<=2*Math.Pi.
Returns: true if the arc is valid.

Rhino.Geometry.Arc.IsCircle
Gets a value indicating whether or not this arc is a complete circle.

Rhino.Geometry.Arc.Plane
Gets or sets the plane in which this arc lies.

Rhino.Geometry.Arc.Radius
Gets or sets the radius of this arc.

Rhino.Geometry.Arc.Diameter
Gets or sets the Diameter of this arc.

Rhino.Geometry.Arc.Center
Gets or sets the center point for this arc.

Rhino.Geometry.Arc.Circumference
Gets the circumference of the circle that is coincident with this arc.

Rhino.Geometry.Arc.Length
Gets the length of the arc. (Length = Radius * (subtended angle in radians)).

Rhino.Geometry.Arc.StartPoint
Gets the start point of the arc.

Rhino.Geometry.Arc.MidPoint
Gets the mid-point of the arc.

Rhino.Geometry.Arc.EndPoint
Gets the end point of the arc.

Rhino.Geometry.Arc.AngleDomain
Gets or sets the angle domain (in Radians) of this arc.

Rhino.Geometry.Arc.StartAngle
Gets or sets the start angle (in Radians) for this arc segment.

Rhino.Geometry.Arc.EndAngle
Gets or sets the end angle (in Radians) for this arc segment.

Rhino.Geometry.Arc.Angle
Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment.

Rhino.Geometry.Arc.StartAngleDegrees
Gets or sets the start angle (in Radians) for this arc segment.

Rhino.Geometry.Arc.EndAngleDegrees
Gets or sets the end angle (in Radians) for this arc segment.

Rhino.Geometry.Arc.AngleDegrees
Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment.