Rhino.ApplicationSettings.EdgeAnalysisSettingsState.ShowEdgeColor
Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.

Rhino.ApplicationSettings.EdgeAnalysisSettingsState.ShowEdges
Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.