Rhino.Runtime.InteropWrappers.ClassArrayObjRef.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayObjRef instance.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Initializes a new instances from a set of ObjRefs
objrefs: An array, a list or any enumerable set of Rhino object references.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Add(Rhino.DocObjects.ObjRef)
Adds an ObjRef to the list.
objref: An ObjRef to add.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Count
Gets the number of CRhinoObjRef instances in this array.