Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer
Wrapper for a C++ ON_SimpleArray of ON_Curve* or const ON_Curve*.  If you are not
writing C++ code, then you can ignore this class.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer instance, from a set of input curves.
curves: A list, an array or any collection of curves that implements the enumerable interface.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.