Rhino.Geometry.PointCloudItem
Represents a single item in a pointcloud. A PointCloud item
always has a location, but it has an optional normal vector and color.

Rhino.Geometry.PointCloudItem.Location
Gets or sets the location of this point cloud item.

Rhino.Geometry.PointCloudItem.X
Gets or sets the X component of this point cloud item location.

Rhino.Geometry.PointCloudItem.Y
Gets or sets the Y component of this point cloud item location.

Rhino.Geometry.PointCloudItem.Z
Gets or sets the Z component of this point cloud item location.

Rhino.Geometry.PointCloudItem.Normal
Gets or sets the normal vector for this point cloud item.

Rhino.Geometry.PointCloudItem.Color
Gets or sets the color of this point cloud item.

Rhino.Geometry.PointCloudItem.Hidden
Gets or sets the hidden flag of this point cloud item.

Rhino.Geometry.PointCloudItem.Index
Gets the index of this point cloud item.