Rhino.DocObjects.ObjectEnumeratorSettings
Settings used for getting an enumerator of objects in a document
See Rhino.Collections.ObjectTable.GetEnumerator()

Rhino.DocObjects.ObjectEnumeratorSettings.#ctor


Rhino.DocObjects.ObjectEnumeratorSettings.NameFilter
